////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Автотест") Тогда
		Возврат;
	КонецЕсли;
	
	РазрешениеЭкрана = Перечисления.РазрешенияЭкрана._240х320;
	
	РабочееМестоРаботникаСкладаСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РабочееМестоРаботникаСкладаКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			//Преобразуем предварительно к ожидаемому формату
			Если Параметр[1] = Неопределено Тогда
				Штрихкод = Параметр[0];
			Иначе
				Штрихкод = Параметр[1][1];
			КонецЕсли;
			
			Если ПараметрыРежима.Режим = "ЗапросИнформации" Тогда
				
				ВывестиИнформациюПоШтрихкодуНаСервере(Штрихкод);
				
			ИначеЕсли ПараметрыРежима.Режим = "Сканирование" Тогда
				
				ПриСканированииЗначенияНаСервере(Штрихкод);
				
				#Если НЕ ВебКлиент Тогда
				Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
					Сигнал();
				КонецЕсли;
				#КонецЕсли
				
			Иначе
				
				// Данный режим не предназначен для сканирования.
				#Если НЕ ВебКлиент Тогда
				Сигнал();
				#КонецЕсли
				
			КонецЕсли;
			
			ПодключитьОбработчикОжидания("Подключаемый_ВывестиСостояниеВыполненияЗаданияОбработчикОжидания", 5, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПередЗакрытиемНаСервере(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	РабочееМестоРаботникаСкладаКлиент.ПриЗакрытии(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ Задания

&НаКлиенте
Процедура СписокЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЗаданийВыборНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОсновноеМенюОбновить(Команда)
	
	ОсновноеМенюОбновитьНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ЗаданияВыбрать(Команда)
	
	ЗаданияВыбратьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеВвестиКоличество(Команда)
	
	СканированиеВвестиКоличествоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличестваКоличествоПриИзменении(Элемент)
	
	РабочееМестоРаботникаСкладаКлиент.ВводКоличестваКоличествоПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВводКоличестваОКОбработчикОжидания()
	
	ВводКоличестваОКОбработчикОжиданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличестваОК(Команда)
	
	РабочееМестоРаботникаСкладаКлиент.ВводКоличестваОК(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличестваОтмена(Команда)
	
	ВводКоличестваОтменаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюИнформация(Команда)
	
	ОсновноеМенюИнформацияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПерейтиВОсновноеМеню(Команда)
	
	ЗаданияПерейтиВОсновноеМенюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПоказатьВсе(Команда)
	
	ЗаданияПоказатьВсеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияЗакрыть(Команда)
	
	ИнформацияЗакрытьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюОтбор(Команда)
	
	ОсновноеМенюОтборНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюПриемка(Команда)
	
	ОсновноеМенюПриемкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюПроверкаОтбора(Команда)
	
	ОсновноеМенюПроверкаОтбораНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюРазмещение(Команда)
	
	ОсновноеМенюРазмещениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюПеремещение(Команда)
	
	ОсновноеМенюПеремещениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюПересчет(Команда)
	
	ОсновноеМенюПересчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеМенюЗакрыть(Команда)
	
	ОсновноеМенюЗакрытьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеИнформация(Команда)
	
	СканированиеИнформацияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеЯчейка(Команда)
	
	РабочееМестоРаботникаСкладаКлиент.СканированиеЯчейка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеСерия(Команда)
	
	ТекстСообщенияПользователю = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеТовар(Команда)
	
	СканированиеТоварНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеСкладскоеЗадание(Команда)
	
	СоздатьНовоеСкладскоеЗаданиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеДействия(Команда)
	
	СканированиеДействияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеДалее(Команда)
	
	СканированиеДалееНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуМобильногоРабочегоМеста(Команда)
	
	РабочееМестоРаботникаСкладаКлиент.ЗакрытьФормуМобильногоРабочегоМеста(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НеЗакрыватьФормуМобильногоРабочегоМеста(Команда)
	
	НеЗакрыватьФормуМобильногоРабочегоМестаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнениеЗадания(Команда)
	
	ОтменитьВыполнениеЗаданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнениеЗадания(Команда)
	
	ЗавершитьВыполнениеЗаданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКРазмещениюТоваров(Команда)
	
	ПерейтиКРазмещениюТоваровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСледующемуТоваруСканирования(Команда)
	
	ПерейтиКСледующейСтрокеСканированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСледующейЯчейкеСканирования(Команда)
	
	ПерейтиКСледующейЯчейкеСканированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеВвестиЗначение(Команда)
	
	СканированиеВвестиЗначениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборЗначенияОКОбработчикОжидания()
	
	ВыборЗначенияОКОбработчикОжиданиянаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияОК(Команда)
	
	РабочееМестоРаботникаСкладаКлиент.ВыборЗначенияОК(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияОтмена(Команда)
	
	ВыборЗначенияОтменаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПараметраСканированияПриИзменении(Элемент)
	
	РабочееМестоРаботникаСкладаКлиент.ШтрихкодПараметраСканированияПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокГодностиСерииПриИзменении(Элемент)
	
	РабочееМестоРаботникаСкладаКлиент.СрокГодностиСерииПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСканированию(Команда)
	
	ПерейтиКСканированиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПриемкеТоваров(Команда)
	
	ПерейтиКПриемкеТоваровНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЗапросуИнформации(Команда)
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиНаСтраницу(ЭтаФорма,"СтраницаЗапросИнформации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаПредыдущуюСтраницу(Команда)
	
	ПерейтиНаПредыдущуюСтраницуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКВыполнениюЗадания(Команда)
	
	ВернутьсяКВыполнениюЗаданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВыборуЗаданияНаОтбор(Команда)
	
	ПерейтиКВыборуЗаданияНаОтборНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВыборуЗаданияНаРазмещение(Команда)
	
	ПерейтиКВыборуЗаданияНаРазмещениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВыборуЗаданияНаПеремещение(Команда)
	
	ПерейтиКВыборуЗаданияНаПеремещениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВыборуЗаданияНаПересчет(Команда)
	
	ПерейтиКВыборуЗаданияНаПересчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияОбновить(Команда)
	
	РабочееМестоРаботникаСкладаКлиент.ЗаданияОбновить(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписокЗаданийОбработчикОжидания()
	
	ОбновитьСписокЗаданийОбработчикОжиданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗонуПриемкиРазмещения(Команда)
	
	ПриВыбореЗоныПриемкиРазмещенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборЗоныПриемкиРазмещения(Команда)
	
	ОтменитьВыборЗоныПриемкиРазмещенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗоныПриемкиРазмещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьВыполнениеЗадания(Команда)
	
	ОтменитьВыполнениеЗаданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗоныПриемкиРазмещенияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗоныПриемкиРазмещенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗоныПриемкиРазмещенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПриВыбореЗоныПриемкиРазмещенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиСостояниеВыполненияЗаданияОбработчикОжидания()
	
	ВывестиСостояниеВыполненияЗаданияОбработчикОжиданияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюОбновитьНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ОбновитьОсновноеМеню(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовоеСкладскоеЗаданиеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СоздатьНовоеСкладскоеЗадание(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыполнениеЗаданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ОтменитьВыполнениеЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыполнениеЗаданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ЗавершитьВыполнениеЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКРазмещениюТоваровНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПриЗавершенииСканированияТоваровТекущегоЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСледующейСтрокеСканированияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКСледующейСтрокеСканирования(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСледующейЯчейкеСканированияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКСледующейЯчейкеСканирования(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеВвестиЗначениеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СканированиеВвестиЗначение(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСканированиюНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКСканированию(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКПриемкеТоваровНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКПриемкеТоваров(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюОтборНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Отбор");
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюЗакрытьНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ОсновноеМенюЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаданияПерейтиВОсновноеМенюНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуСкладскойОперации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеДалееНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СканированиеДалее(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюИнформацияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКПолучениюИнформации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеИнформацияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКПолучениюИнформации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗаданийОбработчикОжиданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ОбновитьСписокЗаданийОбработчикОжидания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НеЗакрыватьФормуМобильногоРабочегоМестаНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.НеЗакрыватьФормуМобильногоРабочегоМеста(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияЗакрытьНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ИнформацияЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере(Отказ, СтандартнаяОбработка)
	
	РабочееМестоРаботникаСкладаСервер.ПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаданияПоказатьВсеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ОтобразитьВсеТолькоСвоиСкладскиеЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаданияВыбратьНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПриВыбореЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеДействияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СканированиеДействия(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВыборЗначенияОтменаНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВыборЗначенияОтмена(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВернутьсяКВыполнениюЗаданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВернутьсяКВыполнениюЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеТоварНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВывестиИнформациюПоТекущемуТовару(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВыборЗначенияОКОбработчикОжиданиянаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВыборЗначенияОКОбработчикОжидания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСостояниеВыполненияЗаданияОбработчикОжиданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВывестиСостояниеВыполненияЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюРазмещениеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Размещение");
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюПеремещениеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Перемещение");
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюПроверкаОтбораНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "ПроверкаОтбора");
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюПересчетНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Пересчет");
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеМенюПриемкаНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Приемка");
	
КонецПроцедуры

&НаСервере
Процедура ПриВыбореЗоныПриемкиРазмещенияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПриВыбореЗоныПриемкиОтгрузки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СписокЗаданийВыборНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СписокЗаданийВыбор(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеВвестиКоличествоНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СканированиеВвестиКоличество(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВводКоличестваОКОбработчикОжиданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВводКоличестваОКОбработчикОжидания(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВводКоличестваОтменаНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ВводКоличестваОтмена(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВыборуСкладскойОперации(Команда)
	
	ПерейтиКВыборуСкладскойОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКВыборуСкладскойОперацииНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуСкладскойОперации(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеНеОтгружать(Команда)
	
	СканированиеНеОтгружатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СканированиеНеОтгружатьНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СканированиеНеОтгружать(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаПредыдущуюСтраницуНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиНаПредыдущуюСтраницу(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СервисИнформация(Команда)
	
	СервисИнформацияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СервисСхемаСканирования(Команда)
	
	СервисСхемаСканированиянаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеСервис(Команда)
	
	СканированиеСервисНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СервисИнформацияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКПолучениюИнформации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СканированиеСервисНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СканированиеСервис(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПродолжитьСканирование(Команда)
	
	СервисПродолжитьСканированиеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СервисПродолжитьСканированиеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СервисПродолжитьСканирование(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СервисСхемаСканированияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.СервисСхемаСканирования(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыборЗоныПриемкиРазмещенияНаСервере()

	РабочееМестоРаботникаСкладаСервер.ВернутьсяКВыполнениюЗадания(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ВывестиИнформациюПоШтрихкодуНаСервере(Штрихкод)
	
	РабочееМестоРаботникаСкладаСервер.ВывестиИнформациюПоШтрихкоду(ЭтаФорма, Штрихкод);
	
КонецПроцедуры

&НаСервере
Процедура ПриСканированииЗначенияНаСервере(Штрихкод)
	
	РабочееМестоРаботникаСкладаСервер.ПриСканированииЗначения(ЭтаФорма, Штрихкод);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКВыборуЗаданияНаРазмещениеНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Размещение");
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКВыборуЗаданияНаПеремещениеНаСервере()

	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Перемещение");

КонецПроцедуры

&НаСервере
Процедура ПерейтиКВыборуЗаданияНаПересчетНаСервере()

	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Пересчет");

КонецПроцедуры

&НаСервере
Процедура ПерейтиКВыборуЗаданияНаОтборНаСервере()

	РабочееМестоРаботникаСкладаСервер.ПерейтиКВыборуЗадания(ЭтаФорма, "Отбор");

КонецПроцедуры
