
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьНачальныеЗначенияРеквизитов();
	
	УстановитьВидимостьДоступностьЗависимыхЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ТребуетсяОбновлениеИнтерфейса Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ЕдиницаИзмеренияВесаПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПересчетаВТонныПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПересчетаВКубическиеМетрыПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияЛинейныхРазмеровПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияОбъемаПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПересчетаВЕдиницыОбъемаПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьУникальностьРабочегоНаименованияНоменклатурыИХарактеристикПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьХарактеристикиНоменклатурыПриИзменении(Элемент)
	
	Если Не НаборКонстант.ИспользоватьХарактеристикиНоменклатуры Тогда
		Элементы.ИспользоватьХарактеристикиНоменклатуры.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		Элементы.ИспользоватьХарактеристикиНоменклатуры.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУпаковкиНоменклатурыПриИзменении(Элемент)
	
	Если Не НаборКонстант.ИспользоватьУпаковкиНоменклатуры Тогда
		Элементы.ИспользоватьУпаковкиНоменклатуры.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		Элементы.ИспользоватьУпаковкиНоменклатуры.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСерииНоменклатурыПриИзменении(Элемент)
	
	Если Не НаборКонстант.ИспользоватьСерииНоменклатуры Тогда
		Элементы.ИспользоватьСерииНоменклатуры.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		Элементы.ИспользоватьСерииНоменклатуры.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКачествоТоваровПриИзменении(Элемент)
	
	Если Не НаборКонстант.ИспользоватьКачествоТоваров Тогда
		Элементы.ИспользоватьКачествоТоваров.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		Элементы.ИспользоватьКачествоТоваров.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбобщенныйУчетНекачественныхТоваровПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНоменклатуруПоставщиковПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНоменклатуруПродаваемуюСовместноПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрироватьШтрихкодПриСозданииНоменклатурыПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьУникальностьНоменклатурыИХарактеристикПоСочетаниюЗначенийРеквизитовПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьИндивидуальныеХарактеристикиПриСозданииНоменклатурыПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьИндивидуальныеУпаковкиПриСозданииНоменклатурыПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМногооборотнуюТаруПриИзменении(Элемент)
	
	Если Не НаборКонстант.ИспользоватьМногооборотнуюТару Тогда
		Элементы.ИспользоватьМногооборотнуюТару.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		Элементы.ИспользоватьМногооборотнуюТару.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьНастройкиНоменклатурыПродаваемойСовместно(Команда)
	
	ОткрытьФормуМодально("РегистрСведений.НоменклатураПродаваемаяСовместно.Форма.НастройкаПоискаАссоциаций", Неопределено);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервереБезКонтекста
Функция ОтображениеПредупреждения(Отображать)
	
	Если Отображать Тогда
		Возврат ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	Возврат ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	
КонецФункции
	
////////////////////////////////////////////////////////////////////////////////
// Обновление интерфейса

&НаКлиенте 
Процедура ПодключитьОбработчикОжиданияОбновленияИнтерфейса()
	
	ТребуетсяОбновлениеИнтерфейса = Истина;
	
	#Если НЕ ВебКлиент Тогда
	ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновленияИнтерфейса", 1, Истина);
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработчикОжиданияОбновленияИнтерфейса()
	
	ОбновитьИнтерфейс();
	
	ТребуетсяОбновлениеИнтерфейса = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Изменение реквизитов

&НаСервере
Процедура ИнициализироватьНачальныеЗначенияРеквизитов()
	
	// Инициализация набора констант
	НаборКонстантОбъект = ДанныеФормыВЗначение(НаборКонстант, Тип("КонстантыНабор"));
	НаборКонстантОбъект.Прочитать();
	ЗначениеВДанныеФормы(НаборКонстантОбъект, НаборКонстант);
	
КонецПроцедуры

&НаСервере 
Процедура СохранитьЗначениеКонстанты(ИмяКонстанты)
	
	УстановитьЗначениеКонстантыПоИмени(ИмяКонстанты);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ВыполнитьМетодыПослеУстановкиЗначенияКонстанты(ИмяКонстанты);
	
КонецПроцедуры

&НаСервере 
Процедура ВыполнитьМетодыПослеУстановкиЗначенияКонстанты(ИмяКонстанты)
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЗначениеКонстантыПоИмени(ИмяКонстанты)
	
	Если Константы[ИмяКонстанты].Получить() <> НаборКонстант[ИмяКонстанты] Тогда
		Константы[ИмяКонстанты].Установить(НаборКонстант[ИмяКонстанты]);
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЗависимыхЭлементовФормы(ИмяКонстанты);
	
	УстановитьЗначенияЗависимыхКонстант(ИмяКонстанты);
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЗначенияЗависимыхКонстант(ИмяРодительскойКонстанты)
	
	Если ИмяРодительскойКонстанты = "ИспользоватьКачествоТоваров" Тогда
		
		Если Не НаборКонстант.ИспользоватьКачествоТоваров Тогда
			НаборКонстант.ИспользоватьОбобщенныйУчетНекачественныхТоваров = Ложь;
			УстановитьЗначениеКонстантыПоИмени("ИспользоватьОбобщенныйУчетНекачественныхТоваров");
		КонецЕсли;
	
	ИначеЕсли ИмяРодительскойКонстанты = "ИспользоватьХарактеристикиНоменклатуры" Тогда
		
			НаборКонстант.ДобавлятьИндивидуальныеХарактеристикиПриСозданииНоменклатуры = НаборКонстант.ИспользоватьХарактеристикиНоменклатуры;
			УстановитьЗначениеКонстантыПоИмени("ДобавлятьИндивидуальныеХарактеристикиПриСозданииНоменклатуры");
		
	ИначеЕсли ИмяРодительскойКонстанты = "ИспользоватьУпаковкиНоменклатуры" Тогда
		
			НаборКонстант.ДобавлятьИндивидуальныеУпаковкиПриСозданииНоменклатуры = НаборКонстант.ИспользоватьУпаковкиНоменклатуры;
			УстановитьЗначениеКонстантыПоИмени("ДобавлятьИндивидуальныеУпаковкиПриСозданииНоменклатуры");
			
	ИначеЕсли ИмяРодительскойКонстанты = "ИспользоватьМногооборотнуюТару" Тогда
		
		Если НЕ НаборКонстант.ИспользоватьМногооборотнуюТару Тогда
			НаборКонстант.ПредлагатьДополнитьДокументыМногооборотнойТарой = Ложь;
			УстановитьЗначениеКонстантыПоИмени("ПредлагатьДополнитьДокументыМногооборотнойТарой");
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЗависимыхЭлементовФормы(ИмяКонстанты = Неопределено)
	
	// Настройки, выполняемые однократно, только при создании формы
	Если ИмяКонстанты = Неопределено Тогда
		Элементы.ИспользоватьУпаковкиНоменклатуры.ОтображениеПредупрежденияПриРедактировании 		= ОтображениеПредупреждения(НаборКонстант.ИспользоватьУпаковкиНоменклатуры);
		Элементы.ИспользоватьХарактеристикиНоменклатуры.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупреждения(НаборКонстант.ИспользоватьХарактеристикиНоменклатуры);
		Элементы.ИспользоватьСерииНоменклатуры.ОтображениеПредупрежденияПриРедактировании 			= ОтображениеПредупреждения(НаборКонстант.ИспользоватьСерииНоменклатуры);
		Элементы.ИспользоватьКачествоТоваров.ОтображениеПредупрежденияПриРедактировании 			= ОтображениеПредупреждения(НаборКонстант.ИспользоватьКачествоТоваров);
		Элементы.ИспользоватьМногооборотнуюТару.ОтображениеПредупрежденияПриРедактировании 			= ОтображениеПредупреждения(НаборКонстант.ИспользоватьМногооборотнуюТару);
	КонецЕсли;
	
	// Настройки, выполняемые при создании формы и при изменении соответствующего элемента формы
	Если ИмяКонстанты = "ИспользоватьКачествоТоваров" Или ИмяКонстанты = Неопределено Тогда
		Элементы.ИспользоватьОбобщенныйУчетНекачественныхТоваров.Доступность = НаборКонстант.ИспользоватьКачествоТоваров;
	КонецЕсли;
	
	Если ИмяКонстанты = "ИспользоватьХарактеристикиНоменклатуры" ИЛИ ИмяКонстанты = Неопределено Тогда
		Элементы.ДобавлятьИндивидуальныеХарактеристикиПриСозданииНоменклатуры.Доступность = НаборКонстант.ИспользоватьХарактеристикиНоменклатуры;
	КонецЕсли;
	
	Если ИмяКонстанты = "ИспользоватьУпаковкиНоменклатуры" ИЛИ ИмяКонстанты = Неопределено Тогда
		Элементы.ДобавлятьИндивидуальныеУпаковкиПриСозданииНоменклатуры.Доступность = НаборКонстант.ИспользоватьУпаковкиНоменклатуры;
	КонецЕсли;
	
	Если ИмяКонстанты = "ИспользоватьНоменклатуруПродаваемуюСовместно" Или ИмяКонстанты = Неопределено Тогда
		Элементы.ОткрытьНастройкиНоменклатурыПродаваемойСовместно.Доступность = НаборКонстант.ИспользоватьНоменклатуруПродаваемуюСовместно;
	КонецЕсли;
	
	Если ИмяКонстанты = "ИспользоватьМногооборотнуюТару" Или ИмяКонстанты = Неопределено Тогда
		Элементы.ПредлагатьДополнитьДокументыМногооборотнойТарой.Доступность = НаборКонстант.ИспользоватьМногооборотнуюТару;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантПредлагатьДополнитьДокументыМногооборотнойТаройПриИзменении(Элемент)
	
	СохранитьЗначениеКонстанты(Элемент.Имя);
	
КонецПроцедуры

