////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы

// Обработчик обновления УП 2.0.2.16
// Заполняет измерение "Склад"
//
Процедура ЗаполнитьСкладВРегистре() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Период,
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.НомерСтроки,
	|	Движения.Активность,
	|	Движения.ВидДвижения,
	|	Движения.ЗаказНаВнутреннееПотребление,
	|	Движения.Номенклатура,
	|	Движения.Характеристика,
	|	Движения.КодСтроки,
	|	ВЫРАЗИТЬ(Движения.ЗаказНаВнутреннееПотребление КАК Документ.ЗаказНаВнутреннееПотребление).Склад КАК Склад,
	|	Движения.Заказано,
	|	Движения.КОформлению
	|ИЗ
	|	РегистрНакопления.ЗаказыНаВнутреннееПотребление КАК Движения
	|ГДЕ
	|	Движения.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Движения.Регистратор
	|			ИЗ
	|				РегистрНакопления.ЗаказыНаВнутреннееПотребление КАК Движения
	|			ГДЕ
	|				Движения.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И Движения.ЗаказНаВнутреннееПотребление ССЫЛКА Документ.ЗаказНаВнутреннееПотребление)
	|ИТОГИ ПО
	|	Регистратор";
	
	Результат = Запрос.Выполнить();
	ВыборкаРегистратор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НаборЗаписей = РегистрыНакопления.ЗаказыНаВнутреннееПотребление.СоздатьНаборЗаписей();
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Выборка = ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

