#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВсегоЗаписей = ЭтотОбъект.Количество();
	
	Если ВсегоЗаписей > 1 Тогда
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			Индекс = ЭтотОбъект.Индекс(Запись);
			
			Если Не ЗначениеЗаполнено(Запись.Подразделение) И Не ЗначениеЗаполнено(Запись.МетодУправления) Тогда
				
				Сообщение = Новый СообщениеПользователю();
		        Сообщение.Текст = НСтр("ru = 'В строке %Индекс% не указаны обеспечивающее подразделение и метод управления запасами'");
				Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Индекс%", Индекс);
				Сообщение.Поле = "[" + Индекс + "].МетодУправления";
		        Сообщение.УстановитьДанные(ЭтотОбъект);
		        Сообщение.Сообщить();
		        Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;

	ИначеЕсли ВсегоЗаписей = 1 Тогда
		
		Запись = ЭтотОбъект[0];
		Если Не ЗначениеЗаполнено(Запись.Подразделение) И Не ЗначениеЗаполнено(Запись.МетодУправления) Тогда
				
			Сообщение = Новый СообщениеПользователю();
	        Сообщение.Текст = НСтр("ru = 'Необходимо указать хотя бы один параметр: метод управления запасами или обеспечивающее подразделение'");
			Сообщение.Поле = "МетодУправления";
	        Сообщение.УстановитьДанные(ЭтотОбъект);
	        Сообщение.Сообщить();
	        Отказ = Истина;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли