&НаКлиенте
Процедура ОбновитьПараметрыДинамическихЗапросов()
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ВыбранныеЗаказы", ВыбранныеЗаказы.ВыгрузитьЗначения()); 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоЗаказамПоставщикам = Параметры.ПоЗаказамПоставщикам;
	ВыбранныеЗаказы = Параметры.ВыбранныеЗаказы.Скопировать();
	
	Если ПоЗаказамПоставщикам Тогда
		
		ИсключаемыеСтатусы = Новый СписокЗначений;
		ИсключаемыеСтатусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
		//ИсключаемыеСтатусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.НеСогласован);
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ИсключаемыеСтатусы", ИсключаемыеСтатусы);
		
	Иначе
		
		СписокЗаказов.ТекстЗапроса =
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ДокументыЗаказ.Ссылка В (&ВыбранныеЗаказы)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Выбран,
			|	ДокументыЗаказ.Приоритет,
			|	ДокументыЗаказ.Ссылка КАК Документ,
			|	ДокументыЗаказ.Партнер,
			|	ДокументыЗаказ.Организация,
			|	ДокументыЗаказ.Менеджер,
			|	ДокументыЗаказ.Статус,
			|	ДокументыЗаказ.СуммаДокумента,
			|	ДокументыЗаказ.ДополнительнаяИнформация,
			|	ДокументыЗаказ.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаПогрузкиРазгрузки,
			|	ДокументыЗаказ.Комментарий,
			|	ДокументыЗаказ.АК_ТребуетсяДоставка КАК ТребуетсяДоставка,
			|	ВЫБОР
			|		КОГДА ИСТИНА
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ПустаяСсылка)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ПустаяСсылка)
			|	КОНЕЦ КАК Состояние
			|ИЗ
			|	Документ.ЗаказКлиента КАК ДокументыЗаказ
			|ГДЕ
			|	ДокументыЗаказ.Проведен
			|	И (НЕ ДокументыЗаказ.Статус В (&ИсключаемыеСтатусы))
			|	И (НЕ ДокументыЗаказ.Ссылка В (&ВыбранныеЗаказы))";
			
		СписокЗаказов.ОсновнаяТаблица = "Документ.ЗаказКлиента";
		
		ИсключаемыеСтатусы = Новый СписокЗначений;
		ИсключаемыеСтатусы.Добавить(Перечисления.СтатусыЗаказовКлиентов.Закрыт);
		//ИсключаемыеСтатусы.Добавить(Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ИсключаемыеСтатусы", ИсключаемыеСтатусы);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПометкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПоставщикуПометкаПриИзменении(Элемент)
	
	Сообщить("Изменено");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПараметрыДинамическихЗапросов();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Этаформа.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Если ПоЗаказамПоставщикам Тогда
		текстОповещения = "ВыбраныЗаказыПоставщикам";
	Иначе
		текстОповещения = "ВыбраныЗаказыКлиента";
	КонецЕсли;
	
	ВыделенныеЗаказы = Новый СписокЗначений;
	ВыделенныеЗаказы.ЗагрузитьЗначения(Элементы.СписокЗаказов.ВыделенныеСтроки);
	Для Каждого Заказ Из ВыделенныеЗаказы Цикл
		
		Если ВыбранныеЗаказы.НайтиПоЗначению(Заказ.Значение) = Неопределено Тогда
			ДобавляемыеЗаказы.Добавить(Заказ.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Оповестить(ТекстОповещения, ДобавляемыеЗаказы);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
