
// ЗАПОЛНЕНИЕ ЗАДАЧ

// ОБРАБОТКА ЗАКАЗА, ПРОВЕРКА РЕКВИЗИТОВ
Процедура ОбработкаЗаказаКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекСтр из ФормируемыеЗадачи цикл
		ТекСтр.Автор = ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.ДатаНачала = ТекущаяДата();
		ТекСтр.АвторСтрокой =ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.СрокИсполнения = КонецДня(ТекущаяДата()); 
		ТекСтр.Наименование = "Проверить для монтажа "+ТекСтр.БизнесПроцесс.ЗаказКлиента;
		ТекСтр.Описание = "Проверить заполнение реквизитов, уточнить контактные данные, уточнить данные о монтаже";
	КонецЦикла;
КонецПроцедуры

// ОБРАБОТКА ОТКАЗА
Процедура ОбработкаОтказаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекСтр из ФормируемыеЗадачи цикл
		ТекСтр.Автор = ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.ДатаНачала = ТекущаяДата();
		ТекСтр.АвторСтрокой =ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.СрокИсполнения = КонецДня(ТекущаяДата()); 
		ТекСтр.Наименование = "Обработать отказ в монтаже для " + ТекСтр.БизнесПроцесс.ЗаказКлиента;
		ТекСтр.Описание = ТекСтр.БизнесПроцесс.Комментарий;
		ТекСтр.Исполнитель = ТекСтр.БизнесПроцесс.ЗаказКлиента.Менеджер;
	КонецЦикла;
КонецПроцедуры

// СОЗДАНИЕ ЗАКАЗА НА ДОСТАВКУ
Процедура ОбеспечитьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекСтр из ФормируемыеЗадачи цикл
		ТекСтр.Автор = ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.ДатаНачала = ТекущаяДата();
		ТекСтр.АвторСтрокой =ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.СрокИсполнения = КонецДня(ТекСтр.БизнесПроцесс.ЗаказКлиента.ДатаОтгрузки); 
		ТекСтр.Наименование = "Сформировать монтаж для "+ТекСтр.БизнесПроцесс.ЗаказКлиента;
		ТекСтр.Описание = "Сформировать заказ на монтаж";
	КонецЦикла;
КонецПроцедуры

// ЗАКРЫТИЕ ЗАКАЗА НА ДОСТАВКУ
Процедура ПолучитьДокументыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекСтр из ФормируемыеЗадачи цикл
		ТекСтр.Автор = ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.ДатаНачала = ТекущаяДата();
		ТекСтр.АвторСтрокой =ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.Наименование = "Закрыть заказы на монтаж";
		ТекСтр.Описание = "Закрыть заказы на монтаж, сформировать приходные документы";
	КонецЦикла;
КонецПроцедуры

// ЗАКРЫТИЕ ЗАКАЗА КЛИЕНТА
Процедура ЗакрытьПроектПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекСтр из ФормируемыеЗадачи цикл
		ТекСтр.Автор = ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.ДатаНачала = ТекущаяДата();
		ТекСтр.АвторСтрокой =ПараметрыСеанса.ТекущийПользователь;
		ТекСтр.СрокИсполнения = КонецДня(ТекСтр.БизнесПроцесс.ЗаказКлиента.ДатаОтгрузки);
		ТекСтр.Наименование = "Закрыть "+ТекСтр.БизнесПроцесс.ЗаказКлиента;
		ТекСтр.Описание = "Закрыть заказ клиента";
		ТекСтр.Исполнитель = ТекСтр.БизнесПроцесс.ЗаказКлиента.Менеджер;
	КонецЦикла;
КонецПроцедуры




// ПРОВЕРКА ВЫПОЛНЕНИЯ



Процедура ОбеспечитьЗаказПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если ЗаказыПоставщика.Количество() = 0 тогда
		Отказ = Истина;
		Сообщить("Заказ покупателя не размещен в заказах на монтаж",СтатусСообщения.Внимание);	
	КонецЕсли;
	
	Для каждого ТекДокумент из ЗаказыПоставщика цикл
		Если ТекДокумент.Документ.Статус <> Перечисления.СтатусыЗаказовПоставщикам.КПоступлению тогда
			Отказ = Истина;
			Сообщить("Не установлен статус 'к поступлению' у документа " + ТекДокумент.Документ,СтатусСообщения.Внимание);	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДокумент.Документ.АК_ДатаВремяИсполненияУслуги) тогда
			Отказ = Истина;
			Сообщить("Не установлена дата монтажа у документа " + ТекДокумент.Документ,СтатусСообщения.Внимание);	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры


Процедура ЗакрытьПроектПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ТекОб = ЗаказКлиента.ПолучитьОбъект();
	ТекОб.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	ПОпытка
		ТекОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекОб.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;		
КонецПроцедуры





// УСЛОВИЯ

Процедура ЗаказУтвержденПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ЗаказУтвержден;
	
КонецПроцедуры






