&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) <> Тип("Массив") Тогда
		МассивДокументов = Новый Массив();
		МассивДокументов.Добавить(ПараметрКоманды);
	Иначе
		МассивДокументов = ПараметрКоманды;
	КонецЕсли; 
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(МассивДокументов, ПараметрыВыполненияКоманды.Источник) Тогда
		
		ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии",
			Новый Структура("СверкаВзаиморасчетов", МассивДокументов),
			"СверкаВзаиморасчетов",
			Истина);
			
		ОткрытьФорму("Отчет.СверкаРасчетовСПартнерами.Форма",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно
		);
		
	КонецЕсли;
	
КонецПроцедуры
