
&НаСервере
Функция ПолучитьПрисоединенныйФайл(ИмяФайла, СсылкаНаОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПрисоединенныеФайлы.Ссылка
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &Ссылка
		|	И НоменклатураПрисоединенныеФайлы.Наименование ПОДОБНО &Наименование
		|	И НоменклатураПрисоединенныеФайлы.Расширение ПОДОБНО ""docx""";
	Запрос.УстановитьПараметр("Наименование", ИмяФайла);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.Ссылка);
			
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции


&НаСервере 
Функция ПолучитьМассивНоменклатуры(СсылкаНаОбъект)
	Товары=Новый Массив;
	
	Для каждого стр из СсылкаНаОбъект["Товары"] Цикл
//		Если стр.Активность Тогда
		Товар=Новый Структура("Артикул,Данные");	
	//	Товар.Номенклатура=стр.Номенклатура;
		Товар.Артикул=стр.Номенклатура.Артикул;
		ИмяФайлаБезРасширения = стр.Номенклатура.Артикул;
		Товар.Данные=ПолучитьПрисоединенныйФайл(ИмяФайлаБезРасширения, стр.Номенклатура);
        Товары.Добавить(Товар);
//		КонецЕсли;		
	КонецЦикла;
	Возврат Товары;
КонецФункции

&НаКлиенте
Процедура ОбработатьСписокТоваровНаКлиенте(СсылкаНаОбъект)
	Попытка  
		Ворд = Новый COMОбъект("Word.Application");				
	Исключение    
		Ворд.Application.Quit();				
//		#Если Клиент Тогда
//			Сообщить("Произошла ошибка открытия файла Microsoft Word", СтатусСообщения.Важное);
//		#КонецЕсли
		Возврат;      
	КонецПопытки;
	Ворд.Documents.Add();
	РезДок = Ворд.Application.ActiveDocument();
	НомерПП = 1;
	Товары=ПолучитьМассивНоменклатуры(СсылкаНаОбъект);
	Для каждого стр из Товары Цикл
		Если ЗначениеЗаполнено(стр.Данные) Тогда
			ИмяФайлаБезРасширения = стр.Артикул;

				ИмяФайла = КаталогВременныхФайлов() + ИмяФайлаБезРасширения +".docx";
				ДвоичныеДанные=стр.Данные;
				ДвоичныеДанные.Записать(ИмяФайла);
				Попытка
					Ворд.Documents.Add(ИмяФайла);
				Исключение
				КонецПопытки;
				Документ = Ворд.Application.ActiveDocument();
				Попытка

					Диапазон = Документ.Paragraphs.Item(1).Range;
					Диапазон.ParagraphFormat.Alignment = 0;
					Диапазон.InsertBefore(""+НомерПП+". ");
					НомерПП = НомерПП+1;
					Диапазон = Документ.Paragraphs.Item(2).Range;
					Диапазон.ParagraphFormat.Alignment = 0;
					Диапазон.InsertBefore("Количество: "+стр.Количество);
				Исключение 				 				
				КонецПопытки;
				Документ.Content.Copy();
				Диапазон = РезДок.Range(РезДок.Content.End-1, РезДок.Content.End-1);
				РезДок.Range(РезДок.Content.End-1, РезДок.Content.End-1).Paste();
				Документ.Close(0);
		КонецЕсли;
	КонецЦикла;
	РезДок.Activate();
	РезДок.Application.Visible = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		Для Каждого СсылкаНаОбъект Из ПараметрКоманды Цикл
			
			ОбработатьСписокТоваровНаКлиенте(СсылкаНаОбъект);
			
	//		//замена шаблона <[ИмяПараметра]> в документе ворд, на параметры данных
	//		попытка
	//			Для Каждого текЭлемент Из СтруктураДанных Цикл
	//				Замена = Документ.Content.Find;
	//				Замена.Execute("["+текЭлемент.Ключ+"]", Ложь, Истина, Ложь, , , Истина, , Ложь, Лев(Строка(текЭлемент.Значение),250));
	//			КонецЦикла;
	//		Исключение 				
	//			Сообщить(ОписаниеОшибки()); 				
	//		КонецПопытки;
	
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
