////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Добавляет к указанной коллекции строк дерева строку с описанием группы показателей
//
// Параметры:
//  КоллекцияСтрок - коллекция строк дерева, в которую добавляется строка
//  ИмяГруппы - имя добавляемой группы показателей
//  Заголовок - заголовок группы
//  Вид - число. 0- обычные показатели, 1- таблица
//
Процедура ДобавитьСтрокуГруппы(КоллекцияСтрок, ИмяГруппы, Заголовок, Вид = 0) Экспорт
	
	Если НЕ ТекущиеДелаПереопределяемый.ГруппаПоказателейДоступна(ИмяГруппы) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = КоллекцияСтрок.Добавить();
	СтрокаДерева.Показатель = ИмяГруппы;
	СтрокаДерева.Заголовок  = Заголовок;
	СтрокаДерева.Вид 		= Вид;
	СтрокаДерева.Отображать = Истина;
	
КонецПроцедуры

// Добавляет к указанной коллекции строк дерева строку с описанием показателя
//
// Параметры:
//  КоллекцияСтрок - коллекция строк дерева, в которую добавляется строка
//  Показатель - имя добавляемого показателя
//  Заголовок - заголовок показателя
//  ВидПоказателя - число. 0 - обычный показатель, 1 - таблица
//  ВыделятьЦветом - признак выделения цветом, Истина - выделять, ложь - нет
//
Процедура ДобавитьСтрокуПоказателя(КоллекцияСтрок, Показатель, Заголовок, Вид = 0, ВыделятьЦветом = Ложь) Экспорт
	
	Группа 				  = КоллекцияСтрок.Родитель;
	ДоступностьПоказателя = ТекущиеДелаПереопределяемый.ПоказательДоступен(Показатель, Группа.Показатель);
	
	Если НЕ ДоступностьПоказателя.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = КоллекцияСтрок.Добавить();
	СтрокаДерева.Показатель 	= Показатель;
	СтрокаДерева.Заголовок 		= Заголовок;
	СтрокаДерева.Вид 			= Вид;
	СтрокаДерева.ВыделятьЦветом = ВыделятьЦветом;
	СтрокаДерева.Отображать 	= Истина;
		
	Если Вид = 1 Тогда
		СтрокаДерева.ПоляТаблицы = ТекущиеДелаПереопределяемый.ПолучитьПоляТаблицы(Группа.Показатель, Показатель);
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру, содержащую описание поля
//
// Параметры:
//  ОписаниеТипов - Описание типов поля
//  ЗаголовокПоля - заголовок поля
//
// Возвращаемое значение: Структура, содержащая описание поля
//
Функция ПолучитьСтруктуруОписанияПоля(ОписаниеТипов, ЗаголовокПоля = "") Экспорт
	
	Возврат Новый Структура("ОписаниеТипов, Заголовок", ОписаниеТипов, ЗаголовокПоля);
	
КонецФункции

