////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементами();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// Общие справочники

&НаКлиенте
Процедура ОткрытьСправочникСтатьиДвиженияДенежныхСредств(Команда)
	
	ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникДоговорыЭквайринга(Команда)
	
	ОткрытьФорму("Справочник.ДоговорыЭквайринга.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСпособыРаспределенияПоНаправлениямДеятельности(Команда)
	
	ОткрытьФорму("Справочник.СпособыРаспределенияПоНаправлениямДеятельности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастройкаРаспределенияПоНаправлениямДеятельности(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастройкаМетодовОценкиСтоимостиТоваров(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкаМетодовОценкиСтоимостиТоваров.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНаправленияДеятельности(Команда)
	
	ОткрытьФорму("Справочник.НаправленияДеятельности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПрочиеРасходы(Команда)
	
	ОткрытьФорму("Справочник.ПрочиеРасходы.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСтатьиДоходов(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиДоходов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСтатьиРасходов(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиРасходов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементами()
	
	//Функциональные опции
	ИспользоватьОплатуПлатежнымиКартами		= ПолучитьФункциональнуюОпцию("ИспользоватьОплатуПлатежнымиКартами");
	ИспользоватьНесколькоКасс				= ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоКасс");
	ИспользоватьНесколькоРасчетныхСчетов	= ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоРасчетныхСчетов");
	ФормироватьФинансовыйРезультат			= ПолучитьФункциональнуюОпцию("ФормироватьФинансовыйРезультат");
	ИспользоватьУчетПрочихДоходовРасходов	= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов");
	
	
	//Право чтения
	ПравоДоступаДоговорыЭквайринга       = ПравоДоступа("Просмотр", Метаданные.Справочники.ДоговорыЭквайринга);
	ПравоДоступаНаправленияДеятельности  = ПравоДоступа("Просмотр", Метаданные.Справочники.НаправленияДеятельности);
	ПравоДоступаПрочиеРасходы            = ПравоДоступа("Просмотр", Метаданные.Справочники.ПрочиеРасходы);
	ПравоДоступаСтатьиДоходов            = ПравоДоступа("Просмотр", Метаданные.ПланыВидовХарактеристик.СтатьиДоходов);
	ПравоДоступаСтатьиРасходов           = ПравоДоступа("Просмотр", Метаданные.ПланыВидовХарактеристик.СтатьиРасходов);
	
	ПравоДоступаСтатьиДвиженияДенежныхСредств = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.СтатьиДвиженияДенежныхСредств
	);
	ПравоДоступаСпособыРаспределенияПоНаправлениямДеятельности   = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.СпособыРаспределенияПоНаправлениямДеятельности
	);
	ПравоДоступаНастройкаРаспределенияПоНаправлениямДеятельности = ПравоДоступа(
		"Просмотр",
		Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности
	);
	ПравоДоступаНастройкаМетодовОценкиСтоимостиТоваров = ПравоДоступа(
		"Просмотр",
		Метаданные.РегистрыСведений.НастройкаМетодовОценкиСтоимостиТоваров
	);
	
	//БанковскийСчетИКасса
	Элементы.ГруппаНастроекБанковскиеСчета.Видимость = НЕ ИспользоватьНесколькоРасчетныхСчетов;
	Элементы.ГруппаНастроекКассы.Видимость			 = НЕ ИспользоватьНесколькоКасс;
	
	//ДенежныеСредства
	Элементы.ГруппаНастроекСтатьиДвиженияДенежныхСредств.Видимость = ПравоДоступаСтатьиДвиженияДенежныхСредств;
	Элементы.ГруппаНастроекДоговорыЭквайринга.Видимость = ИспользоватьОплатуПлатежнымиКартами
		И ПравоДоступаДоговорыЭквайринга;
	
	//ФинансовыйРезультат
	Элементы.ГруппаНастроекСпособыРаспределенияПоНаправлениямДеятельности.Видимость = ФормироватьФинансовыйРезультат 
		И ПравоДоступаСпособыРаспределенияПоНаправлениямДеятельности;
	Элементы.ГруппаНастроекНастройкаРаспределенияПоНаправлениямДеятельности.Видимость = ФормироватьФинансовыйРезультат
		И ПравоДоступаНастройкаРаспределенияПоНаправлениямДеятельности;
	Элементы.ГруппаНастроекНастройкаМетодовОценкиСтоимостиТоваров.Видимость = ПравоДоступаНастройкаМетодовОценкиСтоимостиТоваров;
	
	//НастройкаАналитики
	Элементы.ГруппаНастроекНаправленияДеятельности.Видимость = ФормироватьФинансовыйРезультат
		И ПравоДоступаНаправленияДеятельности;
	Элементы.ГруппаНастроекПрочиеРасходы.Видимость = ИспользоватьУчетПрочихДоходовРасходов И ПравоДоступаПрочиеРасходы;
	Элементы.ГруппаНастроекСтатьиДоходов.Видимость = ИспользоватьУчетПрочихДоходовРасходов И ПравоДоступаСтатьиДоходов;
	Элементы.ГруппаНастроекСтатьиРасходов.Видимость = ИспользоватьУчетПрочихДоходовРасходов И ПравоДоступаСтатьиРасходов;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвойствоКасса(Команда)
	
	ОткрытьФорму("Справочник.Кассы.ФормаОбъекта",
		Новый Структура("Ключ",ПолучитьПервуюКассуНаСервере()),
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвойствоБанковскийСчет(Команда)
		
	ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.ФормаОбъекта",
		Новый Структура("Ключ",ПолучитьПервыйБанковскийСчетОрганизацииНаСервере()),
		ЭтаФорма);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьПервуюКассуНаСервере()
	
	Возврат ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию()
	
КонецФункции // ПолучитьПервуюКассуНаСервере()

&НаСервереБезКонтекста
Функция ПолучитьПервыйБанковскийСчетОрганизацииНаСервере()

	Возврат ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию();

КонецФункции // ПолучитьПервыйБанковскийСчетОрганизацииНаСервере()

