#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// СтандартныеПодсистемы.ВариантыОтчетов

// Настройки вариантов этого отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДвиженияСерийНоменклатурыКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияСерииТовара");
	ОписаниеВарианта.Размещение.Удалить(Метаданные.Подсистемы.Продажи.Подсистемы.ПродажиИВозвраты);
	
КонецПроцедуры // НастроитьВариантыОтчета

// Настройки зависимостей вариантов этого отчета от функциональных опций
//
Функция ФункциональныеОпцииВариантовОтчетов() Экспорт
	ФункциональныеОпцииВариантовОтчетов = ВариантыОтчетовУТПереопределяемый.ИнициализироватьФункциональныеОпцииВариантовОтчетов();
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ДвиженияСерииТовара", "ИспользоватьСерииНоменклатуры");
	
	Возврат ФункциональныеОпцииВариантовОтчетов;
КонецФункции

// Конец СтандартныеПодсистемы.ВариантыОтчетов
#КонецЕсли