
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АК_Договора") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоКомерческому(КоммерческоеПредложение) Экспорт
	РезультатЗапроса = ЗаполнитьТоварыПоКоммерческомуПредложению(КоммерческоеПредложение);
	ТЗ=Товары.Выгрузить();
	Для Каждого Стр Из  РезультатЗапроса Цикл
		НовСтр=ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;	
	//ТЗ.Свернуть("Ссылка,Номенклатура,Характеристика,Упаковка,ВидЦены,Цена,ПроцентРучнойСкидки,ПроцентАвтоматическойСкидки, СтавкаНДС,Активность,ТекстовоеОписание,КлючСвязи","КоличествоУпаковок,Количество,СуммаРучнойСкидки,СуммаАвтоматическойСкидки, СуммаНДС,Сумма");
	ЭтотОбъект.Товары.Загрузить(ТЗ);
	ЭтотОбъект.Товары.Свернуть("Номенклатура,Характеристика,ВидЦены,Цена,ПроцентРучнойСкидки,ПроцентАвтоматическойСкидки, СтавкаНДС,Активность,ТекстовоеОписание","КоличествоУпаковок,Количество,СуммаРучнойСкидки,СуммаАвтоматическойСкидки, СуммаНДС,Сумма");
КонецПроцедуры	


Функция ЗаполнитьТоварыПоКоммерческомуПредложению(КоммерческоеПредложение = Неопределено) Экспорт
 		
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	КоммерческоеПредложениеКлиентуТовары.Ссылка,
	             |	КоммерческоеПредложениеКлиентуТовары.НомерСтроки,
	             |	КоммерческоеПредложениеКлиентуТовары.Номенклатура,
	             |	КоммерческоеПредложениеКлиентуТовары.Характеристика,
	             |	КоммерческоеПредложениеКлиентуТовары.Упаковка,
	             |	КоммерческоеПредложениеКлиентуТовары.КоличествоУпаковок,
	             |	КоммерческоеПредложениеКлиентуТовары.Количество,
	             |	КоммерческоеПредложениеКлиентуТовары.ВидЦены,
	             |	КоммерческоеПредложениеКлиентуТовары.Цена,
	             |	КоммерческоеПредложениеКлиентуТовары.ПроцентРучнойСкидки,
	             |	КоммерческоеПредложениеКлиентуТовары.СуммаРучнойСкидки,
	             |	КоммерческоеПредложениеКлиентуТовары.ПроцентАвтоматическойСкидки,
	             |	КоммерческоеПредложениеКлиентуТовары.СуммаАвтоматическойСкидки,
	             |	КоммерческоеПредложениеКлиентуТовары.СтавкаНДС,
	             |	КоммерческоеПредложениеКлиентуТовары.СуммаНДС,
	             |	КоммерческоеПредложениеКлиентуТовары.Сумма,
	             |	КоммерческоеПредложениеКлиентуТовары.Активность,
	             |	КоммерческоеПредложениеКлиентуТовары.ТекстовоеОписание,
	             |	КоммерческоеПредложениеКлиентуТовары.КлючСвязи
	             |ИЗ
	             |	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуТовары
	             |ГДЕ
	             |	КоммерческоеПредложениеКлиентуТовары.Ссылка = &ДокументОснование
	             |	И КоммерческоеПредложениеКлиентуТовары.Активность = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", КоммерческоеПредложение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции // ЗаполнитьТабличнуюЧастьПоОстаткам()


Функция ПолучитьДокумент()

	
	ФормаЗаказы = Документы["КоммерческоеПредложениеКлиенту"].ПолучитьФормуВыбора();
	
	ФормаЗаказы.Заголовок = "Выберите коммерческое предложение клиенту для заполнения";
	ФормаЗаказы.РежимВыбора = Истина;
		
	КоммерческоеПредложение = ФормаЗаказы.ОткрытьМодально();
	Возврат КоммерческоеПредложение;
КонецФункции	


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ЭтоНовый() Тогда
		 Запрос = Новый Запрос("ВЫБРАТЬ
		                       |	МАКСИМУМ(АК_Договор_Спецификация.Номер) КАК Номер,
		                       |	АК_Договор_Спецификация.ДокументОснование
		                       |ИЗ
		                       |	Документ.АК_Договор_Спецификация КАК АК_Договор_Спецификация
		                       |ГДЕ
		                       |	АК_Договор_Спецификация.ДокументОснование = &ДокументОснование
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	АК_Договор_Спецификация.ДокументОснование");
		Запрос.УстановитьПараметр("ДокументОснование",ЭтотОбъект.ДокументОснование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СледНомер= Выборка.Номер+1;
		Иначе
			СледНомер=1;
		КонецЕсли;	
		ЭтотОбъект.Номер = СледНомер;
	КонецЕсли;	
КонецПроцедуры

