////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РассчитатьСостояние();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Стартован Тогда
		РассчитатьСостояние();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура РассчитатьСостояние()
	//
	//Если Объект.Стартован Тогда
	//	Если Объект.Завершен Тогда
	//		Если Объект.РезультатСогласования = Перечисления.РезультатыСогласования.Согласовано Тогда
	//			Состояние = НСтр("ru = 'Согласовано'");
	//		ИначеЕсли Объект.РезультатСогласования = Перечисления.РезультатыСогласования.НеСогласовано Тогда
	//			Состояние = НСтр("ru = 'Не согласовано'");
	//		КонецЕсли;
	//	Иначе
	//		Состояние = НСтр("ru = 'В процессе согласования'");
	//	КонецЕсли;
	//Иначе
		Состояние = "";
	//КонецЕсли;
	//
	//Если Объект.Стартован И Не Объект.Завершен И ЗначениеЗаполнено(Объект.ДатаСогласования) И Объект.ДатаСогласования < НачалоДня(ТекущаяДата()) Тогда
	//	СостояниеПросрочено = Истина;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Остановить(Команда)
	// Вставить содержимое обработчика.
	БизнесПроцессыИЗадачиКлиент.ОстановитьБизнесПроцессИзФормыОбъекта(ЭтаФорма);

КонецПроцедуры
