
//
Функция ПолучитьСписокПохожихОбъектов(Объект) Экспорт
	
	//
	МассивРезультат = Новый Массив;
	
	//
	ОбъектБизнесРегион = Объект.БизнесРегион;
	ОбъектНаименование = Объект.Наименование;
	
	//
	ОбъектНаименование = нрег(ОбъектНаименование);
	
	//
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, ",", " ");
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, ".", " ");
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, ";", " ");
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, ":", " ");
	
	//
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, "  ", " ");
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, "  ", " ");
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, "  ", " ");
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, "  ", " ");
	
	//
	ОбъектНаименование = СтрЗаменить(ОбъектНаименование, " ", Символы.ПС);
	
	//
	спНаименование = Новый СписокЗначений;
	
	//
	_Текст = Новый ТекстовыйДокумент;
	_Текст.УстановитьТекст(ОбъектНаименование);
	
	//
	ТекстУсловия = " И (";
	
	//
	Сч = 0;
	КоличествоСтрок = _Текст.КоличествоСтрок();
	
	//
	Для Сч = 1 По КоличествоСтрок Цикл
		
		//
		Строка = СокрЛП(_Текст.ПолучитьСтроку(Сч));
		
		//
		Если СтрДлина(Строка) > 2 Тогда
		Иначе
			Попытка
				Число = Число(Строка);
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;	
		
		//
		ТекстУсловия = ТекстУсловия + " ИЛИ АК_Объекты.Наименование ПОДОБНО ""%" + Строка + "%"" ";
		
	КонецЦикла;
	
	//
	ТекстУсловия =СтрЗаменить(ТекстУсловия, "( ИЛИ", " (");
	
	//
	ТекстУсловия = ТекстУсловия + ") ";
	
	//
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АК_Объекты.Ссылка
	               |ИЗ
	               |	Справочник.АК_Объекты КАК АК_Объекты
	               |ГДЕ
	               |	АК_Объекты.БизнесРегион = &БизнесРегион";
				   
	//
	ТекстЗапроса = ТекстЗапроса + ТекстУсловия;
				   
	//				   
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = ТекстЗапроса;
	ПостроительЗапроса.Параметры.Вставить("БизнесРегион", ОбъектБизнесРегион);
	ПостроительЗапроса.Параметры.Вставить("Ссылка", Объект.Ссылка);
	ПостроительЗапроса.Выполнить();
	
	//
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//
		Если Выборка.Ссылка = Объект.Ссылка Тогда
			Продолжить;
		КонецЕсли;	
		
		//
		МассивРезультат.Добавить(Выборка.Ссылка);
		
	КонецЦикла;	
	
	//
	Возврат МассивРезультат;
	
КонецФункции	
	