
&НаСервере
Функция ПолучитьДанныеДляПечатиЦенников(ПараметрКоманды)
	
	Возврат Документы[ПараметрКоманды[0].Метаданные().Имя].ПолучитьДанныеДляПечатиЦенников(ПараметрКоманды);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		АдресВХранилище = ПолучитьДанныеДляПечатиЦенников(ПараметрКоманды);
		
		СтруктураПараметры = Новый Структура("АдресВХранилище,НазначениеШаблона");
		СтруктураПараметры.АдресВХранилище   = АдресВХранилище;
		
		ОткрытьФорму(
			"Обработка.ПечатьЭтикетокИЦенников.Форма.ФормаТовары",
			СтруктураПараметры,            // Параметры
			,                              // Владелец
			Новый УникальныйИдентификатор  // Уникальность
		);
		
	КонецЕсли;
	
КонецПроцедуры
