#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ПараметрВидыЦен  = ОбщегоНазначенияУТКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек.Настройки,"ВидыЦен");
	
	Если ПараметрВидыЦен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрВидыЦен.Значение      = Новый Массив;
	ПараметрВидыЦен.Использование = Ложь;
	
	ПараметрВидыЦен  = ОбщегоНазначенияУТКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек.ФиксированныеНастройки, "ВидыЦен");
	ПараметрВидыЦен.Значение = Справочники.ВидыЦен.ДоступныеВидыЦен();
	ПараметрВидыЦен.Использование = Истина;
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецЕсли