#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// СтандартныеПодсистемы.ВариантыОтчетов

// Настройки вариантов этого отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	// Настройка размещения, видимости по умолчанию, важности
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыИРасходы");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыИРасходыПоЗаказамКлиентов");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыИРасходыПоСделкам");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РБП");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

// Настройки зависимостей вариантов этого отчета от функциональных опций
//
Функция ФункциональныеОпцииВариантовОтчетов() Экспорт
	ФункциональныеОпцииВариантовОтчетов = ВариантыОтчетовУТПереопределяемый.ИнициализироватьФункциональныеОпцииВариантовОтчетов();
	
	// Вариант "ДоходыИРасходыПоСделкам" зависит от 3-х ФО одновременно
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ДоходыИРасходыПоСделкам", "ИспользоватьСделкиСКлиентами");
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ДоходыИРасходыПоСделкам", "ИспользоватьУправлениеСделками");
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ДоходыИРасходыПоСделкам", "ИспользоватьЗаказыКлиентов");
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ДоходыИРасходыПоЗаказамКлиентов", "ИспользоватьЗаказыКлиентов");
		
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ДоходыФинансовыйРезультатНеФормируется", "НеФормироватьФинансовыйРезультат");
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"Доходы", "ФормироватьФинансовыйРезультат");
		
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"РасходыФинансовыйРезультатНеФормируется", "НеФормироватьФинансовыйРезультат");
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"Расходы", "ФормироватьФинансовыйРезультат");
		
	Возврат ФункциональныеОпцииВариантовОтчетов;
КонецФункции

 // Конец СтандартныеПодсистемы.ВариантыОтчетов
#КонецЕсли