////////////////////////////////////////////////////////////////////////////////
// Варианты отчетов - Форма отчета УТ (клиент, переопределяемый)
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Обработчик расшифровки табличного документа формы отчета.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Элемент  (ПолеФормы)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение поля формы для поля табличного документа" в справке.
//
Процедура ОбработкаРасшифровки(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик дополнительной расшифровки (меню табличного документа формы отчета).
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма)
//   Элемент  (ПолеФормы)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение поля формы для поля табличного документа" в справке.
//
Процедура ОбработкаДополнительнойРасшифровки(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик команд, добавленных динамически.
//
// Параметры:
//   ЭтаФорма  (УправляемаяФорма) Форма отчета.
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//   Результат (Булево)           Истина, если вызов команды обработан.
//
Процедура ОбработчикКоманды(ЭтаФорма, Команда, Результат) Экспорт
	// Вызов подключаемых команд отчетов
	Если ЭтаФорма.КлючОбъекта = "Отчет.АнализРасчетовСКлиентами"
		И Команда.Имя = "АктуализироватьРасчетыСКлиентами" Тогда
		АктуализироватьРасчетыСКлиентами(ЭтаФорма);
	ИначеЕсли ЭтаФорма.КлючОбъекта = "Отчет.АнализРасчетовСПоставщиками"
		И Команда.Имя = "АктуализироватьРасчетыСПоставщиками" Тогда
		АктуализироватьРасчетыСПоставщиками(ЭтаФорма);
	ИначеЕсли ЭтаФорма.КлючОбъекта = "Отчет.АнализПродажВРазрезеПоступлений"
		И Команда.Имя = "АктуализироватьДанныеПартионногоУчета" Тогда
		АктуализироватьДанныеПартионногоУчета(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

// Обработчик результата выбора подчиненной формы.
//
// Параметры:
//   ЭтаФорма          (УправляемаяФорма) Форма отчета.
//   ВыбранноеЗначение (*)                Результат выбора в подчиненной форме.
//   ИсточникВыбора    (УправляемаяФорма) Форма, где осуществлен выбор. 
//   Результат         (Булево)           Истина, если результат выбора обработан.
//
Процедура ОбработкаВыбора(ЭтаФорма,ВыбранноеЗначение, ИсточникВыбора, Результат) Экспорт
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Вызывается для отчета "АнализРасчетовСКлиентами"
//
Процедура АктуализироватьРасчетыСКлиентами(ЭтаФорма)
	КодОтвета = Вопрос(НСтр("ru = 'Актуализировать расчеты с клиентами?'"), РежимДиалогаВопрос.ДаНет);
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ФормаОтчетаУТВызовСервераПереопределяемый.АктуализироватьРасчетыСКлиентами();
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Расчеты актуализированы'"),
			, // НавигационнаяСсылка
			НСтр("ru = 'Расчеты с клиентами актуализированы'")
		);
		ЭтаФорма.СкомпоноватьРезультат();
	КонецЕсли;
КонецПроцедуры

// Вызывается для отчета "АнализРасчетовСПоставщиками"
//
Процедура АктуализироватьРасчетыСПоставщиками(ЭтаФорма)
	
	КодОтвета = Вопрос(НСтр("ru = 'Актуализировать расчеты с поставщиками?'"), РежимДиалогаВопрос.ДаНет);
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ФормаОтчетаУТВызовСервераПереопределяемый.АктуализироватьРасчетыСПоставщиками();
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Расчеты актуализированы'"),
			, // НавигационнаяСсылка
			НСтр("ru = 'Расчеты с поставщиками актуализированы'")
		);
		ЭтаФорма.СкомпоноватьРезультат();
	КонецЕсли;
	
КонецПроцедуры

// Вызывается для отчета "АнализПродажВРазрезеПоступлений"
//
Процедура АктуализироватьДанныеПартионногоУчета(ЭтаФорма)
	
	КодОтвета = Вопрос(НСтр("ru = 'Актуализировать данные партионного учета?'"), РежимДиалогаВопрос.ДаНет);
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ФормаОтчетаУТВызовСервераПереопределяемый.АктуализироватьДанныеПартионногоУчета();
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Данные партионного учета'"),
			, // НавигационнаяСсылка
			НСтр("ru = 'Данные партионного учета актуализированы'")
		);
		ЭтаФорма.СкомпоноватьРезультат();
	КонецЕсли;

КонецПроцедуры
