////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//установить отбор по физлицу.
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ФизЛицо1") Тогда

		СтандартнаяОбработка = Ложь;
		Физлицо       = Параметры.Отбор.ФизЛицо1;
		
		ГруппаОтбора	  = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФизЛицо1");
        ЭлементОтбора.ПравоеЗначение = ФизЛицо;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФизЛицо2");
        ЭлементОтбора.ПравоеЗначение = ФизЛицо;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		 ОткрытьФормуМодально("РегистрСведений.СвязиМеждуФизЛицами.ФормаЗаписи",
		Новый Структура("Физлицо", Физлицо));
	КонецЕсли;
	
КонецПроцедуры
