//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//		
//	ФиксНастройка = ФиксированнаяНастройкаПараметра("ВариантГрафика");
//	
//	Если ФиксНастройка.Использование = Истина Тогда
//		
//		ПользНастройка = ПользовательскаяНастройкаПараметра("ВариантГрафика");
//		ПользНастройка.Использование = Истина;
//		ПользНастройка.Значение = ФиксНастройка.Значение;
//		
//		ФиксНастройка.Использование = Ложь;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
//// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

/////////////////////////////////////////////////////////////////////////////////
//// Прочее

//Функция ФиксированнаяНастройкаПараметра(ИмяПараметра)

//	ПараметрДанных = КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
//	
//	Возврат ПараметрДанных;

//КонецФункции

//Функция ПользовательскаяНастройкаПараметра(ИмяПараметра)

//	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
//	Если ПараметрДанных <> Неопределено Тогда
//		ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
//		Если ПараметрПользовательскойНастройки <> Неопределено Тогда
//			Возврат ПараметрПользовательскойНастройки;
//		Иначе
//			Возврат ПараметрДанных;
//		КонецЕсли;
//	КонецЕсли;
//	Возврат Неопределено;

//КонецФункции

//#КонецЕсли