&НаКлиенте
Перем КэшированныеЗначения;//используется механизмом обработки изменения реквизитов ТЧ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Характеристика);

	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Номенклатура", Номенклатура);
	СтруктураСтроки.Вставить("Характеристика", Характеристика);
	СтруктураСтроки.Вставить("ХарактеристикиИспользуются", ХарактеристикиИспользуются);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтруктураСтроки, СтруктураДействий, КэшированныеЗначения);

	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураСтроки);
	
	ХарактеристикиИспользуются = СтруктураСтроки.ХарактеристикиИспользуются;
	Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)

	Если Номенклатура.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru= 'Не указана номенклатура.'"),
		                                                  ,
		                                                  "Номенклатура");
		Возврат;
	КонецЕсли;
	
	Если ХарактеристикиИспользуются И Характеристика.Пустая() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru= 'Не указана характеристика.'"),
		                                                  ,
		                                                  "Характеристика");
		Возврат;
	
	КонецЕсли;
	
	Закрыть(Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика));

КонецПроцедуры


