////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотПовтИсп, сервер, повт. использование
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Получает настройки базы Документооборота
//Возвращает структуру настроек Документооборота
Функция ПолучитьНастройки() Экспорт
	
	Возврат ИнтеграцияС1СДокументооборотВызовСервера.ПолучитьНастройки();
	
КонецФункции

//Создает прокси веб-сервиса Документооборота. В случае ошибки при создании вызывается исключение.
//Возвращает:
//	Прокси веб-сервиса WSПрокси
Функция ПолучитьПрокси() Экспорт
	
	Возврат ИнтеграцияС1СДокументооборотВызовСервера.ПолучитьПрокси();
	
КонецФункции

//Проверяет доступность функционала версии сервиса
//Парметры:
//	ВерсияСервиса - версия сервиса, содержащая нужный функционал
//Возвращает:
//	Признак доступности функционала версии сервиса
Функция ДоступенФункционалВерсииСервиса(ВерсияСервиса) Экспорт
	
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	Возврат ИнтеграцияС1СДокументооборот.ДоступенФункционалВерсииСервиса(Прокси, ВерсияСервиса);
	
КонецФункции

