
Процедура АК_ОбменУТ_УПП_ЗаказыЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("АК_ОбменУТ_УПП_Заказы", Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура АК_ОбменУТ_УПП_ЗаказыЗарегистрироватьИзменениеУдалениеПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("АК_ОбменУТ_УПП_Заказы", Источник, Отказ);
КонецПроцедуры

Процедура ВыполнитьУстановкуДатыНачалаВыгрузки() Экспорт
	ВыборкаУзлов = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.Выбрать();
Пока ВыборкаУзлов.Следующий() Цикл
	  ВыборкаУзлов1 =  ВыборкаУзлов.ПолучитьОбъект();
		ВыборкаУзлов1.ДатаНачалаВыгрузкиДокументов  = ТекущаяДата();
	    ВыборкаУзлов1.Записать();
КонецЦикла;
КонецПроцедуры