////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОценкаМенеджера    = Параметры.Ключ.ВероятностьУспешногоЗавершения;
	Вероятности        = СделкиСервер.РассчитатьВероятность(Параметры.Ключ);
	ОбщаяСЭтапа        = Вероятности.ОбщаяСЭтапа;
	ПоМенеджеру        = Вероятности.ПоМенеджеру;
	ПоПартнеру         = Вероятности.ПоПартнеру;
	ПоВидуСделки	   = Вероятности.ПоВидуСделки;
	Средняя            = Вероятности.Средняя;
	Расчетная          = Вероятности.Расчетная;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Установить(Команда)
	
	Закрыть(Расчетная);
	
КонецПроцедуры

