
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	УникальныйИдентификатор   = Новый УникальныйИдентификатор();

	ИдентификаторУстройстваЭТ = Неопределено;
	ИдентификаторУстройстваФР = Неопределено;
	ОписаниеОшибки            = "";

	СуммаОперации       = 0;
	НомерКарты          = "";
	НомерСсылкиОперации = "";
	НомерЧека           = "";
	СтрокаСлипЧека      = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Выбор устройства ЭТ
		ИдентификаторУстройстваЭТ = МенеджерОборудованияКлиент.ВыбратьУстройство("ЭквайринговыйТерминал",
		    НСтр("ru='Выберите эквайринговый терминал'"), НСтр("ru='Эквайринговый терминал не подключен'"));

		Если ИдентификаторУстройстваЭТ <> Неопределено Тогда
			// Выбор устройства ФР
			ИдентификаторУстройстваФР = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
			    НСтр("ru='Выберите фискальный регистратор'"), НСтр("ru='Фискальный регистратор не подключен'"));

			Если ИдентификаторУстройстваФР <> Неопределено Тогда
				// Подключение устройства ЭТ
				РезультатЭТ = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                                ИдентификаторУстройстваЭТ,
				                                                                                ОписаниеОшибки);

				Если РезультатЭТ Тогда
					// Подключение устройства ФР
					РезультатФР = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
					                                                                                ИдентификаторУстройстваФР,
					                                                                                ОписаниеОшибки);

					Если РезультатФР Тогда
						ВходныеПараметры  = Неопределено;
						ВыходныеПараметры = Неопределено;

						// Выполнение операции на ЭТ
						РезультатЭТ = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваЭТ,
						                                                          "Settlement",
						                                                          ВходныеПараметры,
						                                                          ВыходныеПараметры);

						Если Не РезультатЭТ Тогда
							ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
							|""%ОписаниеОшибки%"".
							|Операция сверки итогов не была проведена.'");
							ТекстСообщения = СтрЗаменить(ТекстСообщения,
														 "%ОписаниеОшибки%",
														 ВыходныеПараметры[1]);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Иначе
							Если Не ПустаяСтрока(ВыходныеПараметры[0][1]) Тогда
								глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ВыходныеПараметры[0][1]);
							КонецЕсли;

							НомерКарты          = "";
							НомерСсылкиОперации = "";
							НомерЧека           = "";
							СтрокаСлипЧека      = ВыходныеПараметры[0][1];

							Если Не ПустаяСтрока(СтрокаСлипЧека) Тогда
								ВходныеПараметры = Новый Массив();
								ВходныеПараметры.Добавить(СтрокаСлипЧека);
								ВыходныеПараметры = Неопределено;

								РезультатФР = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,
								                                                          "PrintText",
								                                                          ВходныеПараметры,
								                                                          ВыходныеПараметры);
								Если Не РезультатФР Тогда
									ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
										|""%ОписаниеОшибки%"".'");
									ТекстСообщения = СтрЗаменить(ТекстСообщения,
																 "%ОписаниеОшибки%",
																 ВыходныеПараметры[1]);
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
								КонецЕсли;
							Иначе
								ТекстСообщения = НСтр("ru = 'Операция сверки итогов успешно выполнена'");
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							КонецЕсли;
						КонецЕсли;

						// Отключение устройства ФР
						МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
						                                                                 ИдентификаторУстройстваФР);
						// Отключение устройства ЭТ
						МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
						                                                                 ИдентификаторУстройстваЭТ);
					Иначе
						ТекстСообщения = НСтр("ru = 'При подключении фискального регистратора произошла ошибка:
						|""%ОписаниеОшибки%"".
						|Операция сверки итогов не была проведена.'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
				Иначе
					ТекстСообщения = НСтр("ru = 'При подключении эквайрингового терминала произошла ошибка:
						|""%ОписаниеОшибки%"".
						|Операция сверки итогов не была проведена.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры
