
&НаКлиенте
// Процедура - обработчик события "ОбработкаКоманды".
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьОбщихФорм",
		    "СчетФактура",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			Новый Структура("ВидФормы, ПечатьВВалюте", "Комиссионер", Ложь)   // Вид печатной формы
		);
	КонецЕсли;

КонецПроцедуры // ОбработкаКоманды()
