&НаСервере
Функция СписокОрганизаций(МассивДокументов)
	
	Возврат Документы.РаспоряжениеНаИнвентаризациюТоваров.СписокОрганизацийИзАктов(МассивДокументов);	

КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрКоманды.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru='Не поддерживается групповая печать сличительной ведомости.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		СписокОрганизаций = СписокОрганизаций(ПараметрКоманды);
		
		НетАктов    = Ложь;
		Организация = Неопределено;
		
		Если СписокОрганизаций.Количество() = 0 Тогда
			НетАктов = Истина;
		ИначеЕсли СписокОрганизаций.Количество() = 1 Тогда
			Организация = СписокОрганизаций[0].Значение;
		Иначе
			ТекстЗаголовка = НСтр("Выберите организацию");
			ВыбранныйЭлемент = СписокОрганизаций.ВыбратьЭлемент(ТекстЗаголовка);
			
			Если ВыбранныйЭлемент = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Организация = ВыбранныйЭлемент.Значение;
			
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьИНВ19",
		"ИНВ19",
		ПараметрКоманды,
		ПараметрыВыполненияКоманды.Источник,
		Новый Структура("Организация, НетАктов", Организация, НетАктов)
		);
	КонецЕсли;
КонецПроцедуры