////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаказПоставщику") Тогда
		
		Если ТипЗнч(Параметры.ЗаказПоставщику) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ДокументыЗаказов.Добавить(Параметры.Партнер);
		ИначеЕсли ТипЗнч(Параметры.ЗаказПоставщику) = Тип("Массив") Тогда
			ДокументыЗаказов.ЗагрузитьЗначения(Параметры.ЗаказПоставщику);
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
	СформироватьОтчет();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТаблицаОтчета.Показать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	ТаблицаОтчета.Показать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура СформироватьОтчет()

	ТаблицаОтчета.Очистить();
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	
	Для Каждого ДокументЗаказа Из ДокументыЗаказов Цикл
		
		ОбъектОтчет.СформироватьОтчет(ТаблицаОтчета, ДокументЗаказа.Значение)
		
	КонецЦикла;
	
КонецПроцедуры