

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") 
		И Параметры.Отбор.Свойство("Партнер") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, 
			"Партнер", 
			Параметры.Отбор.Партнер, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Параметры.Отбор.Партнер)
		);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") 
		И Параметры.Отбор.Свойство("Контрагент") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, 
			"Контрагент", 
			Параметры.Отбор.Контрагент, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Параметры.Отбор.Контрагент)
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, 
			"Партнер", 
			Параметры.Отбор.Контрагент.Партнер, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Параметры.Отбор.Контрагент.Партнер)
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Для Каждого Настройка Из Настройки Цикл
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, 
			Настройка.Ключ, 
			Настройка.Значение, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Настройка.Значение)
		);
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура БыстрыйОтборПриИзменении(Элемент)
	
	ИмяКолонки = СтрЗаменить(Элемент.Имя,"Отбор","");
	ЗначениеОбора = ЭтаФорма[ИмяКолонки];
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, 
			ИмяКолонки, 
			ЗначениеОбора, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(ЗначениеОбора)
		);
	
КонецПроцедуры
