//Устанавливает в дереве текущую строку
//Параметры:ДеревоЭлемент - элемент формы, отображающий дерево задач
//			ДеревоРеквизит - реквизит формы типа ДеревоЗначений, содержащий дерево задач
//			ТекущаяЗадача - задача, которую необходимо выделить в дереве 

Процедура УстановитьТекущуюЗадачуВДеревеПоСсылке(ДеревоЭлемент, ДеревоРеквизит, ТекущаяЗадача) Экспорт
	
	Если ТекущаяЗадача <> Неопределено И
		НЕ ТекущаяЗадача.Пустая() Тогда
		Индекс = -1;
		АК_РаботаСПроектамиКлиентСервер.НайтиЗадачуВДеревеПоСсылке(ДеревоРеквизит.ПолучитьЭлементы(), ТекущаяЗадача, Индекс);
		Если Индекс > -1 Тогда
			ДеревоЭлемент.ТекущаяСтрока = Индекс;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
