////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НачальныйПризнакВыполнения = Объект.Выполнена;
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ЗаданиеОбъект = ЗадачаОбъект.БизнесПроцесс.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ЗаданиеОбъект, "Задание");

	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.СрокИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	Элементы.СрокНачалаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	Элементы.ДатаИсполнения.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");

	БизнесПроцессыИЗадачиСервер.ФормаЗадачиПриСозданииНаСервере(
		ЭтаФорма, Объект, Элементы.ГруппаСостояние, Элементы.ДатаИсполнения
	);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ссылка
	               |ИЗ
	               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |ГДЕ
	               |	ЗаказПоставщику.ДокументОснование = &АК_ЗаказКлиента";
	
	Запрос.УстановитьПараметр("АК_ЗаказКлиента", Задание.ЗаказКлиента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДокументОбъект = Задание.Ссылка.ПолучитьОбъект();
	ДокументОбъект.ЗаказыПоставщика.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументОбъект.ЗаказыПоставщика.Добавить();
		НоваяСтрока.Документ = Выборка.Ссылка;
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.Документ = Выборка.Ссылка;
	КонецЦикла;
	ДокументОбъект.Записать();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтаФорма);
КонецПроцедуры

// ЭТАП ПОВТОРНОЙ ОБРАБОТКИ ЗАКАЗА

&НаКлиенте
Процедура ПовтонаяОбработка(Команда)
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтаФорма,ИСТИНА,Новый Структура("ЗаказКлиента",Задание.ЗаказКлиента));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	Форма = ПолучитьФорму("Документ.ЗаказПоставщику.Форма.АК_ФормаДокумента");
	ДанныеФормы = Форма.Объект;
	СоздатьДокумент(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
КонецПроцедуры


Процедура СоздатьДокумент(ДанныеФормы)
	ТО = ДанныеФормыВЗначение(ДанныеФормы,Тип("ДокументОбъект.ЗаказПоставщику"));
	ТО.ЗаполнитьПоНеОбособленномуЗаказуКлиента(Задание.ЗаказКлиента);
	ЗначениеВДанныеФормы(ТО,ДанныеФормы);
КонецПроцедуры


