
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Отчет.СостояниеРасчетовСКлиентами.Форма",
		Новый Структура("КлючНазначенияИспользования, Отбор, КлючВарианта, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
			ПараметрКоманды, 
			Новый Структура("ЗаказКлиента", ПараметрКоманды), 
			"СостояниеРасчетовПоОбъектуРасчетовКонтекст", 
			Истина,
			Ложь),
		,
		"ЗаказКлиента=" + ПараметрКоманды,
		ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры
