////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
 СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Параметры.заказКлиента);
  СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Предмет", Параметры.ЗаказПоставщика);


 
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаказовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Закрыть(ТекущийЭлемент.ТекущаяСтрока);
КонецПроцедуры

 