
&НаКлиенте
Процедура ОК(Команда)
	СтруктураОграничений = Новый Структура;
	СтруктураОграничений.Вставить("СтраховоеКоличествоЗапаса", СтраховоеКоличествоЗапаса);
	СтруктураОграничений.Вставить("НормативноеКоличествоЗапаса", НормативноеКоличествоЗапаса);
	СтруктураОграничений.Вставить("МинимальноеКоличествоЗапаса", МинимальноеКоличествоЗапаса);
	СтруктураОграничений.Вставить("МаксимальноеКоличествоЗапаса", МаксимальноеКоличествоЗапаса);
	СтруктураОграничений.Вставить("СреднедневноеПотребление", СреднедневноеПотребление);
	Закрыть(СтруктураОграничений);
КонецПроцедуры
