#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// СтандартныеПодсистемы.ВариантыОтчетов

Функция ФункциональныеОпцииВариантовОтчетов() Экспорт
	
	ФункциональныеОпцииВариантовОтчетов = ВариантыОтчетовУТПереопределяемый.ИнициализироватьФункциональныеОпцииВариантовОтчетов();
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов,
		"ПлатежныйКалендарьПоСчетамИКассам", "ИспользоватьНесколькоРасчетныхСчетовКасс");
	
	Возврат ФункциональныеОпцииВариантовОтчетов;
	
КонецФункции

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецЕсли