////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьДиапазонДопустимыхЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ОтветНаВопрос = Вопрос(НСтр("ru = 'Данные изменены. Сохранить?'"),РежимДиалогаВопрос.ДаНетОтмена);
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ЗаписатьДиапазонДопустимыхЦен();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	ЗаписатьДиапазонДопустимыхЦен();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВыполнить()
	
	ЗаписатьДиапазонДопустимыхЦен();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура ЗаписатьДиапазонДопустимыхЦен()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Константы.ВидМаксимальноДопустимыхЦенЗакупки КАК ВидМаксимальноДопустимыхЦенЗакупки,
		|	Константы.ВидМаксимальноДопустимыхЦенПродажи КАК ВидМаксимальноДопустимыхЦенПродажи,
		|	Константы.ВидМинимальноДопустимыхЦенПродажи  КАК ВидМинимальноДопустимыхЦенПродажи
		|ИЗ
		|	Константы КАК Константы
		|");
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ВидМинимальноДопустимыхЦенПродажи <> Выборка.ВидМинимальноДопустимыхЦенПродажи Тогда
			Константы.ВидМинимальноДопустимыхЦенПродажи.Установить(ВидМинимальноДопустимыхЦенПродажи);
		КонецЕсли;
			
		Если ВидМаксимальноДопустимыхЦенПродажи <> Выборка.ВидМаксимальноДопустимыхЦенПродажи Тогда
			Константы.ВидМаксимальноДопустимыхЦенПродажи.Установить(ВидМаксимальноДопустимыхЦенПродажи);
		КонецЕсли;
		
		Если ВидМаксимальноДопустимыхЦенЗакупки <> Выборка.ВидМаксимальноДопустимыхЦенЗакупки Тогда
			Константы.ВидМаксимальноДопустимыхЦенЗакупки.Установить(ВидМаксимальноДопустимыхЦенЗакупки);
		КонецЕсли;
			
	КонецЕсли;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДиапазонДопустимыхЦен()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Константы.ВидМаксимальноДопустимыхЦенЗакупки КАК ВидМаксимальноДопустимыхЦенЗакупки,
		|	Константы.ВидМаксимальноДопустимыхЦенПродажи КАК ВидМаксимальноДопустимыхЦенПродажи,
		|	Константы.ВидМинимальноДопустимыхЦенПродажи  КАК ВидМинимальноДопустимыхЦенПродажи
		|ИЗ
		|	Константы КАК Константы
		|");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидМинимальноДопустимыхЦенПродажи  = Выборка.ВидМинимальноДопустимыхЦенПродажи;
		ВидМаксимальноДопустимыхЦенПродажи = Выборка.ВидМаксимальноДопустимыхЦенПродажи;
		ВидМаксимальноДопустимыхЦенЗакупки = Выборка.ВидМаксимальноДопустимыхЦенЗакупки;
	КонецЕсли;
	
КонецПроцедуры

