////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЗакрыватьФормуПослеСканированияСерии Тогда
		ЗакрыватьФормуПослеСканированияСерии = 1;
	Иначе
		ЗакрыватьФормуПослеСканированияСерии = 0;
	КонецЕсли;
	Если Параметры.Свойство("ПечатьНаПринтер") Тогда
		ПечатьНаПринтер = Параметры.ПечатьНаПринтер;
	Иначе
		Элементы.ПечатьНаПринтер.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	Если ЗакрыватьФормуПослеСканированияСерии = 1 Тогда
		ЗакрыватьФормуПослеСканированияСерииБулево = Истина;
	Иначе
		ЗакрыватьФормуПослеСканированияСерииБулево = Ложь;
	КонецЕсли;
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЗакрыватьФормуПослеСканированияСерии",ЗакрыватьФормуПослеСканированияСерииБулево);
	СтруктураВозврата.Вставить("ПечатьНаПринтер",ПечатьНаПринтер);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
