////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ФормыОткрываемыеПриНачалеРаботыСистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОткрываемыхФорм = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФормыОткрываемыеПриНачалеРаботыСистемы.Ссылка КАК ОткрываемаяФорма,
	|	ВЫБОР
	|		КОГДА НастройкиОткрытияФормПриНачалеРаботыСистемы.Пользователь ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НастройкиУстановлены,
	|	НастройкиОткрытияФормПриНачалеРаботыСистемы.Параметры,
	|	ВЫБОР
	|		КОГДА НастройкиОткрытияФормПриНачалеРаботыСистемы.ОткрыватьПоУмолчанию ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НастройкиОткрытияФормПриНачалеРаботыСистемы.ОткрыватьПоУмолчанию
	|	КОНЕЦ КАК ОткрыватьПоУмолчанию
	|ИЗ
	|	Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы КАК ФормыОткрываемыеПриНачалеРаботыСистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОткрытияФормПриНачалеРаботыСистемы КАК НастройкиОткрытияФормПриНачалеРаботыСистемы
	|		ПО ФормыОткрываемыеПриНачалеРаботыСистемы.Ссылка = НастройкиОткрытияФормПриНачалеРаботыСистемы.ОткрываемаяФорма
	|			И (НастройкиОткрытияФормПриНачалеРаботыСистемы.Пользователь = &Пользователь)";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметровФормы = ОткрытиеФормПриНачалеРаботыСистемыКлиентСерверПереопределяемый.НастройкиФормы(Выборка.ОткрываемаяФорма);
		
		СтруктураПараметровФормы.Вставить("НастройкиУстановлены", Выборка.НастройкиУстановлены);
		СтруктураПараметровФормы.Вставить("Параметры",            Новый Структура);
		СтруктураПараметровФормы.Вставить("ОткрыватьПоУмолчанию", Выборка.ОткрыватьПоУмолчанию);
		
		Если Выборка.НастройкиУстановлены Тогда
			
			Параметры = Выборка.Параметры.Получить();
			Если ТипЗнч(Параметры) = Тип("Структура") Тогда
				СтруктураПараметровФормы.Вставить("Параметры", Параметры);
			КонецЕсли;
			
		КонецЕсли;
		
		МассивОткрываемыхФорм.Добавить(СтруктураПараметровФормы);
		
	КонецЦикла;
	
	Возврат МассивОткрываемыхФорм;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
