
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеПрисоединенногоФайла = ПолучитьДанныеПрисоединенногоФайлаПакетаНаСервере(ПараметрКоманды);
	Если ДанныеПрисоединенногоФайла.СпособОбменаЭД = ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезОператораЭДОТакском")
		И НЕ Найти(ДанныеПрисоединенногоФайла.ОтправительЭД, "2AL") > 0 Тогда
		
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = ПрисоединенныеФайлыСлужебныйВызовСервера.ПолучитьДанныеФайла(ДанныеПрисоединенногоФайла.ПрисоединенныйФайл,
		ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
	
	ПолучитьФайл(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ДанныеФайла.ИмяФайла, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПрисоединенногоФайлаПакетаНаСервере(ПакетЭД)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭДПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|ГДЕ
	|	ЭДПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ПакетЭД);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	СтруктураДанныхПакета = Новый Структура;
	СтруктураДанныхПакета.Вставить("ПрисоединенныйФайл", РезультатЗапроса.Ссылка);
	ПараметрыПакетаЭД = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ПакетЭД, "СпособОбменаЭД, Отправитель");
	СтруктураДанныхПакета.Вставить("ОтправительЭД",      ПараметрыПакетаЭД.Отправитель);
	СтруктураДанныхПакета.Вставить("СпособОбменаЭД",     ПараметрыПакетаЭД.СпособОбменаЭД);
	
	Возврат СтруктураДанныхПакета;
	
КонецФункции
