
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии",
			Новый Структура("Номенклатура", ПараметрКоманды),
			"ДвиженияСерийНоменклатурыКонтекст",
			"ДвиженияСерийНоменклатурыКонтекст",
			Истина);

	ОткрытьФорму("Отчет.ДвиженияСерийТоваров.Форма",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
