
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСпецификации();
КонецПроцедуры
	
 &НаСервере
Функция ЗаполнитьСпецификации()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьСпецификацииСервер();
	ЗначениеВРЕквизитФормы(ОбъектЗначение,"Объект");
КонецФункции	


&НаСервере
Процедура СоглашениеПриИзменении(Элемент)
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
    Если ЗначениеЗаполнено(ОбъектЗначение.Соглашение.Контрагент) Тогда
		 ОбъектЗначение.Контрагент = ОбъектЗначение.Соглашение.Контрагент;
	КонецЕсли;	
	ЗначениеВРЕквизитФормы(ОбъектЗначение,"Объект"); 
КонецПроцедуры

