
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Управление элементами формы

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ЭтоКомиссионныйТовар = (Запись.ТипЗапасов = Перечисления.ТипыЗапасов.КомиссионныйТовар);
	
	Элементы.Соглашение.Видимость = ЭтоКомиссионныйТовар;
	Элементы.Валюта.Видимость = ЭтоКомиссионныйТовар;
	
КонецПроцедуры
