&НаСервере
Функция ОрганизацияПоУмолчанию()
	
	Возврат ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию();
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru='Не поддерживается групповая печать инвентаризационной описи.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		Организация = ОрганизацияПоУмолчанию();
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = ОткрытьФормуМодально("Справочник.Организации.ФормаВыбора");
			
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьИНВ3",
		"ИНВ3",
		ПараметрКоманды,
		ПараметрыВыполненияКоманды.Источник,
		Новый Структура("Организация", Организация)
		);
	КонецЕсли;
КонецПроцедуры
