///////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы формирования управленческой отчетности
///////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Прочее.

// Возвращает названия перечисления Периодичность в разных склонениях
//
// Параметры
//	ЧислоПериодов - Число - количество периодов, определяет склонение
//	Периодичность - ссылка на значение перечисления "Периодичность"
//
// Возвращаемое значение:
//  ПериодПрописью - Строка - название периода в правильном склонении
//
Функция ПериодПрописью(ЧислоПериодов, Периодичность) Экспорт
	ПериодПрописью = "";
	ФорматнаяСтрока = "L = ru_RU";
	ПараметрыПредметаИсчиления = "";
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		ПараметрыПредметаИсчиления = "день, дня, дней, м";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='день'")) Тогда
			ПериодПрописью = НСтр("ru='день'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='дня'")) Тогда
			ПериодПрописью = НСтр("ru='дня'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='дней'")) Тогда
			ПериодПрописью = НСтр("ru='дней'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		ПараметрыПредметаИсчиления = "неделя, недели, недель, ж";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='неделя'")) Тогда
			ПериодПрописью = НСтр("ru='неделя'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='недели'")) Тогда
			ПериодПрописью = НСтр("ru='недели'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='недель'")) Тогда
			ПериодПрописью = НСтр("ru='недель'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
		ПараметрыПредметаИсчиления = "декада, декады, декад, ж";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='декада'")) Тогда
			ПериодПрописью = НСтр("ru='декада'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='декады'")) Тогда
			ПериодПрописью = НСтр("ru='декады'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='декад'")) Тогда
			ПериодПрописью = НСтр("ru='декад'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ПараметрыПредметаИсчиления = "месяц, месяца, месяцев, м";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='месяцев'")) Тогда
			ПериодПрописью = НСтр("ru='месяцев'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='месяца'")) Тогда
			ПериодПрописью = НСтр("ru='месяца'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='месяц'")) Тогда
			ПериодПрописью = НСтр("ru='месяц'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ПараметрыПредметаИсчиления = "квартал, квартала, кварталов, м";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='кварталов'")) Тогда
			ПериодПрописью = НСтр("ru='кварталов'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='квартала'")) Тогда
			ПериодПрописью = НСтр("ru='квартала'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='квартал'")) Тогда
			ПериодПрописью = НСтр("ru='квартал'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		ПараметрыПредметаИсчиления = "полугодие, полугодия, полугодий, с";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='полугодие'")) Тогда
			ПериодПрописью = НСтр("ru='полугодие'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='полугодия'")) Тогда
			ПериодПрописью = НСтр("ru='полугодия'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='полугодий'")) Тогда
			ПериодПрописью = НСтр("ru='полугодий'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ПараметрыПредметаИсчиления = "год, года, лет, м";
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("ru='год'")) Тогда
			ПериодПрописью = НСтр("ru='год'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='года'")) Тогда
			ПериодПрописью = НСтр("ru='года'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("ru='лет'")) Тогда
			ПериодПрописью = НСтр("ru='лет'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодПрописью;
КонецФункции

// Возвращает слово в разных склонениях (в соответсвии с числом)
// Основное назначение - использование для склонения надписей единиц измерения в формах
// для различных числовых полей
//
// Параметры
//	Число - Число - число, определяет склонение
//	ЕдЧислоИменительный - Строка - единственное число именительный падеж
//	ЕдЧислоРодительный - Строка - единственное число родительный падеж
//	МнЧислоРодительный - Строка - множественное число родительный падеж
//	Пол - Строка - м – мужской род (ж – женский род, с - средний род); 
//
// Возвращаемое значение:
//  СловоПрописью - Строка - слово в правильном склонении
//
Функция ПолучитьСклонениеСлова(ЧислоДляСклонения, ЕдЧислоИменительный, ЕдЧислоРодительный, МнЧислоРодительный, Пол) Экспорт
	
	СловоПрописью = "";
	ФорматнаяСтрока = "L = ru_RU";
	ПараметрыПредметаИсчиления = ЕдЧислоИменительный + ", " + ЕдЧислоРодительный + ", " + МнЧислоРодительный + ", " + Пол;
	
	СловоПрописью = ЧислоПрописью(ЧислоДляСклонения, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
	
	Если Найти(СловоПрописью, МнЧислоРодительный) Тогда
		СловоПрописью = МнЧислоРодительный;
	ИначеЕсли Найти(СловоПрописью, ЕдЧислоРодительный) Тогда
		СловоПрописью = ЕдЧислоРодительный;
	ИначеЕсли Найти(СловоПрописью, ЕдЧислоИменительный) Тогда
		СловоПрописью = ЕдЧислоИменительный;
	КонецЕсли;
	
	Возврат СловоПрописью;
	
КонецФункции

