
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Отбор, ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
	
	ПараметрыФормы.Отбор = Новый Структура("ОтчетКомитенту", ПараметрКоманды);
	ПараметрыФормы.КлючНазначенияИспользования = "ОтчетКомитенту";
	ПараметрыФормы.КлючВарианта = "ТоварыПринятыеНаКомиссию";
		
	ОткрытьФорму("Отчет.ТоварыПринятыеНаКомиссию.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры
