#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает реквизиты объекта, которые необходимо блокировать от изменения
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Массив - блокируемые реквизиты объекта
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ДатаНачалаДействия");
	Результат.Добавить("ДатаОкончанияДействия; УстановитьИнтервал");
	Результат.Добавить("Персонализирована; ТипПерсонализации");
	Результат.Добавить("АвтоматическаяРегистрацияПриПервомСчитывании; ПорядокАктивации");
	Результат.Добавить("ТипКарты");
	Результат.Добавить("СкидкиНаценки; СкидкиНаценкиПодобратьСкидкиНаценки, СкидкиНаценкиУдалить, СкидкиНаценкиКонтекстноеМенюУдалить, СкидкиНаценкиКонтекстноеМенюПодобратьСкидкиНаценки");
	Результат.Добавить("ШаблоныКодовКартЛояльности");
	
	Возврат Результат;

КонецФункции

#КонецЕсли