////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаЦеноваяГруппа.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
	Элементы.РазрешитьРедактированиеТоварнаяКатегория.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент");
	
	РазрешитьРедактированиеВестиУчетПоГТД	 = Истина;
	РазрешитьРедактированиеПодакцизныйТовар  = Истина;
	РазрешитьРедактированиеВидНоменклатуры   = Истина;
	РазрешитьРедактированиеСтавкаНДС         = Истина;
	РазрешитьРедактированиеЦеноваяГруппа     = Истина;
	РазрешитьРедактированиеНаборУпаковок     = Истина;
	РазрешитьРедактированиеЕдиницаИзмерения	 = Истина;
	РазрешитьРедактированиеКачество	         = Истина;
	РазрешитьРедактированиеТоварнаяКатегория = ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеВидНоменклатуры Тогда
		Результат.Добавить("ВидНоменклатуры");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВестиУчетПоГТД Тогда
		Результат.Добавить("ВестиУчетПоГТД");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПодакцизныйТовар Тогда
		Результат.Добавить("ПодакцизныйТовар");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСтавкаНДС Тогда
		Результат.Добавить("СтавкаНДС");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЦеноваяГруппа Тогда
		Результат.Добавить("ЦеноваяГруппа");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНаборУпаковок Тогда
		Результат.Добавить("ИспользоватьУпаковки");
		Результат.Добавить("НаборУпаковок");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЕдиницаИзмерения Тогда
		Результат.Добавить("ЕдиницаИзмерения");
	КонецЕсли;
	
	Если РазрешитьРедактированиеКачество Тогда
		Результат.Добавить("Качество");
	КонецЕсли;
	
	Если РазрешитьРедактированиеТоварнаяКатегория Тогда
		Результат.Добавить("ТоварнаяКатегория");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры