////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементами();
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// Общие справочники

&НаКлиенте
Процедура ОткрытьСправочникСостоянияПроцессов(Команда)
	
	ОткрытьФорму("Справочник.СостоянияПроцессов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыСделок(Команда)
	
	ОткрытьФорму("Справочник.ВидыСделокСКлиентами.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПричиныПроигрышаСделок(Команда)
	
	ОткрытьФорму("Справочник.ПричиныПроигрышаСделок.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПричиныНеудовлетворенияПервичногоСпроса(Команда)
	
	ОткрытьФорму("Справочник.ПричиныНеудовлетворенияПервичногоСпроса.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРолиПартнеровВСделкахИПроектах(Команда)
	
	ОткрытьФорму("Справочник.РолиПартнеровВСделкахИПроектах.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРолиКонтактныхЛицВСделкахИПроектах(Команда)
	
	ОткрытьФорму("Справочник.РолиКонтактныхЛицВСделкахИПроектах.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПричиныВозникновенияПретензий(Команда)
	
	ОткрытьФорму("Справочник.ПричиныВозникновенияПретензий.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПричиныОтменыЗаказовКлиентов(Команда)
	
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказовКлиентов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УправлениеЭлементами()

	//Функциональные опции
	ИспользоватьПервичныйСпрос             = ПолучитьФункциональнуюОпцию("ИспользоватьПервичныйСпрос");
	ИспользоватьСделки                     = ПолучитьФункциональнуюОпцию("ИспользоватьСделкиСКлиентами");
	ИспользоватьУправлениеСделками         = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеСделками");
	ИспользоватьРолиКонтактныхЛицПартнеров = ПолучитьФункциональнуюОпцию("ИспользоватьРолиКонтактныхЛицПартнеров");
	ФиксироватьПретензииКлиентов           = ПолучитьФункциональнуюОпцию("ФиксироватьПретензииКлиентов");
	ИспользоватьЗаказыКлиентов               = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьПричиныОтменыЗаказовКлиентов = ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов");
	
	//Право чтения
	ПравоДоступаСостоянияПроцессов                       = ПравоДоступа("Просмотр", Метаданные.Справочники.СостоянияПроцессов);
	ПравоДоступаВидыСделокСКлиентами                     = ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыСделокСКлиентами);
	ПравоДоступаПричиныПроигрышаСделок                   = ПравоДоступа("Просмотр", Метаданные.Справочники.ПричиныПроигрышаСделок);
	ПравоДоступаИспользоватьПричиныОтменыЗаказовКлиентов = ПравоДоступа("Просмотр", Метаданные.Справочники.ПричиныОтменыЗаказовКлиентов);
	
	ПравоДоступаПричиныВозникновенияПретензий = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.ПричиныВозникновенияПретензий
	);
	ПравоДоступаИспользоватьЗаказыКлиентов = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.ПричиныОтменыЗаказовКлиентов
	);
	ПравоДоступаПричиныНеудовлетворенияПервичногоСпроса = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.ПричиныНеудовлетворенияПервичногоСпроса
	);
	ПравоДоступаРолиПартнеровВСделкахИПроектах = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.РолиПартнеровВСделкахИПроектах
	);
	ПравоДоступаРолиКонтактныхЛицВСделкахИПроектах = ПравоДоступа(
		"Просмотр",
		Метаданные.Справочники.РолиКонтактныхЛицВСделкахИПроектах
	);
	
	//Cделки
	Элементы.ГруппаНастроекВидыСделок.Видимость = ИспользоватьУправлениеСделками
		И ПравоДоступаВидыСделокСКлиентами;
	Элементы.ГруппаНастроекСостоянияПроцессов.Видимость = ИспользоватьУправлениеСделками
		И ПравоДоступаСостоянияПроцессов;
	Элементы.ГруппаНастроекПричиныПроигрышаСделок.Видимость = ИспользоватьСделки
		И ПравоДоступаПричиныПроигрышаСделок;
	Элементы.ГруппаНастроекПричиныНеудовлетворенияПервичногоСпроса.Видимость = ИспользоватьПервичныйСпрос
		И ПравоДоступаПричиныНеудовлетворенияПервичногоСпроса;
	Элементы.ГруппаНастроекРолиПартнеровВСделкахИПроектах.Видимость = ПравоДоступаРолиПартнеровВСделкахИПроектах;
	Элементы.ГруппаНастроекРолиКонтактныхЛицВСделкахИПроектах.Видимость = ИспользоватьРолиКонтактныхЛицПартнеров
		И ПравоДоступаРолиКонтактныхЛицВСделкахИПроектах;
	
	Если Не Элементы.ГруппаНастроекВидыСделок.Видимость И 
		 Не Элементы.ГруппаНастроекСостоянияПроцессов.Видимость И
		 Не Элементы.ГруппаНастроекПричиныПроигрышаСделок.Видимость И
		 Не Элементы.ГруппаНастроекПричиныНеудовлетворенияПервичногоСпроса.Видимость И
		 Не Элементы.ГруппаНастроекРолиПартнеровВСделкахИПроектах.Видимость И
		 Не Элементы.ГруппаНастроекРолиКонтактныхЛицВСделкахИПроектах.Видимость Тогда
		
		Элементы.ГруппаНастроекСделки.Видимость = Ложь;
		
	ИначеЕсли НЕ ИспользоватьСделки Тогда
		
		Элементы.ГруппаНастроекСделки.Заголовок = НСтр("ru = 'Проекты'");
		
	КонецЕсли;
	
	//Претензии
	Элементы.ГруппаПретензии.Видимость = ФиксироватьПретензииКлиентов И ПравоДоступаПричиныВозникновенияПретензий;
	
	//Заказы
	Элементы.ГруппаЗаказы.Видимость = ИспользоватьЗаказыКлиентов И ПравоДоступаИспользоватьЗаказыКлиентов;
	
	Элементы.ГруппаНастроекПричиныОтменыЗаказов.Видимость = ИспользоватьПричиныОтменыЗаказовКлиентов И  ПравоДоступаИспользоватьПричиныОтменыЗаказовКлиентов
	
КонецПроцедуры

