////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазрешитьРедактированиеВладелец = Истина;
	РазрешитьРедактированиеИспользоватьАдресноеХранение = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеИспользоватьАдресноеХранение Тогда
		Результат.Добавить("НастройкаАдресногоХранения");
	КонецЕсли;

	Если РазрешитьРедактированиеВладелец Тогда
		Результат.Добавить("Владелец");
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры

