
Процедура АукционВыигранПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура СоставитьКоммерческоеПредложениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
	СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СоздатьКоммерческоеПредложение);

КонецПроцедуры

Процедура ОтправитьПочтуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ОтправитьПочту);
КонецПроцедуры

Процедура ПозвонитьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.Позвонить);
КонецПроцедуры

Процедура СогласоватьКоммерческоеПредложениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СогласоватьКоммерческоеПредложение);
КонецПроцедуры

Процедура СформироватьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СформироватьЗаказ);
КонецПроцедуры

Процедура ПодготовитьКонкурснуюДокументациюПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ПодготовитьКонкурснуюДокументацию);
КонецПроцедуры

Процедура ЗаявкаНаБронированиеДСПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ЗаявкаНаБронированиеДС);
КонецПроцедуры

Процедура СоздатьОповещениеОДатеАукционаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СоздатьОповещениеОДатеАукциона);
КонецПроцедуры

Процедура ВнесениеРезультатаАукционаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ВнесениеРезультатаАукциона);
КонецПроцедуры

Процедура ПозвонитьПослеАукционаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ПозвонитьПослеАукциона);
КонецПроцедуры

Процедура ОбеспечитьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акГосКонтракт,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ОбеспечитьЗаказ);
КонецПроцедуры
