
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СтавкиНДС = ПолучитьСтавкиНДС(ПараметрКоманды);
	Для каждого ТекСтавка из СтавкиНДС  цикл
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента", 
       Новый Структура("Основание", Новый Структура("ДокументОснование, ДатаОтгрузки,ПоСтавкамНДС,СтавкаНДС", ПараметрКоманды,,Истина,ТекСтавка.Значение)),,Новый УникальныйИдентификатор);
		
	КонецЦикла;
КонецПроцедуры



Функция ПолучитьСтавкиНДС(ПараметрКоманды)
	Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ЗаказКлиентаТовары.СтавкаНДС
	  |ИЗ
	  |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	  |ГДЕ
	  |	ЗаказКлиентаТовары.Ссылка = &Ссылка
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ЗаказКлиентаТовары.СтавкаНДС";
	  
	  Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	  
	  СписокСтавок = Новый СписокЗначений;
	  СписокСтавок.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтавкаНДС"));
	  
	  Возврат СписокСтавок;
	  
КонецФункции