&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыВыбора = ОткрытьФормуМодально("Документ.УстановкаЦенНоменклатуры.Форма.ФормаВыбораРозничногоМагазинаИОрганизацииДляПереоценки");
	Если ПараметрыВыбора <> Неопределено Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
				"Документ.УстановкаЦенНоменклатуры",
				"ПереоценкаТоваровВРознице",
				ПараметрКоманды,
				ПараметрыВыполненияКоманды.Источник,
				Новый Структура("РозничныйМагазин, Организация", ПараметрыВыбора.РозничныйМагазин, ПараметрыВыбора.Организация)
			);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()
