////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьПомощникБыстройНастройкиПараметровУчета(Команда)
	
	ОткрытьФорму("Обработка.ПомощникБыстройНастройкиПараметровУчета.Форма");
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникПереходаСТорговляИСклад77(Команда)
	
	ОткрытьФорму("Обработка.ПомощникПереходаСТорговляИСклад77.Форма");
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗагрузкаДанныхИзУТ103(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзУТ103.Форма");
	
	Закрыть();
	
КонецПроцедуры
