
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелОбмена = ПараметрКоманды;
	
	Состояние(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 начат обмен данными с сайтом'"),
			Формат(ТекущаяДата(), "ДЛФ=DT"))
		,,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'по узлу обмена ""%1""...'"),
			УзелОбмена));
	
	Если ОбменВыполненСервер(УзелОбмена) Тогда

		ПоказатьОповещениеПользователя(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 ""%2""'"),
				Формат(ТекущаяДата(), "ДЛФ=DT"),
				УзелОбмена) 
			,,
			НСтр("ru = 'Обмен с сайтом завершен'"),
			БиблиотекаКартинок.Информация32);
		
		Оповестить("ЗавершенСеансОбменаССайтом");
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбменВыполненСервер(УзелОбмена)

	Если ОбменССайтомПовтИсп.ЭтоЭтотУзелПланаОбмена(УзелОбмена) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОбменССайтом.ВыполнитьОбмен(УзелОбмена, НСтр("ru = 'Интерактивный обмен'"));
	
	Возврат Истина;
	
КонецФункции



