
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	УправлениеЭлементамиФормы();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПравилоРаспределенияПриИзменении(Элемент)

	УправлениеЭлементамиФормы();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Управление элементами формы

&НаСервере
Процедура УправлениеЭлементамиФормы()

	Если Объект.ПравилоРаспределения = Перечисления.ПравилаРаспределенияПоНаправлениямДеятельности.ПропорциональноКоэффициентам Тогда
		Элементы.НаправленияДеятельности.АвтоОтметкаНезаполненного = Истина;
		Элементы.Коэффициент.Видимость = Истина;
		Элементы.Коэффициент.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.НаправленияДеятельности.ОтметкаНезаполненного = Ложь;
		Элементы.НаправленияДеятельности.АвтоОтметкаНезаполненного = Ложь;
		Элементы.Коэффициент.Видимость = Ложь;
		Элементы.Коэффициент.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;

КонецПроцедуры
