
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ЭлементОтбора.ПравоеЗначение = Новый СписокЗначений;
	ЭлементОтбора.ПравоеЗначение.ЗагрузитьЗначения(ПараметрКоманды);
	ЭлементОтбора.Использование = Истина;
	
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии",
	        ФиксированныеНастройки,
	        "Основной",
	        "Основной",
	        Истина);
	
	ОткрытьФорму("Отчет.АнализДоступностиТоваров.Форма",
	        ПараметрыФормы,
	        ПараметрыВыполненияКоманды.Источник,
	        ПараметрыВыполненияКоманды.Уникальность,
	        ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
