
Процедура СоставитьКоммерческоеПредложениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СоздатьКоммерческоеПредложение);

КонецПроцедуры

Процедура СоставитьКоммерческоеПредложениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура ОтправитьПочтуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ОтправитьПочту);
	
КонецПроцедуры

Процедура ОтправитьПочтуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура ПозвонитьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.Позвонить);
	
КонецПроцедуры


Процедура ПозвонитьПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура СогласоватьКоммерческоеПредложениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
	СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СогласоватьКоммерческоеПредложение);
КонецПроцедуры

Процедура СогласоватьКоммерческоеПредложениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура СформироватьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
	СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.СформироватьЗаказ);
КонецПроцедуры

Процедура СформироватьЗаказПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура ОтправитьЗаказПоПочтеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ОтправитьЗаказПоПочте);
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура ПозвонитьПослеЗаказаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
   СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ПозвонитьПослеЗаказа);
КонецПроцедуры

//-----------------------------------------------------------------------------

Процедура ОбеспечитьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		СделкиСервер.ЗаполнитьРеквизитыЗадачПроцесса(
		Предмет, БизнесПроцессы.акСделкаСДилерами,
		ТочкаМаршрутаБизнесПроцесса,
		ФормируемыеЗадачи
	);
    СделкиСервер.УстановитьЭтапПроцесса(Предмет, Справочники.СостоянияПроцессов.ОбеспечитьЗаказ);
КонецПроцедуры



