////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотКлиентПереопределяемый: клиент
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Раскладывает Строку в массив строк, используя "./\" как разделитель.
// Параметры:
//	Строка - Строка, которую нужно разложить
// Возвращает: массив фрагментов строки
Функция РазложитьСтрокуПоТочкамИСлэшам(Строка) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.РазложитьСтрокуПоТочкамИСлэшам(Строка);
	
КонецФункции

//Возвращает разделитель пути файловой системы.
//Параметры:
//	Платформа - Неопределено:
//   На клиенте - разделитель пути клиентской файловой системы.
//   На сервере - разделитель пути серверной  файловой системы.
// 
//            - ТипПлатформы - разделитель пути файловой системы для
//                             указанного типа платформы.
Функция РазделительПути(Платформа = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.РазделительПути(Платформа); 
	
КонецФункции

//Сохраняет массив пользовательских настроек МассивСтруктур. 
// Может применяться для случаев вызова с клиента.
// 
// Параметры:
//    МассивСтруктур - Массив - массив структур с полями "Объект", "Настройка", "Значение".
//    НужноОбновитьПовторноИспользуемыеЗначения - Булево - требуется обновить повторно используемые значения
Процедура ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, НужноОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, НужноОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры
