////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда

		Номенклатура = Параметры.Отбор.Номенклатура;

		Если Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар
			И Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Для услуг (работ) методы управления запасами не используются'");

			Элементы.ПараметрыОбеспеченияТоварами.ТолькоПросмотр = Истина;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры
