////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешитьРедактированиеИспользованиеХарактеристик = Истина;
	РазрешитьРедактированиеТипНоменклатуры            = Истина;
	РазрешитьРедактированиеИспользованияСерий         = Истина;
	РазрешитьРедактированиеВариантаОформленияУслуги   = Истина;
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеТипНоменклатуры Тогда
		Результат.Добавить("ТипНоменклатуры");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользованиеХарактеристик Тогда
		Результат.Добавить("ИспользоватьХарактеристики");
		Результат.Добавить("ИспользованиеХарактеристик");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользованияСерий Тогда
		Результат.Добавить("ИспользоватьСерии");
		Результат.Добавить("ПолитикиУчетаСерий");
		Результат.Добавить("НастройкаИспользованияСерий");
		Результат.Добавить("ТочностьУказанияСрокаГодностиСерии");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВариантаОформленияУслуги ТОгда
		Результат.Добавить("ВариантОформленияПродажи");
	КонецЕсли;

	Закрыть(Результат);
	
КонецПроцедуры // РазрешитьРедактирование()

