////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция получает массив товаров, по которым ведется учет по ГТД.
//
// Параметры:
//	Товары - ДанныеФормыКоллекция - Табличная часть товаров
//
// Возвращаемое значение:
//	Массив - Массив товаров, по которым ведется учет по номерам ГТД.
//
Функция ПолучитьТоварыВедетсяУчетПоГТД(Знач Товары) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Ссылка В (&МассивНоменклатуры)
	|	И ДанныеСправочника.ТипНоменклатуры В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И ДанныеСправочника.ВестиУчетПоГТД
	|";
	Запрос.УстановитьПараметр("МассивНоменклатуры", Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьТоварыВедетсяУчетПоГТД()

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
