////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ФизЛицо") Тогда
		Возврат;
	КонецЕсли;
	
	ФизЛицо = Параметры.ФизЛицо;
	Список.Параметры.УстановитьЗначениеПараметра("ФизЛицо", ФизЛицо);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		//отменить стандартную обработку и параметризовать форму нового
		Отказ = Истина;
		ОткрытьФормуМодально("РегистрСведений.СвязиМеждуФизЛицами.ФормаЗаписи",Новый Структура("ФизЛицо", ФизЛицо));
	КонецЕсли;
	
КонецПроцедуры
