//тестовое изменение базы по задаче #147 для отображения в редмайне

////////////////////////////////////////////////////////////////////////////////
// Обработчики выгрузки конвертации УТ11 ПаксМед --> УПП Доктор Мебель {10924d8d-8cb3-11e2-a471-00245416f808}                                                                                        
// 
// Данный модуль содержит экспортные процедуры обработчиков событий конвертации 
// и предназначен для отладки правил обмена. После отладки рекомендуется
// скопировать текст модуля в буфер обмена и импортировать его в базу
// "Конвертация данных".
//
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛЬЗУЕМЫЕ СОКРАЩЕНИЯ ИМЕН ПЕРЕМЕННЫХ (АББРЕВИАТУРЫ)
//
//  ПКО  - правило конвертации объектов
//  ПКС  - правило конвертации свойств объектов
//  ПКГС - правило конвертации группы свойств объектов
//  ПВД  - правило выгрузки данных
//  ПОД  - правило очистки данных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТКИ
// Данный раздел изменять запрещено.

Перем Параметры;
Перем Алгоритмы;
Перем Запросы;
Перем УзелДляОбмена;
Перем ОбщиеПроцедурыФункции;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ (ГЛОБАЛЬНЫЕ)
// В данном разделе разрешено изменять реализацию процедур.

Процедура Конвертация_ПослеЗагрузкиПравилОбмена() Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередВыгрузкойДанных(ФайлОбмена, Отказ) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередПолучениемИзмененныхОбъектов(Получатель, УзелДляФоновогоОбмена) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПослеВыгрузкиДанных(ФайлОбмена) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередКонвертациейОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены,ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередОтправкойИнформацииОбУдалении(Ссылка, Отказ) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКО_Валюты_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_Валюты_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Валюты_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Валюты_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыНоменклатуры_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыНоменклатуры_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыНоменклатуры_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыНоменклатуры_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДоговорыКонтрагентов_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДоговорыКонтрагентов_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДоговорыКонтрагентов_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДоговорыКонтрагентов_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЗаказПоставщику_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	Если Источник.Статус=Перечисления.СтатусыЗаказовПоставщикам.Закрыт ИЛИ 
		 Источник.Статус=Перечисления.СтатусыЗаказовПоставщикам.НеСогласован Тогда
		 Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_ЗаказПоставщику_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЗаказПоставщику_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЗаказПоставщику_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_КлассификаторЕдиницИзмерения_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_КлассификаторЕдиницИзмерения_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_КлассификаторЕдиницИзмерения_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_КлассификаторЕдиницИзмерения_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_КонтрагентВОрганизацию_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_КонтрагентВОрганизацию_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_КонтрагентВОрганизацию_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_КонтрагентВОрганизацию_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Контрагенты_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_Контрагенты_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Контрагенты_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Контрагенты_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Номенклатура_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_Номенклатура_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Номенклатура_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Номенклатура_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ОрганизацияВКонтрагента_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ОрганизацияВКонтрагента_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ОрганизацияВКонтрагента_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ОрганизацияВКонтрагента_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПодчиненныеЕдиницыИзмерения_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПодчиненныеЕдиницыИзмерения_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПодчиненныеЕдиницыИзмерения_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПодчиненныеЕдиницыИзмерения_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтавкиНДС_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтавкиНДС_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтавкиНДС_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтавкиНДС_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыНоменклатуры_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыНоменклатуры_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыНоменклатуры_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыНоменклатуры_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ХарактеристикиНоменклатуры_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ХарактеристикиНоменклатуры_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ХарактеристикиНоменклатуры_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ХарактеристикиНоменклатуры_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЦеновыеГруппы_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЦеновыеГруппы_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЦеновыеГруппы_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЦеновыеГруппы_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЮрФизЛицо_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЮрФизЛицо_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЮрФизЛицо_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ЮрФизЛицо_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКС_Валюты_Код_ПередВыгрузкойСвойства_1_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_Код_ПриВыгрузкеСвойства_1_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_Код_ПослеВыгрузкиСвойства_1_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_Наименование_ПередВыгрузкойСвойства_2_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_Наименование_ПриВыгрузкеСвойства_2_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_Наименование_ПослеВыгрузкиСвойства_2_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_НаименованиеПолное_ПередВыгрузкойСвойства_3_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_НаименованиеПолное_ПриВыгрузкеСвойства_3_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_НаименованиеПолное_ПослеВыгрузкиСвойства_3_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_ПараметрыПрописиНаРусском_ПередВыгрузкойСвойства_4_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_ПараметрыПрописиНаРусском_ПриВыгрузкеСвойства_4_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_ПараметрыПрописиНаРусском_ПослеВыгрузкиСвойства_4_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_ПометкаУдаления_ПередВыгрузкойСвойства_5_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_ПометкаУдаления_ПриВыгрузкеСвойства_5_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Валюты_ПометкаУдаления_ПослеВыгрузкиСвойства_5_6(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_Наименование_ПередВыгрузкойСвойства_1_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_Наименование_ПриВыгрузкеСвойства_1_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_Наименование_ПослеВыгрузкиСвойства_1_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ПометкаУдаления_ПередВыгрузкойСвойства_2_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ПометкаУдаления_ПриВыгрузкеСвойства_2_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ПометкаУдаления_ПослеВыгрузкиСвойства_2_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_Родитель_ПередВыгрузкойСвойства_3_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_Родитель_ПриВыгрузкеСвойства_3_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_Родитель_ПослеВыгрузкиСвойства_3_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ТипНоменклатуры_ПередВыгрузкойСвойства_4_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ТипНоменклатуры_ПриВыгрузкеСвойства_4_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ТипНоменклатуры_ПослеВыгрузкиСвойства_4_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ЭтоГруппа_ПередВыгрузкойСвойства_5_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ЭтоГруппа_ПриВыгрузкеСвойства_5_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыНоменклатуры_ЭтоГруппа_ПослеВыгрузкиСвойства_5_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Дата_ПередВыгрузкойСвойства_1_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Дата_ПриВыгрузкеСвойства_1_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Дата_ПослеВыгрузкиСвойства_1_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Комментарий_ПередВыгрузкойСвойства_2_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Комментарий_ПриВыгрузкеСвойства_2_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Комментарий_ПослеВыгрузкиСвойства_2_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Наименование_ПередВыгрузкойСвойства_3_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Наименование_ПриВыгрузкеСвойства_3_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Наименование_ПослеВыгрузкиСвойства_3_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Номер_ПередВыгрузкойСвойства_4_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Номер_ПриВыгрузкеСвойства_4_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Номер_ПослеВыгрузкиСвойства_4_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Организация_ПередВыгрузкойСвойства_5_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Организация_ПриВыгрузкеСвойства_5_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Организация_ПослеВыгрузкиСвойства_5_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ПометкаУдаления_ПередВыгрузкойСвойства_6_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ПометкаУдаления_ПриВыгрузкеСвойства_6_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ПометкаУдаления_ПослеВыгрузкиСвойства_6_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Контрагент_ПередВыгрузкойСвойства_7_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Контрагент_ПриВыгрузкеСвойства_7_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Контрагент_ПослеВыгрузкиСвойства_7_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ВидДоговора_ПередВыгрузкойСвойства_8_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = "СПокупателем";

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ВидДоговора_ПриВыгрузкеСвойства_8_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ВидДоговора_ПослеВыгрузкиСвойства_8_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Валюта_ПередВыгрузкойСвойства_9_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Валюта_ПриВыгрузкеСвойства_9_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Валюта_ПослеВыгрузкиСвойства_9_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ВедениеВзаиморасчетов_ПередВыгрузкойСвойства_10_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = "ПоДоговоруВЦелом";

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ВедениеВзаиморасчетов_ПриВыгрузкеСвойства_10_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_ВедениеВзаиморасчетов_ПослеВыгрузкиСвойства_10_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_АдресДоставки_ПередВыгрузкойСвойства_1_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_АдресДоставки_ПриВыгрузкеСвойства_1_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_АдресДоставки_ПослеВыгрузкиСвойства_1_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Дата_ПередВыгрузкойСвойства_2_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Дата_ПриВыгрузкеСвойства_2_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Дата_ПослеВыгрузкиСвойства_2_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ДокументОснование_ПередВыгрузкойСвойства_3_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ДокументОснование_ПриВыгрузкеСвойства_3_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ДокументОснование_ПослеВыгрузкиСвойства_3_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Комментарий_ПередВыгрузкойСвойства_4_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Комментарий_ПриВыгрузкеСвойства_4_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Комментарий_ПослеВыгрузкиСвойства_4_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Контрагент_ПередВыгрузкойСвойства_5_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Контрагент_ПриВыгрузкеСвойства_5_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Контрагент_ПослеВыгрузкиСвойства_5_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Номер_ПередВыгрузкойСвойства_6_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Номер_ПриВыгрузкеСвойства_6_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Номер_ПослеВыгрузкиСвойства_6_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Организация_ПередВыгрузкойСвойства_7_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Организация_ПриВыгрузкеСвойства_7_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Организация_ПослеВыгрузкиСвойства_7_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Подразделение_ПередВыгрузкойСвойства_8_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Подразделение_ПриВыгрузкеСвойства_8_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Подразделение_ПослеВыгрузкиСвойства_8_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ПометкаУдаления_ПередВыгрузкойСвойства_9_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ПометкаУдаления_ПриВыгрузкеСвойства_9_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ПометкаУдаления_ПослеВыгрузкиСвойства_9_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Проведен_ПередВыгрузкойСвойства_10_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Проведен_ПриВыгрузкеСвойства_10_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Проведен_ПослеВыгрузкиСвойства_10_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_СуммаДокумента_ПередВыгрузкойСвойства_11_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_СуммаДокумента_ПриВыгрузкеСвойства_11_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_СуммаДокумента_ПослеВыгрузкиСвойства_11_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ДопКомплектация_ПередВыгрузкойСвойства_13_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ДопКомплектация_ПриВыгрузкеСвойства_13_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ДопКомплектация_ПослеВыгрузкиСвойства_13_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_НестандартОписание_ПередВыгрузкойСвойства_14_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_НестандартОписание_ПриВыгрузкеСвойства_14_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_НестандартОписание_ПослеВыгрузкиСвойства_14_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ПризнакНестандарт_ПередВыгрузкойСвойства_15_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ПризнакНестандарт_ПриВыгрузкеСвойства_15_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ПризнакНестандарт_ПослеВыгрузкиСвойства_15_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ЭскизФайл_ПередВыгрузкойСвойства_16_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ЭскизФайл_ПриВыгрузкеСвойства_16_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_ЭскизФайл_ПослеВыгрузкиСвойства_16_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Количество_ПередВыгрузкойСвойства_17_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Количество_ПриВыгрузкеСвойства_17_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Количество_ПослеВыгрузкиСвойства_17_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Номенклатура_ПередВыгрузкойСвойства_18_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Номенклатура_ПриВыгрузкеСвойства_18_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Номенклатура_ПослеВыгрузкиСвойства_18_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_СтавкаНДС_ПередВыгрузкойСвойства_19_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_СтавкаНДС_ПриВыгрузкеСвойства_19_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_СтавкаНДС_ПослеВыгрузкиСвойства_19_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Сумма_ПередВыгрузкойСвойства_20_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Сумма_ПриВыгрузкеСвойства_20_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Сумма_ПослеВыгрузкиСвойства_20_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_СуммаНДС_ПередВыгрузкойСвойства_21_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_СуммаНДС_ПриВыгрузкеСвойства_21_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_СуммаНДС_ПослеВыгрузкиСвойства_21_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Цена_ПередВыгрузкойСвойства_22_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Цена_ПриВыгрузкеСвойства_22_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Цена_ПослеВыгрузкиСвойства_22_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Коэффициент_ПередВыгрузкойСвойства_23_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = 1;

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Коэффициент_ПриВыгрузкеСвойства_23_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Коэффициент_ПослеВыгрузкиСвойства_23_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_ЕдиницаИзмерения_ПередВыгрузкойСвойства_24_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = ОбъектКоллекции.Номенклатура.ЕдиницаИзмерения;
	ИсходящиеДанные  = Новый Структура;
	ИсходящиеДанные.Вставить("Владелец",ОбъектКоллекции.Номенклатура);

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_ЕдиницаИзмерения_ПриВыгрузкеСвойства_24_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_ЕдиницаИзмерения_ПослеВыгрузкиСвойства_24_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Высота_ПередВыгрузкойСвойства_25_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Высота_ПриВыгрузкеСвойства_25_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Высота_ПослеВыгрузкиСвойства_25_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Глубина_ПередВыгрузкойСвойства_26_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Глубина_ПриВыгрузкеСвойства_26_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Глубина_ПослеВыгрузкиСвойства_26_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Ширина_ПередВыгрузкойСвойства_27_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Ширина_ПриВыгрузкеСвойства_27_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_АК_Ширина_ПослеВыгрузкиСвойства_27_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Характеристика_ПередВыгрузкойСвойства_28_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	ИсходящиеДанные = Новый Структура;
	ИсходящиеДанные.Вставить("Владелец",ОбъектКоллекции.Номенклатура);
	ИсходящиеДанные.Вставить("Наименование",ВходящиеДанные.Цвет);

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Характеристика_ПриВыгрузкеСвойства_28_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Товары_Характеристика_ПослеВыгрузкиСвойства_28_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Соглашение_ПередВыгрузкойСвойства_29_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Соглашение_ПриВыгрузкеСвойства_29_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Соглашение_ПослеВыгрузкиСвойства_29_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ЦенаВключаетНДС_ПередВыгрузкойСвойства_30_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ЦенаВключаетНДС_ПриВыгрузкеСвойства_30_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ЦенаВключаетНДС_ПослеВыгрузкиСвойства_30_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_КурсВзаиморасчетов_ПередВыгрузкойСвойства_31_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = 1;

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_КурсВзаиморасчетов_ПриВыгрузкеСвойства_31_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_КурсВзаиморасчетов_ПослеВыгрузкиСвойства_31_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_КратностьВзаиморасчетов_ПередВыгрузкойСвойства_32_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = 1;

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_КратностьВзаиморасчетов_ПриВыгрузкеСвойства_32_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_КратностьВзаиморасчетов_ПослеВыгрузкиСвойства_32_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ВидОперации_ПередВыгрузкойСвойства_33_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = "ПродажаКомиссия";

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ВидОперации_ПриВыгрузкеСвойства_33_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_ВидОперации_ПослеВыгрузкиСвойства_33_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Валюта_ПередВыгрузкойСвойства_34_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Валюта_ПриВыгрузкеСвойства_34_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЗаказПоставщику_Валюта_ПослеВыгрузкиСвойства_34_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_Код_ПередВыгрузкойСвойства_1_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_Код_ПриВыгрузкеСвойства_1_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_Код_ПослеВыгрузкиСвойства_1_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_МеждународноеСокращение_ПередВыгрузкойСвойства_2_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_МеждународноеСокращение_ПриВыгрузкеСвойства_2_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_МеждународноеСокращение_ПослеВыгрузкиСвойства_2_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_Наименование_ПередВыгрузкойСвойства_3_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_Наименование_ПриВыгрузкеСвойства_3_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_Наименование_ПослеВыгрузкиСвойства_3_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_НаименованиеПолное_ПередВыгрузкойСвойства_4_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_НаименованиеПолное_ПриВыгрузкеСвойства_4_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_НаименованиеПолное_ПослеВыгрузкиСвойства_4_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_ПометкаУдаления_ПередВыгрузкойСвойства_5_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_ПометкаУдаления_ПриВыгрузкеСвойства_5_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КлассификаторЕдиницИзмерения_ПометкаУдаления_ПослеВыгрузкиСвойства_5_28(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ИНН_ПередВыгрузкойСвойства_1_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ИНН_ПриВыгрузкеСвойства_1_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ИНН_ПослеВыгрузкиСвойства_1_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_КодПоОКПО_ПередВыгрузкойСвойства_2_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_КодПоОКПО_ПриВыгрузкеСвойства_2_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_КодПоОКПО_ПослеВыгрузкиСвойства_2_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_КПП_ПередВыгрузкойСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_КПП_ПриВыгрузкеСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_КПП_ПослеВыгрузкиСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_НаименованиеПолное_ПередВыгрузкойСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_НаименованиеПолное_ПриВыгрузкеСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_НаименованиеПолное_ПослеВыгрузкиСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ЮрФизЛицо_ПередВыгрузкойСвойства_5_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ЮрФизЛицо_ПриВыгрузкеСвойства_5_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ЮрФизЛицо_ПослеВыгрузкиСвойства_5_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_Наименование_ПередВыгрузкойСвойства_6_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_Наименование_ПриВыгрузкеСвойства_6_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_Наименование_ПослеВыгрузкиСвойства_6_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ПометкаУдаления_ПередВыгрузкойСвойства_7_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ПометкаУдаления_ПриВыгрузкеСвойства_7_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_КонтрагентВОрганизацию_ПометкаУдаления_ПослеВыгрузкиСвойства_7_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_Наименование_ПередВыгрузкойСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_Наименование_ПриВыгрузкеСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_Наименование_ПослеВыгрузкиСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ИНН_ПередВыгрузкойСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ИНН_ПриВыгрузкеСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ИНН_ПослеВыгрузкиСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_КодПоОКПО_ПередВыгрузкойСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_КодПоОКПО_ПриВыгрузкеСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_КодПоОКПО_ПослеВыгрузкиСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_КПП_ПередВыгрузкойСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_КПП_ПриВыгрузкеСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_КПП_ПослеВыгрузкиСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_НаименованиеПолное_ПередВыгрузкойСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_НаименованиеПолное_ПриВыгрузкеСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_НаименованиеПолное_ПослеВыгрузкиСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ЮрФизЛицо_ПередВыгрузкойСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ЮрФизЛицо_ПриВыгрузкеСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ЮрФизЛицо_ПослеВыгрузкиСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ПометкаУдаления_ПередВыгрузкойСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ПометкаУдаления_ПриВыгрузкеСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Контрагенты_ПометкаУдаления_ПослеВыгрузкиСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Код_ПередВыгрузкойСвойства_1_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Код_ПриВыгрузкеСвойства_1_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Код_ПослеВыгрузкиСвойства_1_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Наименование_ПередВыгрузкойСвойства_2_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Наименование_ПриВыгрузкеСвойства_2_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Наименование_ПослеВыгрузкиСвойства_2_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Родитель_ПередВыгрузкойСвойства_3_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Родитель_ПриВыгрузкеСвойства_3_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Родитель_ПослеВыгрузкиСвойства_3_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЭтоГруппа_ПередВыгрузкойСвойства_4_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЭтоГруппа_ПриВыгрузкеСвойства_4_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЭтоГруппа_ПослеВыгрузкиСвойства_4_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Артикул_ПередВыгрузкойСвойства_5_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Артикул_ПриВыгрузкеСвойства_5_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Артикул_ПослеВыгрузкиСвойства_5_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ВидНоменклатуры_ПередВыгрузкойСвойства_6_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ВидНоменклатуры_ПриВыгрузкеСвойства_6_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ВидНоменклатуры_ПослеВыгрузкиСвойства_6_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_НаименованиеПолное_ПередВыгрузкойСвойства_7_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_НаименованиеПолное_ПриВыгрузкеСвойства_7_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_НаименованиеПолное_ПослеВыгрузкиСвойства_7_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Производитель_ПередВыгрузкойСвойства_8_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Производитель_ПриВыгрузкеСвойства_8_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_Производитель_ПослеВыгрузкиСвойства_8_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_СтавкаНДС_ПередВыгрузкойСвойства_9_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_СтавкаНДС_ПриВыгрузкеСвойства_9_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_СтавкаНДС_ПослеВыгрузкиСвойства_9_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЦеноваяГруппа_ПередВыгрузкойСвойства_10_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЦеноваяГруппа_ПриВыгрузкеСвойства_10_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЦеноваяГруппа_ПослеВыгрузкиСвойства_10_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ПометкаУдаления_ПередВыгрузкойСвойства_11_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ПометкаУдаления_ПриВыгрузкеСвойства_11_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ПометкаУдаления_ПослеВыгрузкиСвойства_11_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЕдиницаИзмерения_ПередВыгрузкойСвойства_12_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЕдиницаИзмерения_ПриВыгрузкеСвойства_12_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ЕдиницаИзмерения_ПослеВыгрузкиСвойства_12_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ВестиУчетПоХарактеристикам_ПередВыгрузкойСвойства_13_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = Истина;

КонецПроцедуры

Процедура ПКС_Номенклатура_ВестиУчетПоХарактеристикам_ПриВыгрузкеСвойства_13_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Номенклатура_ВестиУчетПоХарактеристикам_ПослеВыгрузкиСвойства_13_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Наименование_ПередВыгрузкойСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Наименование_ПриВыгрузкеСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Наименование_ПослеВыгрузкиСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ВидОбменаСКонтролирующимиОрганами_ПередВыгрузкойСвойства_3_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ВидОбменаСКонтролирующимиОрганами_ПриВыгрузкеСвойства_3_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ВидОбменаСКонтролирующимиОрганами_ПослеВыгрузкиСвойства_3_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ГоловнаяОрганизация_ПередВыгрузкойСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ГоловнаяОрганизация_ПриВыгрузкеСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ГоловнаяОрганизация_ПослеВыгрузкиСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ДополнительныйКодФСС_ПередВыгрузкойСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ДополнительныйКодФСС_ПриВыгрузкеСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ДополнительныйКодФСС_ПослеВыгрузкиСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИндивидуальныйПредприниматель_ПередВыгрузкойСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИндивидуальныйПредприниматель_ПриВыгрузкеСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИндивидуальныйПредприниматель_ПослеВыгрузкиСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИНН_ПередВыгрузкойСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИНН_ПриВыгрузкеСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИНН_ПослеВыгрузкиСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаПФР_ПередВыгрузкойСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаПФР_ПриВыгрузкеСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаПФР_ПослеВыгрузкиСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаФСГС_ПередВыгрузкойСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаФСГС_ПриВыгрузкеСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаФСГС_ПослеВыгрузкиСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПодчиненностиФСС_ПередВыгрузкойСвойства_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПодчиненностиФСС_ПриВыгрузкеСвойства_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПодчиненностиФСС_ПослеВыгрузкиСвойства_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКАТО_ПередВыгрузкойСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКАТО_ПриВыгрузкеСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКАТО_ПослеВыгрузкиСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКПО_ПередВыгрузкойСвойства_12_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКПО_ПриВыгрузкеСвойства_12_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКПО_ПослеВыгрузкиСвойства_12_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КПП_ПередВыгрузкойСвойства_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КПП_ПриВыгрузкеСвойства_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КПП_ПослеВыгрузкиСвойства_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеПолное_ПередВыгрузкойСвойства_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеПолное_ПриВыгрузкеСвойства_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеПолное_ПослеВыгрузкиСвойства_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеСокращенное_ПередВыгрузкойСвойства_15_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеСокращенное_ПриВыгрузкеСвойства_15_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеСокращенное_ПослеВыгрузкиСвойства_15_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаПФР_ПередВыгрузкойСвойства_16_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаПФР_ПриВыгрузкеСвойства_16_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаПФР_ПослеВыгрузкиСвойства_16_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаФСС_ПередВыгрузкойСвойства_17_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаФСС_ПриВыгрузкеСвойства_17_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаФСС_ПослеВыгрузкиСвойства_17_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКаталогОтправкиДанныхОтчетности_ПередВыгрузкойСвойства_18_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКаталогОтправкиДанныхОтчетности_ПриВыгрузкеСвойства_18_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКаталогОтправкиДанныхОтчетности_ПослеВыгрузкиСвойства_18_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКаталогПрограммыЭлектроннойПочты_ПередВыгрузкойСвойства_19_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКаталогПрограммыЭлектроннойПочты_ПриВыгрузкеСвойства_19_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКаталогПрограммыЭлектроннойПочты_ПослеВыгрузкиСвойства_19_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКодАбонента_ПередВыгрузкойСвойства_20_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКодАбонента_ПриВыгрузкеСвойства_20_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбменКодАбонента_ПослеВыгрузкиСвойства_20_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОГРН_ПередВыгрузкойСвойства_21_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОГРН_ПриВыгрузкеСвойства_21_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОГРН_ПослеВыгрузкиСвойства_21_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Префикс_ПередВыгрузкойСвойства_22_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Префикс_ПриВыгрузкеСвойства_22_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Префикс_ПослеВыгрузкиСвойства_22_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РайонныйКоэффициент_ПередВыгрузкойСвойства_23_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РайонныйКоэффициент_ПриВыгрузкеСвойства_23_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РайонныйКоэффициент_ПослеВыгрузкиСвойства_23_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерПФР_ПередВыгрузкойСвойства_24_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерПФР_ПриВыгрузкеСвойства_24_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерПФР_ПослеВыгрузкиСвойства_24_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерФСС_ПередВыгрузкойСвойства_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерФСС_ПриВыгрузкеСвойства_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерФСС_ПослеВыгрузкиСвойства_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_СвидетельствоДатаВыдачи_ПередВыгрузкойСвойства_26_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_СвидетельствоДатаВыдачи_ПриВыгрузкеСвойства_26_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_СвидетельствоДатаВыдачи_ПослеВыгрузкиСвойства_26_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_СвидетельствоСерияНомер_ПередВыгрузкойСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_СвидетельствоСерияНомер_ПриВыгрузкеСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_СвидетельствоСерияНомер_ПослеВыгрузкиСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ТерриториальныеУсловияПФР_ПередВыгрузкойСвойства_28_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ТерриториальныеУсловияПФР_ПриВыгрузкеСвойства_28_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ТерриториальныеУсловияПФР_ПослеВыгрузкиСвойства_28_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_УчетнаяЗаписьОбмена_ПередВыгрузкойСвойства_29_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_УчетнаяЗаписьОбмена_ПриВыгрузкеСвойства_29_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_УчетнаяЗаписьОбмена_ПослеВыгрузкиСвойства_29_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЦифровойИндексОбособленногоПодразделения_ПередВыгрузкойСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЦифровойИндексОбособленногоПодразделения_ПриВыгрузкеСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЦифровойИндексОбособленногоПодразделения_ПослеВыгрузкиСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЮрФизЛицо_ПередВыгрузкойСвойства_31_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЮрФизЛицо_ПриВыгрузкеСвойства_31_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЮрФизЛицо_ПослеВыгрузкиСвойства_31_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПометкаУдаления_ПередВыгрузкойСвойства_32_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПометкаУдаления_ПриВыгрузкеСвойства_32_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПометкаУдаления_ПослеВыгрузкиСвойства_32_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ИНН_ПередВыгрузкойСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ИНН_ПриВыгрузкеСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ИНН_ПослеВыгрузкиСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_КодПоОКПО_ПередВыгрузкойСвойства_2_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_КодПоОКПО_ПриВыгрузкеСвойства_2_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_КодПоОКПО_ПослеВыгрузкиСвойства_2_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_КПП_ПередВыгрузкойСвойства_3_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_КПП_ПриВыгрузкеСвойства_3_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_КПП_ПослеВыгрузкиСвойства_3_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_НаименованиеПолное_ПередВыгрузкойСвойства_4_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_НаименованиеПолное_ПриВыгрузкеСвойства_4_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_НаименованиеПолное_ПослеВыгрузкиСвойства_4_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ОбособленноеПодразделение_ПередВыгрузкойСвойства_5_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ОбособленноеПодразделение_ПриВыгрузкеСвойства_5_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ОбособленноеПодразделение_ПослеВыгрузкиСвойства_5_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ЮрФизЛицо_ПередВыгрузкойСвойства_6_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ЮрФизЛицо_ПриВыгрузкеСвойства_6_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ЮрФизЛицо_ПослеВыгрузкиСвойства_6_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_Наименование_ПередВыгрузкойСвойства_7_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_Наименование_ПриВыгрузкеСвойства_7_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_Наименование_ПослеВыгрузкиСвойства_7_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ПометкаУдаления_ПередВыгрузкойСвойства_8_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ПометкаУдаления_ПриВыгрузкеСвойства_8_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_ПометкаУдаления_ПослеВыгрузкиСвойства_8_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_Покупатель_ПередВыгрузкойСвойства_9_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = Истина;

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_Покупатель_ПриВыгрузкеСвойства_9_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ОрганизацияВКонтрагента_Покупатель_ПослеВыгрузкиСвойства_9_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Код_ПередВыгрузкойСвойства_1_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Код_ПриВыгрузкеСвойства_1_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Код_ПослеВыгрузкиСвойства_1_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Наименование_ПередВыгрузкойСвойства_2_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Наименование_ПриВыгрузкеСвойства_2_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Наименование_ПослеВыгрузкиСвойства_2_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_ПометкаУдаления_ПередВыгрузкойСвойства_3_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_ПометкаУдаления_ПриВыгрузкеСвойства_3_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_ПометкаУдаления_ПослеВыгрузкиСвойства_3_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Владелец_ПередВыгрузкойСвойства_4_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Владелец_ПриВыгрузкеСвойства_4_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Владелец_ПослеВыгрузкиСвойства_4_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_ЕдиницаПоКлассификатору_ПередВыгрузкойСвойства_5_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = Источник;

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_ЕдиницаПоКлассификатору_ПриВыгрузкеСвойства_5_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_ЕдиницаПоКлассификатору_ПослеВыгрузкиСвойства_5_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Коэффициент_ПередВыгрузкойСвойства_6_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	Значение = 1;

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Коэффициент_ПриВыгрузкеСвойства_6_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ПодчиненныеЕдиницыИзмерения_Коэффициент_ПослеВыгрузкиСвойства_6_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ДатаРождения_ПередВыгрузкойСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ДатаРождения_ПриВыгрузкеСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ДатаРождения_ПослеВыгрузкиСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ИНН_ПередВыгрузкойСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ИНН_ПриВыгрузкеСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ИНН_ПослеВыгрузкиСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Наименование_ПередВыгрузкойСвойства_3_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Наименование_ПриВыгрузкеСвойства_3_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Наименование_ПослеВыгрузкиСвойства_3_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Пол_ПередВыгрузкойСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Пол_ПриВыгрузкеСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Пол_ПослеВыгрузкиСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ПометкаУдаления_ПередВыгрузкойСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ПометкаУдаления_ПриВыгрузкеСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ПометкаУдаления_ПослеВыгрузкиСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Родитель_ПередВыгрузкойСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Родитель_ПриВыгрузкеСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Родитель_ПослеВыгрузкиСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ЭтоГруппа_ПередВыгрузкойСвойства_7_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ЭтоГруппа_ПриВыгрузкеСвойства_7_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ЭтоГруппа_ПослеВыгрузкиСвойства_7_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ХарактеристикиНоменклатуры_Владелец_ПередВыгрузкойСвойства_1_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ХарактеристикиНоменклатуры_Владелец_ПриВыгрузкеСвойства_1_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ХарактеристикиНоменклатуры_Владелец_ПослеВыгрузкиСвойства_1_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ХарактеристикиНоменклатуры_Наименование_ПередВыгрузкойСвойства_2_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ХарактеристикиНоменклатуры_Наименование_ПриВыгрузкеСвойства_2_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ХарактеристикиНоменклатуры_Наименование_ПослеВыгрузкиСвойства_2_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЦеновыеГруппы_Наименование_ПередВыгрузкойСвойства_1_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЦеновыеГруппы_Наименование_ПриВыгрузкеСвойства_1_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЦеновыеГруппы_Наименование_ПослеВыгрузкиСвойства_1_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЦеновыеГруппы_ПометкаУдаления_ПередВыгрузкойСвойства_2_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЦеновыеГруппы_ПометкаУдаления_ПриВыгрузкеСвойства_2_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ЦеновыеГруппы_ПометкаУдаления_ПослеВыгрузкиСвойства_2_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ГРУПП СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКГС_ЗаказПоставщику_Товары_ПередОбработкойВыгрузки_12_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ЗаказПоставщику_Товары_ПередВыгрузкойСвойства_12_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, ОбъектКоллекции, УзелКоллекцииСвойств, УзелКоллекцииОбъектов) Экспорт

		ВходящиеДанные  = Новый Структура("Цвет,АК_Ширина,АК_Глубина,АК_Высота");
		Для Каждого текПараметр Из ОбъектКоллекции.Характеристика.ДополнительныеРеквизиты Цикл
			Если Найти(Строка(текПараметр.Свойство),"Цвет")>0 Тогда
				ВходящиеДанные.Цвет = СокрЛП(Строка(текПараметр.Значение));
			КонецЕсли;
			Если ОбъектКоллекции.АК_ПризнакНестандарт Тогда
				Если Найти(Строка(текПараметр.Свойство),"Габаритные")>0 Тогда
					СтрокаГабаритов = СокрЛП(Строка(текПараметр.Значение));
					ПодстрокаЦифр = "0123456789";
					номерРазмера = 1;
					текН = 1;
					Пока СтрДлина(СтрокаГабаритов)> 0 Цикл
						
						//нашли первый симовл
						Для н = 1 по СтрДлина(СтрокаГабаритов) Цикл
							Если Найти(ПодстрокаЦифр,Сред(СтрокаГабаритов,н,1))>0 И Сред(СтрокаГабаритов,н,1) <> "" Тогда
								Прервать;
							КонецЕсли;				
						КонецЦикла;
						//нашли текущий размер
						текРазмер = "";
						Пока Найти(ПодстрокаЦифр,Сред(СтрокаГабаритов,н,1))>0 И Сред(СтрокаГабаритов,н,1) <> "" Цикл
							текРазмер = текРазмер+ Сред(СтрокаГабаритов,н,1);
							н = н+1;
						КонецЦикла;
						
						Если номерРазмера = 1 Тогда
							ВходящиеДанные.АК_Ширина = текРазмер;	
						КонецЕсли;
						Если номерРазмера = 2 Тогда
							ВходящиеДанные.АК_Глубина = текРазмер;
						КонецЕсли;
						Если номерРазмера = 3 Тогда
							ВходящиеДанные.АК_Высота = текРазмер;
						КонецЕсли;
						
						номерРазмера = номерРазмера + 1;
						
						СтрокаГабаритов = Прав(СтрокаГабаритов,СтрДлина(СтрокаГабаритов)-н);
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	

КонецПроцедуры

Процедура ПКГС_ЗаказПоставщику_Товары_ПриВыгрузкеСвойства_12_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, ОбъектКоллекции, УзелКоллекцииОбъектов, УзелОбъектаКоллекции,
	УзелКоллекцииСвойств, СтандартнаяОбработка) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ЗаказПоставщику_Товары_ПослеВыгрузкиСвойства_12_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, ОбъектКоллекции, УзелКоллекцииОбъектов, УзелКоллекцииСвойств,
	УзелОбъектаКоллекции) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ЗаказПоставщику_Товары_ПослеОбработкиВыгрузки_12_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКО, ПКГС, Отказ, УзелКоллекцииСвойств, УзелКоллекцииОбъектов) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ВЫГРУЗКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПВД_ЗаказПоставщику_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ЗаказПоставщику_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ЗаказПоставщику_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_ЗаказПоставщику_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЧИСТКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПАРАМЕТРОВ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// АЛГОРИТМЫ
// Данный раздел разрешено изменять.
// Также допустимо размещать процедуры с алгоритмами в любом из разделов выше.

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Данный раздел изменять запрещено.

// Устанавливает значение параметра "Загрузка" для свойства объекта "ОбменДанными".
//
// Параметры:
//  Объект   - объект, для которого устанавливается свойство
//  Значение - значение устанавливаемого свойства "Загрузка"
// 
Процедура УстановитьОбменДаннымиЗагрузка(Объект, Значение = Истина, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.УстановитьОбменДаннымиЗагрузка(Объект, Значение, ОтправкаНазад);
	
КонецПроцедуры

// Записывает объект в информационную базу.
//
// Параметры:
//	Объект - Записываемый объект.
//	Тип - Строка - Тип объекта строкой.
// 
Процедура ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект = Ложь, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект, ОтправкаНазад);
	
КонецПроцедуры

// Отменяет проведение объекта в информационной базе.
//
// Параметры:
//	Объект - Объект для отмены проведения.
//	Тип - Строка - Тип объекта строкой.
//
Процедура ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект = Ложь)

	ОбщиеПроцедурыФункции.ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект);
	
КонецПроцедуры

// Выгружает регистр по отбору.
// 
// Парметры:
//	НаборЗаписейДляВыгрузки - Структура или НаборЗаписей - Отбор
//
Процедура ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, 
							Правило = Неопределено, 
							ВходящиеДанные = Неопределено, 
							НеВыгружатьОбъектыПоСсылкам = Ложь, 
							ИмяПКО = "",
							ПравилоВыгрузкиДанных = Неопределено)
							
	ОбщиеПроцедурыФункции.ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, Правило, ВходящиеДанные, НеВыгружатьОбъектыПоСсылкам, ИмяПКО, ПравилоВыгрузкиДанных);

КонецПроцедуры

// Устанавлявает пометку удаления.
//
// Параметры:
//	Объект - Объект для установки пометки.
//	ПометкаУдаления - Булево - Флаг пометки удаления.
//	ИмяТипаОбъекта - Строка - Тип объекта строкой.
//
Процедура УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта)
	
	ОбщиеПроцедурыФункции.УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта);
	
КонецПроцедуры

// Создает в файле обмена запись об удалении объекта.
//
// Параметры:
//	Ссылка - Ссылка на удаляемый объект.
//	ТипПриемника - Строка - Содрежит строковое представление типа приемника.
//	ТипИсточника - Строка - Содрежит строковое представление типа источника.
// 
Процедура ЗаписатьВФайлУдалениеОбъекта(Ссылка, Знач ТипПриемника, Знач ТипИсточника)
	
	ОбщиеПроцедурыФункции.ЗаписатьВФайлУдалениеОбъекта(Ссылка, ТипПриемника, ТипИсточника);
	
КонецПроцедуры

// Регистрирует объект, созданный при выгрузке.
//
// Параметры:
//	Ссылка - Ссылка на регистрируемый объект.
// 
Процедура ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка);
	
КонецПроцедуры

// Регистрирует предупреждение в журнале регистрации.
// Если в процессе обмена данными было обращение к этой процедуре, то обмен данными остановлен не будет.
// После завершения обмена статус выполнения обмена в мониторе для пользователя будет иметь значение "Предупреждение", если не было ошибок.
//
// Параметры:
//  Предупреждение - Строка. Текст предупреждения, который надо зарегистрировать.
// Информация, предупреждения и ошибки, возникающие в процессе обмена данными регистрируются в журнале регистрации.
// 
Процедура ЗарегистрироватьПредупреждение(Предупреждение)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьПредупреждение(Предупреждение);
	
КонецПроцедуры

// Инициализирует переменные, необходимые для отладки
//
// Параметры:
//  Владелец - Обработка КонвертацияОбъектовИнформационныхБаз
//
Процедура ПодключитьОбработкуДляОтладки(Владелец) Экспорт

	Параметры            	 = Владелец.Параметры;
	ОбщиеПроцедурыФункции	 = Владелец;
	Запросы              	 = Владелец.Запросы;
	УзелДляОбмена		 	 = Владелец.УзелДляОбмена;

КонецПроцедуры

// Производит выгрузку объекта в соответствии с указанным правилом конвертации
//
// Параметры:
//  Источник				 - произвольный источник данных
//  Приемник				 - xml-узел объекта приемника
//  ВходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилу
//                             для выполнения конвертации
//  ИсходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилам
//                             конвертации свойств
//  ИмяПКО					 - имя правила конвертации, согласно которому осуществляется выгрузка
//
// Возвращаемое значение:
//  xml-узел ссылки или значение приемника
//
Функция ВыгрузитьПоПравилу(Источник					= Неопределено,
						   Приемник					= Неопределено,
						   ВходящиеДанные			= Неопределено,
						   ИсходящиеДанные			= Неопределено,
						   ИмяПКО					= "")
						   
	Возврат ОбщиеПроцедурыФункции.ВыгрузитьПоПравилу(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО);

КонецФункции

// Признак того, что это загрузка в информационную базу.
// 
// Возвращаемое значение:
//	Булево - Признак режима загрузки данных
// 
Функция РежимЗагрузкиДанныхВИнформационнуюБазу()
	
	Возврат ОбщиеПроцедурыФункции.РежимЗагрузкиДанныхВИнформационнуюБазу();
	
КонецФункции

