//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	СформироватьСкладыПомещения();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ СКЛАДЫ ПОМЕЩЕНИЯ

&НаКлиенте
Процедура СкладыПомещенияПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ТекущиеДанные.Склад, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Помещение", ТекущиеДанные.Помещение, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладыПомещенияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СкладыПомещенияПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СкладыПомещенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ОткрытьЗначение(ТекущиеДанные.Представление);
		
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура СформироватьСкладыПомещения()
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Представление");
	Дерево.Колонки.Добавить("Склад");
	Дерево.Колонки.Добавить("Помещение");
	Дерево.Колонки.Добавить("ИспользоватьАдресноеХранение");
	Дерево.Колонки.Добавить("ПометкаУдаления");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Влож.Склад КАК Склад,
	|	Влож.Помещение КАК Помещение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Склады.Склад КАК Склад,
	|		Склады.Помещение КАК Помещение,
	|		Склады.ИспользоватьАдресноеХранение КАК ИспользоватьАдресноеХранение
	|	ИЗ
	|		(ВЫБРАТЬ 
	|			Склады.Ссылка КАК Склад,
	|			NULL КАК Помещение,
	|			ИСТИНА КАК ИспользоватьАдресноеХранение
	|		ИЗ
	|			Справочник.Склады КАК Склады
	|		ГДЕ
	|			(Склады.ИспользоватьАдресноеХранение
	|					ИЛИ Склады.ИспользоватьАдресноеХранениеСправочно)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ 
	|			СкладскиеПомещения.Владелец,
	|			NULL,
	|			ЛОЖЬ
	|		ИЗ
	|			Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	|		ГДЕ
	|			(СкладскиеПомещения.ИспользоватьАдресноеХранение
	|					ИЛИ СкладскиеПомещения.ИспользоватьАдресноеХранениеСправочно)) КАК Склады
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ 
	|		СкладскиеПомещения.Владелец,
	|		СкладскиеПомещения.Ссылка,
	|		ВЫБОР
	|			КОГДА СкладскиеПомещения.ИспользоватьАдресноеХранение
	|					ИЛИ СкладскиеПомещения.ИспользоватьАдресноеХранениеСправочно
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	|	ГДЕ
	|		(СкладскиеПомещения.ИспользоватьАдресноеХранение
	|				ИЛИ СкладскиеПомещения.ИспользоватьАдресноеХранениеСправочно)) КАК Влож
	|
	|УПОРЯДОЧИТЬ ПО
	|	Влож.Склад.Наименование,
	|	Влож.Помещение.Наименование
	|ИТОГИ ПО
	|	Склад";
	
	
	ВыборкаСклады = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтрокаСклад = Неопределено;
	
	Пока ВыборкаСклады.Следующий() Цикл
		
		СтрокаСклад 					= Дерево.Строки.Добавить();
		СтрокаСклад.Склад				= ВыборкаСклады.Склад;
		СтрокаСклад.Представление 		= ВыборкаСклады.Склад;
		СтрокаСклад.ПометкаУдаления 	= ?(ВыборкаСклады.Склад.ПометкаУдаления,3,2);
		
		ВыборкаПомещения = ВыборкаСклады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПомещения.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаПомещения.Помещение) Тогда	
				СтрокаПомещение 				= СтрокаСклад.Строки.Добавить();
				СтрокаПомещение.Склад 			= ВыборкаПомещения.Склад;
				СтрокаПомещение.Помещение 		= ВыборкаПомещения.Помещение;
				СтрокаПомещение.Представление 	= ВыборкаПомещения.Помещение;			
				СтрокаПомещение.ПометкаУдаления = ?(ВыборкаПомещения.Помещение.ПометкаУдаления,3,2);
			КонецЕсли;
			                           
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "СкладыПомещения");	
КонецПроцедуры

