////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ЗакрытаФормаУзлаПланаОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоКассамПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСкладамПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоДоговорамЭквайрингаПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоВидамЦенНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	НастройкаФильтровРегистрации = Элементы.Группа.ПодчиненныеЭлементы.НастройкаФильтровРегистрации;
	НастройкиОтборов = НастройкаФильтровРегистрации.ПодчиненныеЭлементы.НастройкиОтборов;
	
	ОтборПоОрганизациям 		= НастройкиОтборов.ПодчиненныеЭлементы.ОтборПоОрганизациям;
	ОтборПоСкладам				= НастройкиОтборов.ПодчиненныеЭлементы.ОтборПоСкладам;
	ОтборПоКассам				= НастройкиОтборов.ПодчиненныеЭлементы.ОтборПоКассам;
	ОтборПоВидамЦен				= НастройкиОтборов.ПодчиненныеЭлементы.ОтборПоВидамЦенНоменклатуры;
	ОтборПоДоговорамЭквайринга	= НастройкиОтборов.ПодчиненныеЭлементы.ОтборПоДоговорамЭквайринга;
	
	ОтборПоОрганизациям.Видимость			= Объект.ИспользоватьОтборПоОрганизациям;
	ОтборПоСкладам.Видимость				= Объект.ИспользоватьОтборПоСкладам;
	ОтборПоКассам.Видимость					= Объект.ИспользоватьОтборПоКассам;
	ОтборПоВидамЦен.Видимость				= Объект.ИспользоватьОтборПоВидамЦенНоменклатуры;
	ОтборПоДоговорамЭквайринга.Видимость	= Объект.ИспользоватьОтборПоДоговорамЭквайринга;
	
КонецПроцедуры
