#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст=
	 "ВЫБРАТЬ ПЕРВЫЕ 1
	 |	КачестваТоваров.Ссылка
	 |ИЗ
	 |	Справочник.КачестваТоваров КАК КачестваТоваров
	 |ГДЕ
	 |	КачестваТоваров.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый)
	 |	И КачестваТоваров.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		ТекстСообщения = НСтр("ru = 'Может быть только одно качество с градацией качества""Новый"".'");	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Отказ = Истина;
	КонецЕсли;	
		
КонецПроцедуры


#КонецЕсли