
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Партнер = Параметры.Партнер;
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Контрагент",  Контрагент);
	
	ДоступнаФильтрацияПоДоговору = Параметры.Свойство("Договор", Договор);
	
	РасшифровкаПоЗаказам = Параметры.РасшифровкаПоЗаказам;
	Если ЗначениеЗаполнено(Договор) Тогда
		ВидРасшифровкиПоПартнерамДоговорам = 4;
	ИначеЕсли Параметры.РасшифровкаПоДоговорам Тогда
		ВидРасшифровкиПоПартнерамДоговорам = 3;
	ИначеЕсли ЗначениеЗаполнено(Партнер) Тогда
		ВидРасшифровкиПоПартнерамДоговорам = 2;
	ИначеЕсли Параметры.РасшифровкаПоПартнерам Тогда
		ВидРасшифровкиПоПартнерамДоговорам = 1;
	Иначе
		ВидРасшифровкиПоПартнерамДоговорам = 0;
	КонецЕсли; 
	
	Элементы.Договор.Видимость	 = ДоступнаФильтрацияПоДоговору;
	Элементы.Договор.Доступность = ВидРасшифровкиПоПартнерамДоговорам = 4;
	Элементы.Партнер.Доступность = ВидРасшифровкиПоПартнерамДоговорам = 2;
	
	Если НЕ ДоступнаФильтрацияПоДоговору Тогда
		Элементы.ВидРасшифровкиПоПартнерамДоговорам.СписокВыбора.Удалить(4);
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВидРасшифровкиПоПартнерамДоговорамПриИзменении(Элемент)
		
	Элементы.Партнер.Доступность = ВидРасшифровкиПоПартнерамДоговорам = 2;
	Элементы.Договор.Доступность = ВидРасшифровкиПоПартнерамДоговорам = 4;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Применить(Команда)
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если ВидРасшифровкиПоПартнерамДоговорам = 2 Тогда
		Если Партнер.Пустая() Тогда
			Текст = НСтр("ru = 'Поле ""Фильтр по партнеру"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"Партнер",
				,
				Отказ
			);
		КонецЕсли; 
	Иначе		
		Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	КонецЕсли; 
	
	Если ВидРасшифровкиПоПартнерамДоговорам = 4 Тогда
		Если Договор.Пустая() Тогда
			Текст = НСтр("ru = 'Поле ""Фильтр по договору"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"Договор",
				,
				Отказ
			);
		КонецЕсли; 
	Иначе		
		Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		РасшифровкаПоПартнерам = ВидРасшифровкиПоПартнерамДоговорам = 1;
		РасшифровкаПоДоговорам = ВидРасшифровкиПоПартнерамДоговорам = 3;
		
		Закрыть(Новый Структура("РасшифровкаПоЗаказам, РасшифровкаПоПартнерам, РасшифровкаПоДоговорам, Партнер, Договор",
							 	 РасшифровкаПоЗаказам, РасшифровкаПоПартнерам, РасшифровкаПоДоговорам, Партнер, Договор));
	КонецЕсли;	 
	
КонецПроцедуры
