
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	Если Параметры.Свойство("Организация") Тогда
		
		ПоВсемОрганизациям = Параметры.Организация = Справочники.Организации.ПустаяСсылка();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Организация",
			Параметры.Организация,
			?(ПоВсемОрганизациям,ВидСравненияКомпоновкиДанных.НеРавно, ВидСравненияКомпоновкиДанных.Равно),
			,
			Истина);
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПериодРегистрации") Тогда
		
		ЭлементОтбораДатаНач = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДатаНач.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		ЭлементОтбораДатаНач.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбораДатаНач.ПравоеЗначение = НачалоМесяца(Параметры.ПериодРегистрации);
		ЭлементОтбораДатаНач.Использование = Истина;
		
		ЭлементОтбораДатаКон = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДатаКон.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		ЭлементОтбораДатаКон.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбораДатаКон.ПравоеЗначение = КонецМесяца(Параметры.ПериодРегистрации);
		ЭлементОтбораДатаКон.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры



