

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Документ",ПараметрКоманды[0]);
	ВыбраннаяНоменклатура = ОткрытьФормуМодально("Обработка.ПечатьТТН.Форма.Подбор",СтруктураПараметров);
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьТТН",
			"ТТН",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			ВыбраннаяНоменклатура
		);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()         





