Функция ПолучитьСписокНоменклатуры()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.НомерСтроки,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика,
	|	РеализацияТоваровУслугТовары.Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	СписокНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Документ = ЭтаФОрма.Параметры.Документ;
	ПолучитьСписокНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
	СтрокаТаблицы = СписокНоменклатуры.НайтиПоИдентификатору(Элементы.СписокНоменклатуры.ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
	СписокНоменклатуры.Удалить(СтрокаТаблицы);	

КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ВыбраннаяНоменклатураКоличество" тогда
		КОличество = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные.Количество;
		Если ВвестиЧисло(КОличество,"Введите количество",10,2) тогда
			Элементы.ВыбраннаяНоменклатура.ТекущиеДанные.Количество = КОличество;	
		КонецЕсли;
	Иначе
	НоваяСтрока = СписокНоменклатуры.Добавить();
	СтрокаТаблицы = ВыбраннаяНоменклатура.НайтиПоИдентификатору(Элементы.ВыбраннаяНоменклатура.ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
	ВыбраннаяНоменклатура.Удалить(СтрокаТаблицы);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВправо(Команда)
	Если СписокНоменклатуры.Количество()=0 тогда
		Возврат;
	КонецЕсли;
		
	НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
	СтрокаТаблицы = СписокНоменклатуры.НайтиПоИдентификатору(Элементы.СписокНоменклатуры.ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
	СписокНоменклатуры.Удалить(СтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВлево(Команда)
	Если ВыбраннаяНоменклатура.Количество()=0 тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = СписокНоменклатуры.Добавить();
	СтрокаТаблицы = ВыбраннаяНоменклатура.НайтиПоИдентификатору(Элементы.ВыбраннаяНоменклатура.ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
	ВыбраннаяНоменклатура.Удалить(СтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВправоВсе(Команда)
	Для каждого ТекСтр из СписокНоменклатуры цикл
		НоваяСтрока = ВыбраннаяНоменклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтр);
	КонецЦикла;
	СписокНоменклатуры.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВлевоВсе(Команда)
	Для каждого ТекСтр из ВыбраннаяНоменклатура цикл
		НоваяСтрока = СписокНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтр);
	КонецЦикла;
    ВыбраннаяНоменклатура.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Упаковать();
	ЭтаФорма.Закрыть(МассивСтрок);
КонецПроцедуры


Процедура Упаковать()
	МассивСтрок = ЗначениеВСтрокуВнутр(ВыбраннаяНоменклатура.Выгрузить(,"НомерСтроки,Количество"));
КонецПроцедуры





