
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.НоменклатураБрак) Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.НоменклатураБрак, Новый Структура("Качество"));
		Запись.ГрадацияКачества = Реквизиты.Качество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураБракПриИзменении(Элемент)
	СтруктураРеквизитов = Новый Структура("Качество");
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.НоменклатураБрак, СтруктураРеквизитов);
	Запись.ГрадацияКачества = Реквизиты.Качество;
КонецПроцедуры



