#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП
//	Возвращаемое значание:
//		Массив - имена блокируемых реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ЕдиницаИзмерения");
	
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаборыУпаковок.Ссылка,
	|	НаборыУпаковок.ПометкаУдаления,
	|	ПРЕДСТАВЛЕНИЕ(НаборыУпаковок.Наименование) КАК Представление
	|ИЗ
	|	Справочник.НаборыУпаковок КАК НаборыУпаковок
	|ГДЕ
	|	НаборыУпаковок.Ссылка <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаборыУпаковок.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры);
	
	Пока Выборка.Следующий() Цикл
		Значение = Новый Структура("Значение,ПометкаУдаления",Выборка.Ссылка,Выборка.ПометкаУдаления);
		ДанныеВыбора.Добавить(Значение,Выборка.Представление);
	КонецЦикла;
	
КонецПроцедуры


#КонецЕсли