
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ХозяйственнаяОперация = Неопределено;
	
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("ВариантРаспределенияРасходов")
		 И Параметры.Отбор.ВариантРаспределенияРасходов = "НеНаРасходыБудущихПериодов" Тогда
		 
			Параметры.Отбор.Удалить("ВариантРаспределенияРасходов");
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор,
				"ВариантРаспределенияРасходов",
				Перечисления.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов,
				ВидСравненияКомпоновкиДанных.НеРавно,
				, // Представление
				Истина // Использование
			);
			
		КонецЕсли;
		Если Параметры.Отбор.Свойство("ХозяйственнаяОперация")
		 И ЗначениеЗаполнено(Параметры.Отбор.ХозяйственнаяОперация) Тогда
			ХозяйственнаяОперация = Параметры.Отбор.ХозяйственнаяОперация;
		КонецЕсли;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Список.Параметры.УстановитьЗначениеПараметра("БезОграниченияИспользования", Не ЗначениеЗаполнено(ХозяйственнаяОперация));
	
	ФормироватьФинансовыйРезультат = ПолучитьФункциональнуюОпцию("ФормироватьФинансовыйРезультат");
	
КонецПроцедуры

