#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// СтандартныеПодсистемы.ВариантыОтчетов

Функция ФункциональныеОпцииВариантовОтчетов() Экспорт
	
	ФункциональныеОпцииВариантовОтчетов = ВариантыОтчетовУТПереопределяемый.ИнициализироватьФункциональныеОпцииВариантовОтчетов();
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьФункциональнуюОпциюВариантаОтчета(ФункциональныеОпцииВариантовОтчетов, 
		"ПоГруппамЦенНоменклатуры", "ИспользоватьЦеновыеГруппы");
	
	Возврат ФункциональныеОпцииВариантовОтчетов;
	
КонецФункции
// Конец СтандартныеПодсистемы.ВариантыОтчетов
#КонецЕсли