&НаКлиенте
Процедура ДобавитьКоммерческоеПредложение(Команда)
	Перем КоммерческоеПредложение; 	
	КоммерческоеПредложение =  ПолучитьДокумент();
	Если не ЗначениеЗаполнено(КоммерческоеПредложение) Тогда
		Возврат;
	КонецЕсли;
 	ЗаполнитьТЧДокумента(КоммерческоеПредложение);
КонецПроцедуры


&НаКлиенте
Процедура ВставитьКоммерческоеПредложение(Команда)
	Перем КоммерческоеПредложение; 	
	КоммерческоеПредложение =  ПолучитьДокумент();
	Если не ЗначениеЗаполнено(КоммерческоеПредложение) Тогда
		Возврат;
	КонецЕсли;
	ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	Объект.Товары.Очистить();
	ЗаполнитьТЧДокумента(КоммерческоеПредложение);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧДокумента(КоммерческоеПредложение)
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьТабличнуюЧастьПоКомерческому(КоммерческоеПредложение);
	ЗначениеВРЕквизитФормы(ОбъектЗначение,"Объект");
КонецФункции	
&НаКлиенте
Функция ПолучитьДокумент()

	ФормаЗаказы = ПолучитьФорму("Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаВыбора",);

	ФормаЗаказы.Заголовок = "Выберите коммерческое предложение клиенту для заполнения";
	ФормаЗаказы.параметры.РежимВыбора = Истина;
	
	КоммерческоеПредложение = ФормаЗаказы.ОткрытьМодально();
	Возврат КоммерческоеПредложение;
КонецФункции	