
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	СделкаИсточник = ПараметрыВыполненияКоманды.Источник.Объект;
	УникальныйИдентификатор = ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор;
	
	ОткрытьФорму(
		"Справочник.СделкиСКлиентами.Форма.ОкружениеСделки",
		Новый Структура("АдресУчастники,Партнер",ПоместитьВоВременноеХранилище(СделкаИсточник.ПартнерыИКонтактныеЛица,УникальныйИдентификатор),СделкаИсточник.Партнер),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно
	);

КонецПроцедуры
