
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Отчет.ВыбранныйВариант = НаименованиеТекущегоВарианта;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = ВозможнаРасшифровка(ТипЗнч(Расшифровка));
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ВозможнаРасшифровка(ТипРасшифровки)
	Возврат Справочники.ТипВсеСсылки().СодержитТип(ТипРасшифровки);
КонецФункции

