
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Управление элементами формы

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ЭтоКомиссионныйТовар = (Объект.ТипЗапасов = Перечисления.ТипыЗапасов.КомиссионныйТовар);
	ЭтоПередачаНаКомиссию = (Объект.СпособПередачиТоваров = Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию);
	
	Элементы.Комитент.Видимость = ЭтоКомиссионныйТовар ИЛИ ЭтоПередачаНаКомиссию;
	Элементы.Контрагент.Видимость = ЭтоКомиссионныйТовар ИЛИ ЭтоПередачаНаКомиссию;
	Элементы.Соглашение.Видимость = ЭтоКомиссионныйТовар;
	Элементы.Договор.Видимость = ЭтоКомиссионныйТовар;
	Элементы.Валюта.Видимость = ЭтоКомиссионныйТовар ИЛИ ЭтоПередачаНаКомиссию;
	
	Элементы.ТипЗапасов.Видимость = Не Объект.РеализацияЗапасовДругойОрганизации;
	Элементы.СпособПередачи.Видимость = Объект.РеализацияЗапасовДругойОрганизации;
	Элементы.ВидЗапасовВладельца.Видимость = Объект.РеализацияЗапасовДругойОрганизации;
	Элементы.РеализацияЗапасовДругойОрганизации.Видимость = Объект.РеализацияЗапасовДругойОрганизации;
	
	// Обособленный учет товаров.
	Элементы.Поставщик.Видимость = Не ЭтоКомиссионныйТовар И Не ЭтоПередачаНаКомиссию;
	Если Объект.Предназначение = Перечисления.ТипыПредназначенияВидовЗапасов.ПредназначенДляСделки Тогда
		Элементы.СтраницыАналитика.ТекущаяСтраница = Элементы.СтраницаСделка;
	ИначеЕсли Объект.Предназначение = Перечисления.ТипыПредназначенияВидовЗапасов.ПредназначенДляМенеджера Тогда
		Элементы.СтраницыАналитика.ТекущаяСтраница = Элементы.СтраницаМенеджер;
	ИначеЕсли Объект.Предназначение = Перечисления.ТипыПредназначенияВидовЗапасов.ПредназначенДляПодразделения Тогда
		Элементы.СтраницыАналитика.ТекущаяСтраница = Элементы.СтраницаПодразделение;
	ИначеЕсли Объект.Предназначение = Перечисления.ТипыПредназначенияВидовЗапасов.ПредназначенДляЗаказа Тогда
		Элементы.СтраницыАналитика.ТекущаяСтраница = Элементы.СтраницаЗаказ;
	Иначе
		Элементы.СтраницыАналитика.ТекущаяСтраница = Элементы.СтраницаНеВедется;
	КонецЕсли;
	
КонецПроцедуры
