////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ДатаИзготовления.Формат 			   = Параметры.ФорматДаты;
	Элементы.ДатаИзготовления.ФорматРедактирования = Параметры.ФорматДаты;
	
	ГоденДо = Параметры.ГоденДо;
	
	Если Не ЗначениеЗаполнено(ГоденДо) Тогда
		ГоденДо = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	ЕдиницаИзмеренияСрокаГодности = НСтр("ru = 'г.'");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ГоденДоВыбор(Элемент, ВыбраннаяДата)
	Закрыть(ГоденДо);
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзготовленияПриИзменении(Элемент)
	РасчитатьГоденДо();
КонецПроцедуры

&НаКлиенте
Процедура СрокГодностиПриИзменении(Элемент)
	РасчитатьГоденДо();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияСрокаГодностиПриИзменении(Элемент)
	РасчитатьГоденДо();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ГоденДо);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее
&НаКлиенте

Процедура РасчитатьГоденДо()
	Если Не ЗначениеЗаполнено(ДатаИзготовления)
		Или Не ЗначениеЗаполнено(СрокГодности) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕдиницаИзмеренияСрокаГодности = НСтр("ru = 'г.'") Тогда
		ГоденДо = ДатаИзготовления + СрокГодности * 31536000;
	ИначеЕсли ЕдиницаИзмеренияСрокаГодности = НСтр("ru = 'мес.'") Тогда
		ГоденДо = ДобавитьМесяц(ДатаИзготовления,СрокГодности) - 86400;
	ИначеЕсли ЕдиницаИзмеренияСрокаГодности = НСтр("ru = 'дн.'") Тогда
		ГоденДо = ДатаИзготовления + СрокГодности * 86400;
	ИначеЕсли ЕдиницаИзмеренияСрокаГодности = НСтр("ru = 'ч.'") Тогда
		ГоденДо = ДатаИзготовления + СрокГодности * 3600;
	КонецЕсли;
	
КонецПроцедуры


