
&НаСервере
Функция ПолучитьСписокПохожихЭлементов()
	
	Возврат Справочники.АК_Объекты.ПолучитьСписокПохожихОбъектов(Объект);
	
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Проекты.Параметры.УстановитьЗначениеПараметра("АК_Объект", Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		//
		стрВопрос = "";
		
		//
		мПохожиеЭлементы = ПолучитьСписокПохожихЭлементов();
		
		//
		Для Каждого ЭлементМассива Из мПохожиеЭлементы Цикл
			стрВопрос = стрВопрос + "• " + ЭлементМассива + Символы.ПС;
		КонецЦикла;	
		
		//
		Если ЗначениеЗаполнено(стрВопрос) Тогда
			
			//
			стрВопрос = "Найдены похожие объекты: " + Символы.ПС + стрВопрос + "Продолжить создание нового?";
			
			//
			Ответ = КодВозвратаДиалога.Нет;
			Ответ = Вопрос(стрВопрос, РежимДиалогаВопрос.ДаНет,,Ответ);
			
			//
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
			
		КонецЕсли;	
			
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры
