////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьНастройкуПриЧтенииСоздании(ЭтаФорма);
	Иначе
		Элементы.НастройкаУказанияСерийПриОтгрузке.ТолькоПросмотр = Истина;
	КонецЕсли;
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьНастройкуПриЧтенииСоздании(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.УказыватьПриПланированииОтгрузки = (НастройкаУказанияСерийПриОтгрузке = 1);
	Объект.УказыватьПриПланированииОтбора   = (НастройкаУказанияСерийПриОтгрузке = 2);
	Объект.УказыватьПоФактуОтбора           = (НастройкаУказанияСерийПриОтгрузке = 3);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ТипПолитикиПриИзменении(Элемент)
	Если Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий") Тогда
		Объект.УчетСерийПоFEFO               = Ложь;
		Объект.УчитыватьОстаткиСерий         = Ложь;
		Если Объект.УказыватьПриОтгрузке Тогда
			НастройкаУказанияСерийПриОтгрузке = 3;
		Иначе
			НастройкаУказанияСерийПриОтгрузке = 0;
		КонецЕсли;
		
		Объект.УказыватьПриПересчетеТоваров               = Ложь;
		
	ИначеЕсли Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий") Тогда
		Объект.УчетСерийПоFEFO               = Ложь;
		Объект.УчитыватьОстаткиСерий         = Ложь;
		
		Объект.УказыватьПриОтгрузке                       = Ложь;
		Объект.УказыватьПриОтгрузкеКлиенту                = Ложь;
		Объект.УказыватьПриОтгрузкеВРозницу               = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Ложь;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Ложь;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Ложь;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Ложь;
		
		НастройкаУказанияСерийПриОтгрузке = 0;
		
		Объект.УказыватьПриПриемке                           = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента        = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика               = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению              = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов        = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию     = Истина;
		
		Объект.УказыватьПриОтраженииИзлишковНедостачПорчи = Истина;
		Объект.УказыватьПриПересчетеТоваров               = Ложь;
		
		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;
	ИначеЕсли Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий") Тогда
		Объект.УчетСерийПоFEFO               = Ложь;
		Объект.УчитыватьОстаткиСерий         = Истина;
		
		Объект.УказыватьПриОтгрузке                       = Истина;
		Объект.УказыватьПриОтгрузкеКлиенту                = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу               = Истина;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Истина;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Истина;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Истина;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Истина;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Истина;
		
		Объект.УказыватьПриПриемке                           = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента        = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика               = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению              = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов        = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию     = Истина;
		
		Объект.УказыватьПриОтраженииИзлишковНедостачПорчи = Истина;
		Объект.УказыватьПриПересчетеТоваров               = Истина;
		
		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;
		
	ИначеЕсли Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий") Тогда
		Объект.УчетСерийПоFEFO               = Истина;
		Объект.УчитыватьОстаткиСерий         = Истина;
		НастройкаУказанияСерийПриОтгрузке    = 2;
		
		
		Объект.УказыватьПриОтгрузке                       = Истина;
		Объект.УказыватьПриОтгрузкеКлиенту                = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу               = Истина;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Истина;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Истина;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Истина;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Истина;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Истина;
		
		Объект.УказыватьПриПриемке                           = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента        = Истина;
		Объект.УказыватьПриПриемкеОтПоставщика               = Истина;
		Объект.УказыватьПриПриемкеПоПеремещению              = Истина;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию     = Истина;
		Объект.УказыватьПриПриемкеСобранныхКомплектов        = Истина;
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки = Истина;
		
		Объект.УказыватьПриОтраженииИзлишковНедостачПорчи = Истина;
		Объект.УказыватьПриПересчетеТоваров               = Истина;
		
		Объект.УказыватьПриПеремещенииМеждуПомещениями = Истина;
		
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьПриПриемкеПриИзменении(Элемент)
	Если Не Объект.УказыватьПриПриемке Тогда
		
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки = Ложь;
		Объект.УказыватьПриПриемкеОтПоставщика               = Ложь;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента        = Ложь;
		Объект.УказыватьПриПриемкеПоПеремещению              = Ложь;
		Объект.УказыватьПриПриемкеПоПрочемуОприходованию     = Ложь;
		Объект.УказыватьПриПриемкеСобранныхКомплектов        = Ложь;
		
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьПриОтгрузкеПриИзменении(Элемент)
	Если Не Объект.УказыватьПриОтгрузке Тогда
		
		Объект.УказыватьПриОтгрузкеКлиенту                = Ложь;
		Объект.УказыватьПриОтгрузкеВРозницу               = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Ложь;
		Объект.УказыватьПриОтгрузкеНаВнутренниеНужды      = Ложь;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Ложь;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Ложь;
		
		НастройкаУказанияСерийПриОтгрузке = 0;
	Иначе
		НастройкаУказанияСерийПриОтгрузке = 3;
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Результат = ОткрытьФормуМодально("Справочник.ПолитикиУчетаСерий.Форма.РазблокированиеРеквизитов");
		Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
			
			ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
			
			Элементы.НастройкаУказанияСерийПриОтгрузке.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНастройкуПриЧтенииСоздании(Форма)
	
	Если Форма.Объект.УказыватьПриПланированииОтгрузки Тогда
		Форма.НастройкаУказанияСерийПриОтгрузке = 1;
	ИначеЕсли Форма.Объект.УказыватьПриПланированииОтбора Тогда
		Форма.НастройкаУказанияСерийПриОтгрузке = 2;
	ИначеЕсли Форма.Объект.УказыватьПоФактуОтбора Тогда
		Форма.НастройкаУказанияСерийПриОтгрузке = 3;
	КонецЕсли;
	
	УстановитьДоступность(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	Если Форма.Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий") Тогда
		
		Форма.Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность        = Форма.Объект.УказыватьПриПриемке;
		Форма.Элементы.УказыватьПриПриемкеОтПоставщика.Доступность               = Форма.Объект.УказыватьПриПриемке;
		Форма.Элементы.УказыватьПриПриемкеПоПеремещению.Доступность              = Форма.Объект.УказыватьПриПриемке;
		Форма.Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность        = Форма.Объект.УказыватьПриПриемке;
		Форма.Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность = Форма.Объект.УказыватьПриПриемке;
		Форма.Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность     = Форма.Объект.УказыватьПриПриемке;
		
		Форма.Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Форма.Объект.УказыватьПриОтгрузке;
		Форма.Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Форма.Объект.УказыватьПриОтгрузке;
		Форма.Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Форма.Объект.УказыватьПриОтгрузке;
		Форма.Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Форма.Объект.УказыватьПриОтгрузке;
		Форма.Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Форма.Объект.УказыватьПриОтгрузке;
		Форма.Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Форма.Объект.УказыватьПриОтгрузке;
		Форма.Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Форма.Объект.УказыватьПриОтгрузке;
		
		Форма.Элементы.УказыватьПриОтраженииИзлишковНедостачПорчи.Доступность = Истина;
		Форма.Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Истина;
		Форма.Элементы.УказыватьПриПриемке.Доступность                        = Истина;
		Форма.Элементы.УказыватьПриОтгрузке.Доступность                       = Истина;
		Форма.Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность          = Ложь;
		
	ИначеЕсли Форма.Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий") Тогда
		
		Форма.Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность        = Ложь;
		Форма.Элементы.УказыватьПриПриемкеОтПоставщика.Доступность               = Ложь;
		Форма.Элементы.УказыватьПриПриемкеПоПеремещению.Доступность              = Ложь;
		Форма.Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность        = Ложь;
		Форма.Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность = Ложь;
		Форма.Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность     = Ложь;
		
		Форма.Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Ложь;
		
		Форма.Элементы.УказыватьПриОтраженииИзлишковНедостачПорчи.Доступность = Ложь;
		Форма.Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Ложь;
		Форма.Элементы.УказыватьПриПриемке.Доступность                        = Ложь;
		Форма.Элементы.УказыватьПриОтгрузке.Доступность                       = Ложь;
		Форма.Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность          = Ложь;
		
	ИначеЕсли Форма.Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий")
		Или Форма.Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий") Тогда
		
		Форма.Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность        = Ложь;
		Форма.Элементы.УказыватьПриПриемкеОтПоставщика.Доступность               = Ложь;
		Форма.Элементы.УказыватьПриПриемкеПоПеремещению.Доступность              = Ложь;
		Форма.Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность        = Ложь;
		Форма.Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность = Ложь;
		Форма.Элементы.УказыватьПриПриемкеПоПрочемуОприходованию.Доступность     = Ложь;
		
		Форма.Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеНаВнутренниеНужды.Доступность      = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Ложь;
		Форма.Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Ложь;
		
		Форма.Элементы.УказыватьПриОтраженииИзлишковНедостачПорчи.Доступность = Ложь;
		Форма.Элементы.УказыватьПриПеремещенииМеждуПомещениями.Доступность    = Ложь;
		Форма.Элементы.УказыватьПриПриемке.Доступность                        = Ложь;
		Форма.Элементы.УказыватьПриОтгрузке.Доступность                       = Ложь;
		
		Форма.Элементы.НастройкаУказанияСерийПриОтгрузке.Доступность =
			(Форма.Объект.ТипПолитики = ПредопределенноеЗначение("Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий"));
		
	КонецЕсли;
	
КонецПроцедуры
