#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Стр Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.ТипСуммы) Тогда
			Стр.ТипСуммы = ТипСуммыПоСтатьеДДС(Стр.Договор, Стр.СтатьяАналитики);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТипСуммыПоСтатьеДДС(Договор,СтатьяДДС)
	
	Результат = Неопределено;
	Если Договор.СтатьяДДСПоступленияВыдачи = СтатьяДДС 
		ИЛИ Договор.СтатьяДДСОсновногоДолга = СтатьяДДС Тогда
		Результат = Перечисления.ТипСуммыГрафикаКредитовИДепозитов.ОсновнойДолг;
	ИначеЕсли Договор.СтатьяДДСПроцентов = СтатьяДДС Тогда
		Результат = Перечисления.ТипСуммыГрафикаКредитовИДепозитов.Проценты;
	ИначеЕсли Договор.СтатьяДДСКомиссии = СтатьяДДС Тогда
		Результат = Перечисления.ТипСуммыГрафикаКредитовИДепозитов.Комиссия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли