
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантыРаспределенияРасходов")
	 И ТипЗнч(Параметры.ВариантыРаспределенияРасходов) = Тип("Массив")  Тогда
	 
	 	ВариантыРаспределенияРасходов = Новый Массив;
		Для Каждого ИмяВарианта Из Параметры.ВариантыРаспределенияРасходов Цикл
			ВариантыРаспределенияРасходов.Добавить(Перечисления.ВариантыРаспределенияРасходов[ИмяВарианта]);
		КонецЦикла;
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВариантРаспределенияРасходов", Новый ФиксированныйМассив(ВариантыРаспределенияРасходов));
		
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(ПараметрВыбора);
		
		Элементы.СтатьяРасходов.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	КонецЕсли;
	
	Если Параметры.Свойство("ХозяйственнаяОперация") Тогда
		ХозяйственнаяОперация = Параметры.ХозяйственнаяОперация;
	КонецЕсли;
		
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Параметр = Новый Структура("СтатьяРасходов, АналитикаРасходов", СтатьяРасходов, АналитикаРасходов);
		Закрыть(Параметр);
	КонецЕсли;
	
КонецПроцедуры

