
&НаКлиенте
// Процедура - обработчик события "ОбработкаКоманды".
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьОбщихФорм",
		    "ОтчетКомиссионераСписание",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			Неопределено // ПараметрыПечати
		);
	КонецЕсли;

КонецПроцедуры // ОбработкаКоманды()
