#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Функция ПолучитьДатыЗаказаПоКалендарю. Возвращает две ближайшие даты заказа по календарю работы.
//
//	Параметры:
//		"КалендарьЗаказа" - СправочникСсылка.Календари, Календарь по кторому необходимо рассчитать даты заказа.
//		"НачалоПериода"   - Дата, Дата, с которой начинается поиск дат заказа.
//
//	Возвращаемое значение: Структура со следующими полями:
//		"ДатаЗаказа"           - Ближайшая рабочая дата по календарю.
//		"ДатаСледующегоЗаказа" - Следующая рабочая дата за ближайшей.

Функция ПолучитьДатыЗаказаПоКалендарю(КалендарьЗаказа, НачалоПериода) Экспорт
	
	КлючевыеДаты = Новый Структура("ДатаЗаказа, ДатаСледующегоЗаказа", Дата(1, 1, 1), Дата(1, 1, 1));
	Если КалендарьЗаказа.Пустая() Тогда
		КлючевыеДаты.ДатаЗаказа           = НачалоПериода;
		КлючевыеДаты.ДатаСледующегоЗаказа = НачалоПериода + 86400;
	Иначе
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
			|	КалендарныйГрафик.ДатаГрафика КАК ДатаЗаказа
			|ИЗ
			|	РегистрСведений.КалендарныеГрафики КАК КалендарныйГрафик
			|ГДЕ
			|	КалендарныйГрафик.Календарь     =  &КалендарьЗаказа
			|	И КалендарныйГрафик.ДатаГрафика >= &НачалоПериода
			|	И КалендарныйГрафик.ДеньВключенВГрафик
			|
			|УПОРЯДОЧИТЬ ПО
			|	КалендарныйГрафик.ДатаГрафика";
		Запрос.УстановитьПараметр("КалендарьЗаказа", КалендарьЗаказа);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			КлючевыеДаты.ДатаЗаказа = Выборка.ДатаЗаказа;
		КонецЕсли;
		
		Если Выборка.Следующий() Тогда
			КлючевыеДаты.ДатаСледующегоЗаказа = Выборка.ДатаЗаказа;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КлючевыеДаты;
		
КонецФункции //ПолучитьДатыЗаказаПоКалендарю()

//Функция ПолучитьКурсВалютыУправленческогоУчета. Возвращает курс валюты управленческого учета с учетом ее кратности.
//
//	Параметры:
//		"Дата" - Дата, Дата на которую необходимо получитьь курс валюты.
//
//	Возвращаемое значение: Число, Коэффициент пересчета в валюту управленческого учета.

//Возращает коэффициент для пересчета в валюту управленческого учета.
Функция ПолучитьКурсВалютыУправленческогоУчета(Дата) Экспорт
	
	Отбор                   = Новый Структура("Валюта", Константы.ВалютаУправленческогоУчета.Получить());
	СтруктураКурса          = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Отбор);
	КоэффициентПересчета    = СтруктураКурса.Курс * СтруктураКурса.Кратность;
	Возврат КоэффициентПересчета;
	
КонецФункции //ПолучитьКурсВалютыУправленческогоУчета()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ




#КонецЕсли