///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОписаниеОшибки") Тогда
		ОписаниеОшибки = Параметры.ОписаниеОшибки;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура НастроитьПодключение(Команда)
	ОткрытьФормуМодально("Обработка.ИнтеграцияС1СДокументооборот.Форма.АвторизацияВ1СДокументооборот");
	Закрыть();
КонецПроцедуры
