////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
//  Для автоматической подготовки содержимого процедуры следует
// воспользоваться инструментами разработчика для подсистемы
// Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа().
//
//  ПараметрыОбновления - Структура со свойствами:
//
//                        ОбновлятьИзмененныеПрофили - Булево (начальное значение Истина).
//
//                        ЗапретитьИзменениеПрофилей - Булево (начальное значение Истина),
//                        если установить Ложь, тогда поставляемые профили будут открываться
//                        в режиме ТолькоПросмотр.
//
//                        ОбновлятьГруппыДоступа - Булево (начальное значение Истина).
//
//                        ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево (начальное
//                        значение Ложь), если установить Истина, то настройки значений,
//                        сделанные администратором по виду доступа, который удален из
//                        профиля, будут удалены из группы доступа.
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	УправлениеДоступомУТ.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	
КонецПроцедуры

// Заполняет свойства видов доступа, добавленных прикладным разработчиком
// в план видов характеристик ВидыДоступа, как предопределенные элементы.
//
// Параметры:
//  Свойства - Структура со свойствами,
//             описание которых см. в комментарии к функции
//             ПланыВидовХарактеристик.ВидыДоступа.СвойстваВидовДоступа().
//
Процедура ЗаполнитьСвойстваВидаДоступа(Знач Свойства) Экспорт

	// СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	Если Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Пользователи Тогда
		
		Свойства.Таблицы.Добавить("Справочник.ГруппыИсполнителейЗадач");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
		Свойства.ВидДоступаСОднойГруппойЗначенияДоступа       = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	// Конец СтандартныеПодсистемы.БизнесПроцессыИЗадачи
		
	// СтандартныеПодсистемы.РаботаСПочтовымиСообщениями
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.УчетныеЗаписиЭлектроннойПочты Тогда
		
		Свойства.Таблицы.Добавить("Справочник.УчетныеЗаписиЭлектроннойПочты");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	// Конец СтандартныеПодсистемы.РаботаСПочтовымиСообщениями
		
	// СтандартныеПодсистемы.Свойства
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ДополнительныеСведения Тогда

		Свойства.Таблицы.Добавить("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Организации
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Организации Тогда

		Свойства.Таблицы.Добавить("Справочник.Организации");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	// Конец СтандартныеПодсистемы.Организации
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ПапкиФайлов Тогда

		Свойства.Таблицы.Добавить("Справочник.ПапкиФайлов");
		Свойства.ВидДоступаЧерезПраваПоЗначениямДоступа = Истина;
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	// Конец СтандартныеПодсистемы.РаботаСФайлами	
	
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыНоменклатуры Тогда

		Свойства.Таблицы.Добавить("Справочник.Номенклатура");
		Свойства.Таблицы.Добавить("Справочник.ВидыНоменклатуры");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
		Свойства.ВидДоступаСОднойГруппойЗначенияДоступа       = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыПартнеров Тогда
		
		Свойства.Таблицы.Добавить("Справочник.Партнеры");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
		Свойства.ВидДоступаСОднойГруппойЗначенияДоступа       = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;

	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыФизическихЛиц Тогда

		Свойства.Таблицы.Добавить("Справочник.ФизическиеЛица");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Ложь;
		Свойства.ВидДоступаСОднойГруппойЗначенияДоступа       = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Кассы Тогда

		Свойства.Таблицы.Добавить("Справочник.Кассы");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;

	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.КассыККМ Тогда

		Свойства.Таблицы.Добавить("Справочник.КассыККМ");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;

	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Подразделения Тогда

		Свойства.Таблицы.Добавить("Справочник.СтруктураПредприятия");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;

	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Склады Тогда

		Свойства.Таблицы.Добавить("Справочник.Склады");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
	
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ВидыЦен Тогда

		Свойства.Таблицы.Добавить("Справочник.ВидыЦен");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;

	КонецЕсли;
	
КонецПроцедуры

// Заполняет использование видов доступа, добавленных прикладным разработчиком
// в план видов характеристик ВидыДоступа, как предопределенные элементы.
//
// Параметры:
//  ВидДоступа    - ПланВидовХарактеристикСсылка.ВидыДоступа.
//  Использование - Булево (возвращаемое значение). Начальное значение Истина.
// 
Процедура ЗаполнитьИспользованиеВидаДоступа(Знач ВидДоступа, Использование) Экспорт
	
	Если ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыНоменклатуры Тогда
		Использование = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаНоменклатуры");
	ИначеЕсли ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыПартнеров Тогда
		Использование = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаПартнеров");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых по значениям доступа.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений, содержащая поля,
//                   описание которых  см. в комментарии к функции
//                   РегистрыСведений.ПраваПоЗначениямДоступа.ВозможныеПрава().
//
Процедура ЗаполнитьВозможныеПраваПоЗначениямДоступа(Знач ВозможныеПрава) Экспорт
	
	// СтандартныеПодсистемы.РаботаСФайлами
	
	////////////////////////////////////////////////////////////
	// Справочник.ПапкиФайлов
	////////////////////////////////////////////////////////////
	Право = ВозможныеПрава.Добавить();
	Право.ВладелецПрав  = "Справочник.ПапкиФайлов";
	Право.Имя           = "ЧтениеПапокИФайлов";
	Право.Синоним       = НСтр("ru = 'Чтение папок и файлов'");
	Право.Сокращение    = НСтр("ru = 'Чтение'");
	Право.Заголовок     = НСтр("ru = 'Чт'");
	Право.НачальноеЗначение = Истина;
	// Требуемая роль (одна из указанных)
	Право.ТребуемаяРоль.Добавить("ДобавлениеИзменениеФайлов");
	// Права для стандартных шаблонов ограничений доступа.
	Право.ЧтениеВТаблицах.Добавить("Справочник.ПапкиФайлов");
	Право.ЧтениеВТаблицах.Добавить("Справочник.Файлы");
	Право.ЧтениеВТаблицах.Добавить("Справочник.ВерсииФайлов");
	Право.ЧтениеВТаблицах.Добавить("РегистрСведений.ХранимыеФайлыВерсий");
	
	Право = ВозможныеПрава.Добавить();
	Право.ВладелецПрав  = "Справочник.ПапкиФайлов";
	Право.Имя           = "ДобавлениеПапокИФайлов";
	Право.Синоним       = НСтр("ru = 'Добавление папок и файлов'");
	Право.Сокращение    = НСтр("ru = 'Добавление'");
	Право.Заголовок     = НСтр("ru = 'Доб'");
	// Права, требуемые для этого права.
	Право.ТребуемыеПрава.Добавить("ЧтениеПапокИФайлов");
	Право.ТребуемыеПрава.Добавить("ИзменениеПапокИФайлов");
	// Требуемая роль (одна из указанных).
	Право.ТребуемаяРоль.Добавить("ДобавлениеИзменениеФайлов");
	// Права для стандартных шаблонов ограничений доступа.
	Право.ДобавлениеВТаблицах.Добавить("Справочник.ПапкиФайлов");
	Право.ДобавлениеВТаблицах.Добавить("Справочник.Файлы");
	
	Право = ВозможныеПрава.Добавить();
	Право.ВладелецПрав  = "Справочник.ПапкиФайлов";
	Право.Имя           = "ИзменениеПапокИФайлов";
	Право.Синоним       = НСтр("ru = 'Изменение папок и файлов'");
	Право.Сокращение    = НСтр("ru = 'Изменение'");
	Право.Заголовок     = НСтр("ru = 'Изм'");
	// Требуемая роль (одна из указанных).
	Право.ТребуемаяРоль.Добавить("ДобавлениеИзменениеФайлов");
	Право.ТребуемыеПрава.Добавить("ЧтениеПапокИФайлов");
	// Права для стандартных шаблонов ограничений доступа.
	Право.ИзменениеВТаблицах.Добавить("Справочник.ПапкиФайлов");
	Право.ИзменениеВТаблицах.Добавить("Справочник.Файлы");
	
	Право = ВозможныеПрава.Добавить();
	Право.ВладелецПрав  = "Справочник.ПапкиФайлов";
	Право.Имя           = "ПометкаУдаленияПапокИФайлов";
	Право.Синоним       = НСтр("ru = 'Пометка удаления папок и файлов'");
	Право.Сокращение    = НСтр("ru = 'Пометка удаления'");
	Право.Заголовок     = НСтр("ru = 'ПомУд'");
	// Права, требуемые для этого права.
	Право.ТребуемыеПрава.Добавить("ЧтениеПапокИФайлов");
	Право.ТребуемыеПрава.Добавить("ИзменениеПапокИФайлов");
	// Требуемая роль (одна из указанных)
	Право.ТребуемаяРоль.Добавить("ДобавлениеИзменениеФайлов");
	
	Право = ВозможныеПрава.Добавить();
	Право.ВладелецПрав  = "Справочник.ПапкиФайлов";
	Право.Имя           = "УправлениеПравами";
	Право.Синоним       = НСтр("ru = 'Управление правами папок файлов'");
	Право.Сокращение    = НСтр("ru = 'Управление правами'");
	Право.Заголовок     = НСтр("ru = 'Адм'");
	// Права, требуемые для этого права.
	Право.ТребуемыеПрава.Добавить("ЧтениеПапокИФайлов");
	// Требуемая роль (одна из указанных)
	Право.ТребуемаяРоль.Добавить("ДобавлениеИзменениеФайлов");
		
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Знач Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Параметры:
//  Таблица      - РегистрСведенийНаборЗаписей.ЗависимостиПравДоступа.
//                 Допустимые значения ресурсов:
//                   "ПланыВидовХарактеристик.ВидыДоступа.ПравоЧтения",
//                   "ПланыВидовХарактеристик.ВидыДоступа.ПравоДобавления",
//                   "ПланыВидовХарактеристик.ВидыДоступа.ПравоИзменения".
//
//                 Если задано недопустимое значение, будет установлено значение по умолчанию:
//                 для права Чтение                         - ПланыВидовХарактеристик.ВидыДоступа.ПравоЧтения,
//                 для прав Добавление, Изменение, Удаление - ПланыВидовХарактеристик.ВидыДоступа.ПравоИзменения.
//                 
//                 Следует иметь в виду, что обычная "жесткость" условия ограничения доступа
//                 уменьшается в порядке "Добавление", "Изменение", "Чтение",
//                 Т.е. то, что можно добавить, можно и изменить и прочитать,
//                 соответственно, то что можно изменить можно и прочитать, но не наоборот.
//
Процедура ЗаполнитьЗависимостиПравДоступа(Знач Таблица) Экспорт
	
	
КонецПроцедуры

// Возвращает вид используемого интерфейса для настройки прав доступа.
//
//  Упрощенный интерфейс удобен для конфигураций с небольшим количеством пользователей,
// так как много функций не требуются и они могут быть скрыты (скрытие не может быть
// выполнено только лишь функциональной опцией, так как потребуется пересмотр
// содержимого групп доступа и профилей).
//
// Возвращаемое значение:
//  Булево
//
Функция УпрощенныйИнтерфейсНастройкиПравДоступа() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые
// в шаблонах ограничения доступа явно, а виды доступа, используемые
// в наборах значений доступа могут быть получены из текущего состояния
// регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует
// воспользоваться инструментами разработчика для подсистемы
// Управление доступом.
//
// Параметры:
//  Описание     - Строка, многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта]
//                 Например, Документ.ПриходнаяНакладная.Чтение.Организации
//                           Документ.ПриходнаяНакладная.Чтение.Контрагенты
//                           Документ.ПриходнаяНакладная.Добавление.Организации
//                           Документ.ПриходнаяНакладная.Добавление.Контрагенты
//                           Документ.ПриходнаяНакладная.Изменение.Организации
//                           Документ.ПриходнаяНакладная.Изменение.Контрагенты
//                           Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.ЭлектронныеПисьма.Добавление.Объект.Документ.ЭлектронныеПисьма
//                           Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма
//                           Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо
//                           Документ.Файлы.Добавление.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Добавление.Объект.Документ.ЭлектронноеПисьмо
//                           Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
//                           Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо
//                 Вид доступа Объект предопределен, как литерал, его нет в предопределенных элементах
//                 ПланыВидовХарактеристик.ВидыДоступа. Этот вид доступа используется в шаблонах ограничений доступа,
//                 как "ссылка" на другой объект, по которому ограничивается таблица.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц, которые используются
//                 для этого вида доступа. Т.е. перечислить типы, которые соответствующие полю,
//                 использованному в шаблоне ограничения доступа в паре с видом доступа "Объект".
//                 При перечислении типов по виду доступа "Объект" нужно перечислить только те типы поля,
//                 которые есть у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ЗаполнитьВидыОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + " 
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Добавление.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Добавление.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Добавление.Подразделения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.БанковскиеСчетаКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаКонтрагентов.Добавление.ВнешниеПользователи
	|Справочник.БанковскиеСчетаКонтрагентов.Изменение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.ВариантыКомплектацииНоменклатуры.Добавление.ГруппыНоменклатуры
	|Справочник.ВариантыКомплектацииНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.ГруппыПартнеров
	|Справочник.ВерсииФайлов.Чтение.ГруппыФизическихЛиц
	|Справочник.ВерсииФайлов.Чтение.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.ПравоЧтения
	|Справочник.ВерсииФайлов.Изменение.ГруппыПартнеров
	|Справочник.ВерсииФайлов.Изменение.ГруппыФизическихЛиц
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ВзаимозачетЗадолженности
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.Встреча
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.КоммерческоеПредложениеКлиенту
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РегистрацияЦенНоменклатурыПоставщика
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.СверкаВзаиморасчетов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ВидыСделокСКлиентами
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.НоменклатураПоставщиков
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Партнеры
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Проекты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.СоглашенияСКлиентами
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.ПравоИзменения
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Добавление.Организации
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВидыЗапасов.Чтение.Организации
	|Справочник.ВидыЗапасов.Добавление.Организации
	|Справочник.ВидыЗапасов.Изменение.Организации
	|Справочник.ВидыНоменклатуры.Добавление.ГруппыНоменклатуры
	|Справочник.ВидыНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ГруппыДоступаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Добавление.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Добавление.Организации
	|Справочник.ДоговорыКонтрагентов.Добавление.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Добавление.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Добавление.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыЭквайринга.Чтение.Организации
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Чтение.ПравоЧтения
	|Справочник.ЗадачиПроектов.Добавление.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Добавление.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Добавление.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Добавление.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Добавление.ПравоЧтения
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Изменение.ПравоЧтения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Добавление.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Добавление.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Добавление.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Добавление.ХозяйственныеОперации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.Кассы.Чтение.Организации
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Добавление.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеров.Добавление.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Добавление.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ГруппыПартнеров
	|Справочник.Контрагенты.Чтение.ВнешниеПользователи
	|Справочник.Контрагенты.Чтение.ГруппыПартнеров
	|Справочник.Контрагенты.Добавление.ВнешниеПользователи
	|Справочник.Контрагенты.Добавление.ГруппыПартнеров
	|Справочник.Контрагенты.Изменение.ВнешниеПользователи
	|Справочник.Контрагенты.Изменение.ГруппыПартнеров
	|Справочник.НаборыДополнительныхРеквизитовИСведений.Добавление.ГруппыНоменклатуры
	|Справочник.НаборыДополнительныхРеквизитовИСведений.Изменение.ГруппыНоменклатуры
	|Справочник.Номенклатура.Добавление.ГруппыНоменклатуры
	|Справочник.Номенклатура.Изменение.ГруппыНоменклатуры
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиков.Добавление.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПрисоединенныеФайлы.Добавление.ГруппыНоменклатуры
	|Справочник.НоменклатураПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ОбластиХранения.Чтение.Склады
	|Справочник.ОбластиХранения.Добавление.Склады
	|Справочник.ОбластиХранения.Изменение.Склады
	|Справочник.Партнеры.Чтение.ВнешниеПользователи
	|Справочник.Партнеры.Чтение.ГруппыПартнеров
	|Справочник.Партнеры.Добавление.ГруппыПартнеров
	|Справочник.Партнеры.Изменение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Добавление.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Изменение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РабочиеУчастки.Чтение.Склады
	|Справочник.РабочиеУчастки.Добавление.Склады
	|Справочник.РабочиеУчастки.Изменение.Склады
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Добавление.Организации
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СделкиСКлиентами.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентами.Добавление.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентами.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Добавление.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СкладскиеПомещения.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Добавление.Склады
	|Справочник.СкладскиеЯчейки.Изменение.Склады
	|Справочник.Склады.Чтение.Склады
	|Справочник.СоглашенияСКлиентами.Чтение.ВнешниеПользователи
	|Справочник.СоглашенияСКлиентами.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Чтение.Организации
	|Справочник.СоглашенияСКлиентами.Чтение.Склады
	|Справочник.СоглашенияСКлиентами.Добавление.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Чтение.Организации
	|Справочник.СоглашенияСПоставщиками.Чтение.Склады
	|Справочник.СоглашенияСПоставщиками.Добавление.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Добавление.Организации
	|Справочник.СоглашенияСПоставщиками.Добавление.Склады
	|Справочник.СоглашенияСПоставщиками.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Изменение.Организации
	|Справочник.СоглашенияСПоставщиками.Изменение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Добавление.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Добавление.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Добавление.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СтруктураПредприятия.Чтение.Подразделения
	|Справочник.УпаковкиНоменклатуры.Добавление.ГруппыНоменклатуры
	|Справочник.УпаковкиНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Чтение.ГруппыПартнеров
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Добавление.ГруппыПартнеров
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Изменение.ГруппыПартнеров
	|Справочник.УсловияЦенПоставщиков.Чтение.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.УсловияЦенПоставщиков.Добавление.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.УсловияЦенПоставщиков.Изменение.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Добавление.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.Файлы.Чтение.ГруппыПартнеров
	|Справочник.Файлы.Чтение.ГруппыФизическихЛиц
	|Справочник.Файлы.Чтение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Чтение.Объект.Документ.ВзаимозачетЗадолженности
	|Справочник.Файлы.Чтение.Объект.Документ.Встреча
	|Справочник.Файлы.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|Справочник.Файлы.Чтение.Объект.Документ.КоммерческоеПредложениеКлиенту
	|Справочник.Файлы.Чтение.Объект.Документ.РегистрацияЦенНоменклатурыПоставщика
	|Справочник.Файлы.Чтение.Объект.Документ.СверкаВзаиморасчетов
	|Справочник.Файлы.Чтение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.Файлы.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Справочник.Файлы.Чтение.Объект.Справочник.ВидыСделокСКлиентами
	|Справочник.Файлы.Чтение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.Файлы.Чтение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Чтение.Объект.Справочник.НоменклатураПоставщиков
	|Справочник.Файлы.Чтение.Объект.Справочник.Партнеры
	|Справочник.Файлы.Чтение.Объект.Справочник.ПретензииКлиентов
	|Справочник.Файлы.Чтение.Объект.Справочник.Проекты
	|Справочник.Файлы.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.Файлы.Чтение.Объект.Справочник.СоглашенияСКлиентами
	|Справочник.Файлы.Чтение.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Чтение.ПапкиФайлов
	|Справочник.Файлы.Чтение.ПравоЧтения
	|Справочник.Файлы.Добавление.ГруппыПартнеров
	|Справочник.Файлы.Добавление.ГруппыФизическихЛиц
	|Справочник.Файлы.Добавление.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Добавление.Объект.Документ.ВзаимозачетЗадолженности
	|Справочник.Файлы.Добавление.Объект.Документ.Встреча
	|Справочник.Файлы.Добавление.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.Файлы.Добавление.Объект.Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|Справочник.Файлы.Добавление.Объект.Документ.КоммерческоеПредложениеКлиенту
	|Справочник.Файлы.Добавление.Объект.Документ.РегистрацияЦенНоменклатурыПоставщика
	|Справочник.Файлы.Добавление.Объект.Документ.СверкаВзаиморасчетов
	|Справочник.Файлы.Добавление.Объект.Документ.ТелефонныйЗвонок
	|Справочник.Файлы.Добавление.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.Файлы.Добавление.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.Файлы.Добавление.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Справочник.Файлы.Добавление.Объект.Справочник.ВидыСделокСКлиентами
	|Справочник.Файлы.Добавление.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.Файлы.Добавление.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Добавление.Объект.Справочник.НоменклатураПоставщиков
	|Справочник.Файлы.Добавление.Объект.Справочник.Партнеры
	|Справочник.Файлы.Добавление.Объект.Справочник.ПретензииКлиентов
	|Справочник.Файлы.Добавление.Объект.Справочник.Проекты
	|Справочник.Файлы.Добавление.Объект.Справочник.СделкиСКлиентами
	|Справочник.Файлы.Добавление.Объект.Справочник.СоглашенияСКлиентами
	|Справочник.Файлы.Добавление.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.Файлы.Добавление.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Добавление.ПапкиФайлов
	|Справочник.Файлы.Добавление.ПравоИзменения
	|Справочник.Файлы.Изменение.ГруппыПартнеров
	|Справочник.Файлы.Изменение.ГруппыФизическихЛиц
	|Справочник.Файлы.Изменение.Объект.Документ.АвансовыйОтчет
	|Справочник.Файлы.Изменение.Объект.Документ.ВзаимозачетЗадолженности
	|Справочник.Файлы.Изменение.Объект.Документ.Встреча
	|Справочник.Файлы.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|Справочник.Файлы.Изменение.Объект.Документ.КоммерческоеПредложениеКлиенту
	|Справочник.Файлы.Изменение.Объект.Документ.РегистрацияЦенНоменклатурыПоставщика
	|Справочник.Файлы.Изменение.Объект.Документ.СверкаВзаиморасчетов
	|Справочник.Файлы.Изменение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.Файлы.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Справочник.Файлы.Изменение.Объект.Справочник.ВидыСделокСКлиентами
	|Справочник.Файлы.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.Файлы.Изменение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Изменение.Объект.Справочник.НоменклатураПоставщиков
	|Справочник.Файлы.Изменение.Объект.Справочник.Партнеры
	|Справочник.Файлы.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.Файлы.Изменение.Объект.Справочник.Проекты
	|Справочник.Файлы.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.Файлы.Изменение.Объект.Справочник.СоглашенияСКлиентами
	|Справочник.Файлы.Изменение.Объект.Справочник.СоглашенияСПоставщиками
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.ПапкиФайлов
	|Справочник.Файлы.Изменение.ПравоИзменения
	|Справочник.ФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Добавление.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Изменение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Добавление.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ХарактеристикиНоменклатуры.Добавление.ГруппыНоменклатуры
	|Справочник.ХарактеристикиНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ЭквайринговыеТерминалы.Чтение.Кассы
	|Справочник.ЭквайринговыеТерминалы.Чтение.Организации
	|Документ.АвансовыйОтчет.Чтение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Чтение.Подразделения
	|Документ.АвансовыйОтчет.Добавление.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Добавление.Организации
	|Документ.АвансовыйОтчет.Добавление.Подразделения
	|Документ.АвансовыйОтчет.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Изменение.Подразделения
	|Документ.АктВыполненныхРабот.Чтение.ВнешниеПользователи
	|Документ.АктВыполненныхРабот.Чтение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктВыполненныхРабот.Чтение.Подразделения
	|Документ.АктВыполненныхРабот.Добавление.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Добавление.Организации
	|Документ.АктВыполненныхРабот.Добавление.Подразделения
	|Документ.АктВыполненныхРабот.Изменение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Изменение.Подразделения
	|Документ.АктОРасхожденияхПриПоступленииТоваров.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПриПоступленииТоваров.Чтение.Организации
	|Документ.АктОРасхожденияхПриПоступленииТоваров.Добавление.ГруппыПартнеров
	|Документ.АктОРасхожденияхПриПоступленииТоваров.Добавление.Организации
	|Документ.АктОРасхожденияхПриПоступленииТоваров.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПриПоступленииТоваров.Изменение.Организации
	|Документ.АктПриемкиТоваров.Чтение.ГруппыПартнеров
	|Документ.АктПриемкиТоваров.Чтение.Организации
	|Документ.АктПриемкиТоваров.Добавление.ГруппыПартнеров
	|Документ.АктПриемкиТоваров.Добавление.Организации
	|Документ.АктПриемкиТоваров.Изменение.ГруппыПартнеров
	|Документ.АктПриемкиТоваров.Изменение.Организации
	|Документ.ВводОстатков.Чтение.Организации
	|Документ.ВводОстатков.Чтение.Склады
	|Документ.ВводОстатков.Добавление.Организации
	|Документ.ВводОстатков.Добавление.Склады
	|Документ.ВводОстатков.Изменение.Организации
	|Документ.ВводОстатков.Изменение.Склады
	|Документ.ВзаимозачетЗадолженности.Чтение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Чтение.Организации
	|Документ.ВзаимозачетЗадолженности.Добавление.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Добавление.Организации
	|Документ.ВзаимозачетЗадолженности.Изменение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Изменение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Добавление.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Добавление.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Добавление.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Склады
	|Документ.ВнутреннееПотреблениеТоваров.Добавление.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Добавление.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Добавление.Склады
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Склады
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Добавление.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ВозвратТоваровОтКлиента.Добавление.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Добавление.Организации
	|Документ.ВозвратТоваровОтКлиента.Добавление.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Добавление.Склады
	|Документ.ВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Изменение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ВозвратТоваровПоставщику.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Чтение.Склады
	|Документ.ВозвратТоваровПоставщику.Добавление.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Добавление.Организации
	|Документ.ВозвратТоваровПоставщику.Добавление.Подразделения
	|Документ.ВозвратТоваровПоставщику.Добавление.Склады
	|Документ.ВозвратТоваровПоставщику.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Изменение.Склады
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Добавление.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Добавление.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.Организации
	|Документ.ВыпискаПоРасчетномуСчету.Чтение.Организации
	|Документ.ВыпискаПоРасчетномуСчету.Добавление.Организации
	|Документ.ВыпискаПоРасчетномуСчету.Изменение.Организации
	|Документ.ДоверенностьНаПолучениеТоваров.Чтение.ГруппыПартнеров
	|Документ.ДоверенностьНаПолучениеТоваров.Чтение.ГруппыФизическихЛиц
	|Документ.ДоверенностьНаПолучениеТоваров.Чтение.Организации
	|Документ.ДоверенностьНаПолучениеТоваров.Добавление.ГруппыПартнеров
	|Документ.ДоверенностьНаПолучениеТоваров.Добавление.ГруппыФизическихЛиц
	|Документ.ДоверенностьНаПолучениеТоваров.Добавление.Организации
	|Документ.ДоверенностьНаПолучениеТоваров.Изменение.ГруппыПартнеров
	|Документ.ДоверенностьНаПолучениеТоваров.Изменение.ГруппыФизическихЛиц
	|Документ.ДоверенностьНаПолучениеТоваров.Изменение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Добавление.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Добавление.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Добавление.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Склады
	|Документ.ЗаказКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Чтение.Организации
	|Документ.ЗаказКлиента.Чтение.Склады
	|Документ.ЗаказКлиента.Добавление.ГруппыПартнеров
	|Документ.ЗаказКлиента.Добавление.Организации
	|Документ.ЗаказКлиента.Добавление.Склады
	|Документ.ЗаказКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Изменение.Организации
	|Документ.ЗаказКлиента.Изменение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Добавление.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Добавление.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Добавление.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Склады
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.Склады
	|Документ.ЗаказНаПеремещение.Добавление.Организации
	|Документ.ЗаказНаПеремещение.Добавление.Склады
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Склады
	|Документ.ЗаказНаСборку.Чтение.Организации
	|Документ.ЗаказНаСборку.Чтение.Склады
	|Документ.ЗаказНаСборку.Добавление.Организации
	|Документ.ЗаказНаСборку.Добавление.Склады
	|Документ.ЗаказНаСборку.Изменение.Организации
	|Документ.ЗаказНаСборку.Изменение.Склады
	|Документ.ЗаказПоставщику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.Склады
	|Документ.ЗаказПоставщику.Добавление.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Добавление.Организации
	|Документ.ЗаказПоставщику.Добавление.Склады
	|Документ.ЗаказПоставщику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Добавление.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Добавление.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Добавление.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Добавление.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Добавление.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Добавление.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Добавление.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Добавление.ХозяйственныеОперации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.КассоваяКнига.Чтение.Организации
	|Документ.КассоваяКнига.Добавление.Организации
	|Документ.КассоваяКнига.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.КассыККМ
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Чтение.Склады
	|Документ.КассоваяСмена.Добавление.КассыККМ
	|Документ.КассоваяСмена.Добавление.Организации
	|Документ.КассоваяСмена.Добавление.Склады
	|Документ.КассоваяСмена.Изменение.КассыККМ
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КассоваяСмена.Изменение.Склады
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Добавление.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Добавление.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Добавление.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Добавление.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Чтение.Кассы
	|Документ.ОперацияПоПлатежнойКарте.Чтение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Добавление.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Добавление.Кассы
	|Документ.ОперацияПоПлатежнойКарте.Добавление.Организации
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Изменение.Кассы
	|Документ.ОперацияПоПлатежнойКарте.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Склады
	|Документ.ОприходованиеИзлишковТоваров.Добавление.Организации
	|Документ.ОприходованиеИзлишковТоваров.Добавление.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Добавление.Склады
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Добавление.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Добавление.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Добавление.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров.Добавление.Склады
	|Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров.Изменение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Чтение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Добавление.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Изменение.Склады
	|Документ.ОтборРазмещениеТоваров.Чтение.Склады
	|Документ.ОтборРазмещениеТоваров.Добавление.Склады
	|Документ.ОтборРазмещениеТоваров.Изменение.Склады
	|Документ.ОтражениеРезультатовПроверкиОрдераНаТовары.Чтение.Склады
	|Документ.ОтражениеРезультатовПроверкиОрдераНаТовары.Добавление.Склады
	|Документ.ОтражениеРезультатовПроверкиОрдераНаТовары.Изменение.Склады
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Подразделения
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Добавление.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Добавление.Подразделения
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Подразделения
	|Документ.ОтчетКомиссионера.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионера.Чтение.Подразделения
	|Документ.ОтчетКомиссионера.Добавление.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Добавление.Организации
	|Документ.ОтчетКомиссионера.Добавление.Подразделения
	|Документ.ОтчетКомиссионера.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Изменение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Добавление.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Добавление.Организации
	|Документ.ОтчетКомиссионераОСписании.Добавление.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.Подразделения
	|Документ.ОтчетКомитенту.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетКомитенту.Чтение.Подразделения
	|Документ.ОтчетКомитенту.Добавление.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Добавление.Организации
	|Документ.ОтчетКомитенту.Добавление.Подразделения
	|Документ.ОтчетКомитенту.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Изменение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Чтение.Организации
	|Документ.ОтчетКомитентуОСписании.Чтение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Добавление.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Добавление.Организации
	|Документ.ОтчетКомитентуОСписании.Добавление.Подразделения
	|Документ.ОтчетКомитентуОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Изменение.Организации
	|Документ.ОтчетКомитентуОСписании.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.Склады
	|Документ.ОтчетОРозничныхПродажах.Добавление.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Добавление.Организации
	|Документ.ОтчетОРозничныхПродажах.Добавление.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Добавление.Склады
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Изменение.Склады
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Добавление.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Добавление.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Склады
	|Документ.ПеремещениеТоваров.Добавление.Организации
	|Документ.ПеремещениеТоваров.Добавление.Склады
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Склады
	|Документ.ПересортицаТоваров.Чтение.Организации
	|Документ.ПересортицаТоваров.Чтение.Подразделения
	|Документ.ПересортицаТоваров.Чтение.Склады
	|Документ.ПересортицаТоваров.Добавление.Организации
	|Документ.ПересортицаТоваров.Добавление.Подразделения
	|Документ.ПересортицаТоваров.Добавление.Склады
	|Документ.ПересортицаТоваров.Изменение.Организации
	|Документ.ПересортицаТоваров.Изменение.Подразделения
	|Документ.ПересортицаТоваров.Изменение.Склады
	|Документ.ПересчетТоваров.Чтение.Склады
	|Документ.ПересчетТоваров.Добавление.Склады
	|Документ.ПересчетТоваров.Изменение.Склады
	|Документ.ПланируемоеПоступлениеДенежныхСредств.Чтение.Кассы
	|Документ.ПланируемоеПоступлениеДенежныхСредств.Чтение.Организации
	|Документ.ПланируемоеПоступлениеДенежныхСредств.Добавление.Кассы
	|Документ.ПланируемоеПоступлениеДенежныхСредств.Добавление.Организации
	|Документ.ПланируемоеПоступлениеДенежныхСредств.Изменение.Кассы
	|Документ.ПланируемоеПоступлениеДенежныхСредств.Изменение.Организации
	|Документ.ПланПродажИВнутреннегоПотребления.Чтение.Подразделения
	|Документ.ПланПродажИВнутреннегоПотребления.Добавление.Подразделения
	|Документ.ПланПродажИВнутреннегоПотребления.Изменение.Подразделения
	|Документ.ПорчаТоваров.Чтение.Организации
	|Документ.ПорчаТоваров.Чтение.Подразделения
	|Документ.ПорчаТоваров.Чтение.Склады
	|Документ.ПорчаТоваров.Добавление.Организации
	|Документ.ПорчаТоваров.Добавление.Подразделения
	|Документ.ПорчаТоваров.Добавление.Склады
	|Документ.ПорчаТоваров.Изменение.Организации
	|Документ.ПорчаТоваров.Изменение.Подразделения
	|Документ.ПорчаТоваров.Изменение.Склады
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Добавление.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Добавление.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Добавление.ХозяйственныеОперации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ПоступлениеТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Чтение.Склады
	|Документ.ПоступлениеТоваровУслуг.Добавление.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Добавление.Организации
	|Документ.ПоступлениеТоваровУслуг.Добавление.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Добавление.Склады
	|Документ.ПоступлениеТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Изменение.Склады
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Чтение.Подразделения
	|Документ.ПоступлениеУслугПрочихАктивов.Добавление.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Добавление.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Добавление.Подразделения
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.Организации
	|Документ.ПоступлениеУслугПрочихАктивов.Изменение.Подразделения
	|Документ.РаспоряжениеНаИнвентаризациюТоваров.Чтение.Склады
	|Документ.РаспоряжениеНаИнвентаризациюТоваров.Добавление.Склады
	|Документ.РаспоряжениеНаИнвентаризациюТоваров.Изменение.Склады
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Чтение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.ПриходныйКассовыйОрдер.Добавление.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Добавление.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Добавление.Кассы
	|Документ.ПриходныйКассовыйОрдер.Добавление.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Добавление.Организации
	|Документ.ПриходныйКассовыйОрдер.Добавление.ХозяйственныеОперации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Изменение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.ПриходныйОрдерНаТовары.Чтение.Склады
	|Документ.ПриходныйОрдерНаТовары.Добавление.Склады
	|Документ.ПриходныйОрдерНаТовары.Изменение.Склады
	|Документ.ПрочееОприходованиеТоваров.Чтение.Организации
	|Документ.ПрочееОприходованиеТоваров.Чтение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Чтение.Склады
	|Документ.ПрочееОприходованиеТоваров.Добавление.Организации
	|Документ.ПрочееОприходованиеТоваров.Добавление.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Добавление.Склады
	|Документ.ПрочееОприходованиеТоваров.Изменение.Организации
	|Документ.ПрочееОприходованиеТоваров.Изменение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Изменение.Склады
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Добавление.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Добавление.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Добавление.ХозяйственныеОперации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Чтение.Организации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Добавление.Организации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Изменение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Чтение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Добавление.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Изменение.Организации
	|Документ.РаспределениеРасходовНаСебестоимостьТоваров.Чтение.Организации
	|Документ.РаспределениеРасходовНаСебестоимостьТоваров.Добавление.Организации
	|Документ.РаспределениеРасходовНаСебестоимостьТоваров.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Чтение.Кассы
	|Документ.РасходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.РасходныйКассовыйОрдер.Добавление.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Добавление.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Добавление.Кассы
	|Документ.РасходныйКассовыйОрдер.Добавление.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Добавление.Организации
	|Документ.РасходныйКассовыйОрдер.Добавление.ХозяйственныеОперации
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Изменение.Кассы
	|Документ.РасходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.РасходныйОрдерНаТовары.Чтение.Склады
	|Документ.РасходныйОрдерНаТовары.Добавление.Склады
	|Документ.РасходныйОрдерНаТовары.Изменение.Склады
	|Документ.РасчетСебестоимостиТоваров.Чтение.Организации
	|Документ.РасчетСебестоимостиТоваров.Добавление.Организации
	|Документ.РасчетСебестоимостиТоваров.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.ВнешниеПользователи
	|Документ.РеализацияТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Подразделения
	|Документ.РеализацияТоваровУслуг.Чтение.Склады
	|Документ.РеализацияТоваровУслуг.Добавление.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Добавление.Организации
	|Документ.РеализацияТоваровУслуг.Добавление.Подразделения
	|Документ.РеализацияТоваровУслуг.Добавление.Склады
	|Документ.РеализацияТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Подразделения
	|Документ.РеализацияТоваровУслуг.Изменение.Склады
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Добавление.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Изменение.ГруппыПартнеров
	|Документ.СборкаТоваров.Чтение.Организации
	|Документ.СборкаТоваров.Чтение.Склады
	|Документ.СборкаТоваров.Добавление.Организации
	|Документ.СборкаТоваров.Добавление.Склады
	|Документ.СборкаТоваров.Изменение.Организации
	|Документ.СборкаТоваров.Изменение.Склады
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СверкаВзаиморасчетов.Добавление.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Добавление.Организации
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СоглашениеСПоставщиком.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.СписаниеБезналичныхДенежныхСредств.Добавление.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Добавление.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Добавление.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Добавление.ХозяйственныеОперации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.СписаниеЗадолженности.Чтение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Чтение.Организации
	|Документ.СписаниеЗадолженности.Добавление.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Добавление.Организации
	|Документ.СписаниеЗадолженности.Изменение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Склады
	|Документ.СписаниеНедостачТоваров.Добавление.Организации
	|Документ.СписаниеНедостачТоваров.Добавление.Подразделения
	|Документ.СписаниеНедостачТоваров.Добавление.Склады
	|Документ.СписаниеНедостачТоваров.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Изменение.Склады
	|Документ.СчетНаОплатуКлиенту.Чтение.ВнешниеПользователи
	|Документ.СчетНаОплатуКлиенту.Чтение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Чтение.Организации
	|Документ.СчетНаОплатуКлиенту.Добавление.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Добавление.Организации
	|Документ.СчетНаОплатуКлиенту.Изменение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Добавление.Организации
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураВыданныйАванс.Чтение.Организации
	|Документ.СчетФактураВыданныйАванс.Добавление.Организации
	|Документ.СчетФактураВыданныйАванс.Изменение.Организации
	|Документ.СчетФактураПолученныйАванс.Чтение.Организации
	|Документ.СчетФактураПолученныйАванс.Добавление.Организации
	|Документ.СчетФактураПолученныйАванс.Изменение.Организации
	|Документ.ТелефонныйЗвонок.Чтение.Пользователи
	|Документ.УстановкаБлокировокЯчеек.Чтение.Склады
	|Документ.УстановкаБлокировокЯчеек.Добавление.Склады
	|Документ.УстановкаБлокировокЯчеек.Изменение.Склады
	|Документ.УстановкаЦенНоменклатуры.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Добавление.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.Склады
	|Документ.ЧекККМ.Добавление.КассыККМ
	|Документ.ЧекККМ.Добавление.Организации
	|Документ.ЧекККМ.Добавление.Склады
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.Склады
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.Склады
	|Документ.ЧекККМВозврат.Добавление.КассыККМ
	|Документ.ЧекККМВозврат.Добавление.Организации
	|Документ.ЧекККМВозврат.Добавление.Склады
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.Склады
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Подразделения
	|ЖурналДокументов.ПередачиВозвратыТоваровМеждуОрганизациями.Чтение.Организации
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.Организации
	|ЖурналДокументов.СкладскиеАкты.Чтение.Подразделения
	|ЖурналДокументов.СкладскиеАкты.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Чтение.Склады
	|ЖурналДокументов.ЧекиККМ.Чтение.КассыККМ
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.Склады
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Чтение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Изменение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|РегистрСведений.ДействиеСкидокНаценок.Чтение.Склады
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДоступностьТоваровДляВнешнихПользователей.Чтение.Склады
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.ГруппыПартнеров
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.Объект.Справочник.СделкиСКлиентами
	|РегистрСведений.КорзинаПокупателя.Чтение.ВнешниеПользователи
	|РегистрСведений.ПараметрыОбеспеченияТоварами.Чтение.Склады
	|РегистрСведений.ПараметрыОбеспеченияТоварами.Изменение.Склады
	|РегистрСведений.НастройкаКонтроляОстатков.Чтение.Склады
	|РегистрСведений.НастройкаКонтроляОстатков.Изменение.Склады
	|РегистрСведений.НастройкаМетодовОценкиСтоимостиТоваров.Чтение.Организации
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Чтение.Организации
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Изменение.Организации
	|РегистрСведений.НастройкаУровняОбслуживания.Чтение.Склады
	|РегистрСведений.НастройкаУровняОбслуживания.Изменение.Склады
	|РегистрСведений.ПартнерыСегмента.Чтение.ВнешниеПользователи
	|РегистрСведений.ПартнерыСегмента.Чтение.ГруппыПартнеров
	|РегистрСведений.ПартнерыСегмента.Изменение.ГруппыПартнеров
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Чтение.Склады
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Изменение.Склады
	|РегистрСведений.ПримененияЕНВД.Чтение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Чтение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Изменение.Склады
	|РегистрСведений.СвязиМеждуПартнерами.Чтение.ГруппыПартнеров
	|РегистрСведений.СвязиМеждуПартнерами.Изменение.ГруппыПартнеров
	|РегистрСведений.СистемыНалогообложенияОрганизаций.Чтение.Организации
	|РегистрСведений.СтоимостьТоваров.Чтение.Организации
	|РегистрСведений.ТоварныеОграничения.Чтение.Склады
	|РегистрСведений.ТоварныеОграничения.Изменение.Склады
	|РегистрСведений.ВариантыОбеспеченияТоварами.Чтение.Склады
	|РегистрСведений.ВариантыОбеспеченияТоварами.Изменение.Склады
	|РегистрСведений.ФайлыВРабочемКаталоге.Чтение.Пользователи
	|РегистрСведений.ФайлыВРабочемКаталоге.Изменение.Пользователи
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыПоставщиков.Чтение.ГруппыПартнеров
	|РегистрСведений.ШтрихкодыНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.ГруппыПартнеров
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Организации
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Подразделения
	|РегистрНакопления.ГрафикДвиженияТоваров.Чтение.Склады
	|РегистрНакопления.ДвижениеТоваров.Чтение.Склады
	|РегистрНакопления.ДвиженияСерийТоваров.Чтение.Склады
	|РегистрНакопления.ДенежныеСредстваБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКВыплате.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКПоступлениюБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКСписаниюБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКСписаниюСПодотчетныхЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеСредстваКСписаниюСПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ВнешниеПользователи
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Склады
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Организации
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Подразделения
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Склады
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Склады
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Организации
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Склады
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Склады
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Склады
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.ПланыПродажИВнутреннегоПотребления.Чтение.Склады
	|РегистрНакопления.ПрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Подразделения
	|РегистрНакопления.ПрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ПрочиеРасходы.Чтение.Подразделения
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Кассы
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.КассыККМ
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ВнешниеПользователи
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентами.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РезервыСерийТоваров.Чтение.Склады
	|РегистрНакопления.СвободныеОстатки.Чтение.Склады
	|РегистрНакопления.СебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ТоварыВЯчейках.Чтение.Склады
	|РегистрНакопления.ТоварыКОтгрузке.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.Организации
	|РегистрНакопления.ТоварыКПоступлению.Чтение.Склады
	|РегистрНакопления.ТоварыНаСкладах.Чтение.Склады
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Склады
	|РегистрНакопления.ТоварыОрганизацийКПередаче.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКПередаче.Чтение.Склады
	|РегистрНакопления.ТоварыПереданныеНаКомиссию.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Подразделения
	|БизнесПроцесс.СогласованиеЦенНоменклатуры.Изменение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Чтение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Чтение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Добавление.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Добавление.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Изменение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|";
	
КонецПроцедуры
