// Процедура - обработчик события "ОбработкаКоманды".
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьОбщихФорм",
			"СчетФактура",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			Новый Структура("ПечатьВВалюте", Ложь) // ПараметрыПечати
		);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()
