
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") 
	 И Параметры.Отбор.Свойство("ТолькоПоступленияДенежныхСредств") Тогда
	
		Параметры.Отбор.Удалить("ТолькоПоступленияДенежныхСредств");
	
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника);
		СписокЗначений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
		СписокЗначений.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ);
		СписокЗначений.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
		СписокЗначений.Добавить(Перечисления.ХозяйственныеОперации.ПрочиеДоходы);
		СписокЗначений.Добавить(Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ХозяйственнаяОперация", СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

