#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	 СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УстановитьЗаголовкиПолей()

	ЕдиницаВеса = Строка(Константы.ЕдиницаИзмеренияВеса.Получить());
	ЕдиницаОбъема = Строка(Константы.ЕдиницаИзмеренияОбъема.Получить());

	Для Каждого ПолеНабораДанных Из СхемаКомпоновкиДанных.НаборыДанных.ТоварыВЯчейках.Поля Цикл
		Если ТипЗнч(ПолеНабораДанных) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			Если Найти(ПолеНабораДанных.Заголовок, "%ЕдиницаВеса%") > 0 Тогда
				ПолеНабораДанных.Заголовок = СтрЗаменить(ПолеНабораДанных.Заголовок, "%ЕдиницаВеса%", ЕдиницаВеса);
			ИначеЕсли Найти(ПолеНабораДанных.Заголовок, "%ЕдиницаОбъема%") > 0 Тогда
				ПолеНабораДанных.Заголовок = СтрЗаменить(ПолеНабораДанных.Заголовок, "%ЕдиницаОбъема%", ЕдиницаОбъема);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

УстановитьЗаголовкиПолей();


#КонецЕсли