////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСерий = Параметры.КоличествоСерий;
	  
	Если Параметры.ИспользоватьКоличество Тогда
		Элементы.ГруппаВКаждойСерии.Видимость = Истина;
		ЕдиницаИзмеренияСтр = Параметры.ЕдиницаИзмеренияСтр;
		Элементы.ВКаждойСерии1.СписокВыбора[0].Представление = Элементы.ВКаждойСерии1.СписокВыбора[0].Представление + " " + ЕдиницаИзмеренияСтр;
		ВКаждойСерии = Параметры.ВКаждойСерии;
		Если ВКаждойСерии = 1 Тогда
			Элементы.ГруппаКоличествоВКаждой.Доступность = Истина;
		Иначе
			Элементы.ГруппаКоличествоВКаждой.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаВКаждойСерии.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВКаждойСерииПриИзменении(Элемент)
	Элементы.ГруппаКоличествоВКаждой.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВКаждойСерии1ПриИзменении(Элемент)
	Элементы.ГруппаКоличествоВКаждой.Доступность = Ложь;
	ВКаждойСерииКоличество = 0;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура;	
	СтруктураВозврата.Вставить("ВКаждойСерии",ВКаждойСерии);
	СтруктураВозврата.Вставить("КоличествоСерий",КоличествоСерий);
	Если Элементы.ГруппаВКаждойСерии.Видимость Тогда
		СтруктураВозврата.Вставить("ВКаждойСерииКоличество",ВКаждойСерииКоличество);
	Иначе 
		СтруктураВозврата.Вставить("ВКаждойСерииКоличество",1);
	КонецЕсли;	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
