
Процедура ПередЗаписью(Отказ, Замещение)
	СформироватьДвиженияПоРегиструРаспределенияРасходов();
КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструРаспределенияРасходов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ПартииПрочихРасходов.Период, МЕСЯЦ) КАК Период,
	|	ПартииПрочихРасходов.Организация
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ПартииПрочихРасходов.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Период,
	|	Организация
	|";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ДопРасходыКРаспределению.СоздатьМенеджерЗаписи();
		НаборЗаписей.Период = Выборка.Период;
		НаборЗаписей.Организация = Выборка.Организация;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
