
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СкидкаНаценка", Параметры.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ТекущаяДата = ТекущаяДата();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыКартЛояльности.Форма.ФормаЭлемента", ПараметрыОткрытия);
	
КонецПроцедуры
