#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СогласоватьЗначенияПризнаков();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.НастройкиАдресныхСкладов.УстановитьНастройкиПоУмолчанию(Владелец,
																			Ссылка,
																			ИспользоватьАдресноеХранение,
																			ИспользоватьАдресноеХранениеСправочно,
																			ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

Процедура СогласоватьЗначенияПризнаков() Экспорт
	Если Не ЗначениеЗаполнено(НастройкаАдресногоХранения)
		Или НастройкаАдресногоХранения = Перечисления.НастройкиАдресногоХранения.ОпределяетсяНастройкамиПомещения Тогда
		НастройкаАдресногоХранения = Перечисления.НастройкиАдресногоХранения.НеИспользовать;
	КонецЕсли;
	
	Если НастройкаАдресногоХранения = Перечисления.НастройкиАдресногоХранения.НеИспользовать Тогда
		ИспользоватьАдресноеХранение 			= Ложь;
		ИспользоватьАдресноеХранениеСправочно 	= Ложь;
	ИначеЕсли НастройкаАдресногоХранения = Перечисления.НастройкиАдресногоХранения.ЯчейкиОстатки Тогда
		ИспользоватьАдресноеХранение 			= Истина;
		ИспользоватьАдресноеХранениеСправочно 	= Ложь;
	ИначеЕсли НастройкаАдресногоХранения = Перечисления.НастройкиАдресногоХранения.ЯчейкиСправочно Тогда
		ИспользоватьАдресноеХранение 			= Ложь;
		ИспользоватьАдресноеХранениеСправочно 	= Истина;
	Иначе
		ИспользоватьАдресноеХранение 			= Ложь;
		ИспользоватьАдресноеХранениеСправочно 	= Ложь;
	КонецЕсли;
	
	Если Не ИспользоватьАдресноеХранение
		И Не ИспользоватьАдресноеХранениеСправочно Тогда
		НастройкаАдресногоХранения = Перечисления.ИспользованиеСкладскихРабочихУчастков.НеИспользовать;
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли