////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураУстанавливаемыхПараметров = Новый Структура;
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
		
		УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
		Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияУТ.ПолучитьКартинкуКомментария(Объект.Комментарий);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияУТ.ПолучитьКартинкуКомментария(Объект.Комментарий);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияУТ.ПолучитьКартинкуКомментария(Объект.Комментарий);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОтменитьВыделенныеСтроки(Команда)
	Если Объект.СкладскиеЯчейки.Количество() = 0 Тогда
		Предупреждение(НСтр("ru='Таблица складских ячеек не заполнена.'"));
		Возврат;
	ИначеЕсли Элементы.СкладскиеЯчейки.ВыделенныеСтроки.Количество() = 0 Тогда
		Предупреждение(НСтр("ru='В таблице складских ячеек отсутствуют выделенные строки.'"));
		Возврат;
	КонецЕсли;
	Для Каждого ТекСтрока Из Элементы.СкладскиеЯчейки.ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = Объект.СкладскиеЯчейки.НайтиПоИдентификатору(ТекСтрока);
		
		Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицы.Отменено = Истина;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеСтроки(Команда)
	Если Объект.СкладскиеЯчейки.Количество() = 0 Тогда
		Предупреждение(НСтр("ru='Таблица складских ячеек не заполнена.'"));
		Возврат;
	КонецЕсли;
	Для Каждого ТекСтрока Из Объект.СкладскиеЯчейки Цикл
		
		Если ТекСтрока <> Неопределено Тогда
				ТекСтрока.Отменено = Истина;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры



