
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОбъектов = Новый Массив;
	Для Каждого ЭлементМассива Из ПараметрКоманды Цикл
		МассивОбъектов.Добавить(Новый Структура("ПравилоОбмена, Устройство", ЭлементМассива, Неопределено));
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline",
		"КодыТоваров",
		МассивОбъектов,
		Неопределено,
		Неопределено
	);
	
КонецПроцедуры // ОбработкаКоманды()
