////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//установить отбор по партнеру
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ПервыйПартнер") Тогда

		СтандартнаяОбработка = Ложь;
		Партнер              = Параметры.Отбор.ПервыйПартнер;
		ОтборПартнеров       = Список.Отбор.Элементы[0];

		ОтборПартнера1 = ОтборПартнеров.Элементы[0];
		ОтборПартнера1.ПравоеЗначение = Партнер;
		ОтборПартнера1.Использование  = Истина;

		ОтборПартнера2 = ОтборПартнеров.Элементы[1];
		ОтборПартнера2.ПравоеЗначение = Партнер;
		ОтборПартнера2.Использование  = Истина;

		ОтборПартнеров.Использование  = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Если НЕ Копирование Тогда
		//отменить стандартную обработку и параметризовать форму нового
		Отказ = Истина;
		НовыйПратнер = ОткрытьФормуМодально("РегистрСведений.СвязиМеждуПартнерами.ФормаЗаписи",
		Новый Структура("Партнер", Партнер));
	КонецЕсли;

КонецПроцедуры
