////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НачальныйПризнакВыполнения = Объект.Выполнена;
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ЗаданиеОбъект = ЗадачаОбъект.БизнесПроцесс.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ЗаданиеОбъект, "Задание");

	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.СрокИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	Элементы.СрокНачалаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	Элементы.ДатаИсполнения.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");

	БизнесПроцессыИЗадачиСервер.ФормаЗадачиПриСозданииНаСервере(
		ЭтаФорма, Объект, Элементы.ГруппаСостояние, Элементы.ДатаИсполнения
	);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.Ссылка
	               |ИЗ
	               |	Документ.ЗаказПоставщику.ДополнительныеУслуги КАК ЗаказПоставщикуТовары
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.ЗаказКлиента = &АК_ЗаказКлиента
	               |	И ЗаказПоставщикуТовары.Ссылка.АК_ТипУслуги = &АК_ТипУслуги
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПоставщикуТовары.Ссылка";
	
	Запрос.УстановитьПараметр("АК_ЗаказКлиента", Задание.ЗаказКлиента);
	Запрос.УстановитьПараметр("АК_ТипУслуги", Перечисления.АК_ТипУслуги.Монтаж);

	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДокументОбъект = Задание.Ссылка.ПолучитьОбъект();
	ДокументОбъект.ЗаказыПоставщика.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументОбъект.ЗаказыПоставщика.Добавить();
		НоваяСтрока.Документ = Выборка.Ссылка;
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.Документ = Выборка.Ссылка;
	КонецЦикла;
	ДокументОбъект.Записать();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтаФорма);
КонецПроцедуры

// ЭТАП ПОВТОРНОЙ ОБРАБОТКИ ЗАКАЗА

&НаКлиенте
Процедура ПовтонаяОбработка(Команда)
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтаФорма,ИСТИНА,Новый Структура("ЗаказКлиента",Задание.ЗаказКлиента));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОткрытия",ПредопределенноеЗначение("Перечисление.АК_ТипУслуги.Монтаж"));
	ПараметрыФормы.Вставить("Заказ",Задание.ЗаказКлиента);
	ОткрытьФорму("Обработка.ФормированиеЗаказовНаДоставкуИлиМонтаж.Форма", ПараметрыФормы);

КонецПроцедуры


