////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотПереопределяемый: сервер, внешнее соединение
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Вызывается при создании форм документов Документооборота. Позволяет выполнить дополнительные действия
//Параметры:
//	Форма - форма документа Документооборота
Процедура ДополнительнаяОбработкаФормыДокумента(Форма) Экспорт
	
	//Установим доступ к полю состояние по режиму работы
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Форма.ВнешнийОбъект) И Константы.ИспользоватьСогласованиеЧерез1СДокументооборот.Получить() Тогда
		Форма.Элементы.Состояние.ТолькоПросмотр = Истина;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

//Вызывается при создании форм бизнес-процессов 1С:Документооборота. Позволяет выполнить дополнительные действия
//Параметры:
//	Форма - форма бизнес-процесса Документооборота
Процедура ДополнительнаяОбработкаФормыБизнесПроцесса(Форма) Экспорт
	
	
	
КонецПроцедуры

//Вызывается при создании формы задачи Документооборота. Позволяет выполнить дополнительные действия
//Параметры:
//	Форма - форма задачи Документооборота
Процедура ДополнительнаяОбработкаФормыЗадачи(Форма) Экспорт
	
	
	
КонецПроцедуры

//Заполняет свойства объекта XDTO из реквизитов объекта потребителя
Процедура ЗаполнитьРеквизитыИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт 
	
	
	
КонецПроцедуры

//Заполняет параметры МенеджерПечати, ИмяФормы и ПараметрыКоманды по заданным условиям
//Параметры:
//	ОбъектПечати - строковое представление типа объекта, по которым формируются команды печати
//  МенеджерПечати - строковое представление менеджера печати объекта
//	ИмяКоманды - имя команды менеждера печати
//	ИмяФормы - имя макета печатной формы
//  ПараметрыКоманды - структура параметров команды печати
Процедура ПолучитьПараметрыПрисоединяемойПечатнойФормы(ОбъектПечати, МенеджерПечати, ИмяКоманды, ИмяФормы, ПараметрыКоманды) Экспорт

	Если МенеджерПечати = "Документ.АвансовыйОтчет" Тогда
		Если ИмяКоманды = "ПечатьАвансовогоОтчета" Тогда
			ИмяФормы = "АвансовыйОтчет";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.АктВыполненныхРабот" Тогда
		Если ИмяКоманды = "ПечатьАктВыполненныхРабот" Тогда
			ИмяФормы = "Акт";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.АктОРасхожденияхПриПоступленииТоваров" Тогда
		Если ИмяКоманды = "ПечатьТОРГ2" Тогда
			ИмяФормы = "ТОРГ2";
			ПараметрыКоманды = новый Структура("ПечатьВНоменклатуреПоставщика", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ3" Тогда
			ИмяФормы = "ТОРГ3";
			ПараметрыКоманды = новый Структура("ПечатьВНоменклатуреПоставщика", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ2ВНоменклатуреПоставщика" Тогда
			ИмяФормы = "ТОРГ2";
			ПараметрыКоманды = новый Структура("ПечатьВНоменклатуреПоставщика", Истина);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ3ВНоменклатуреПоставщика" Тогда
			ИмяФормы = "ТОРГ3";
			ПараметрыКоманды = новый Структура("ПечатьВНоменклатуреПоставщика", Истина);
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.АктПриемкиТоваров" Тогда
		Если ИмяКоманды = "ПечатьТОРГ1" Тогда
			ИмяФормы = "ТОРГ1";
			ПараметрыКоманды = новый Структура("ПечатьВНоменклатуреПоставщика", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ1ВНоменклатуреПоставщика" Тогда
			ИмяФормы = "ТОРГ1";
			ПараметрыКоманды = новый Структура("ПечатьВНоменклатуреПоставщика", Истина);
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.БригадныйНаряд" Тогда
		Если ИмяКоманды = "ПечатьБригадногоНаряда" Тогда
			ИмяФормы = "БригадныйНаряд";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВедомостьНаВыплатуЗарплатыВБанк" Тогда
		Если ИмяКоманды = "ПечатьСписокПеречислений" Тогда
			ИмяФормы = "СписокПеречислений";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВедомостьНаВыплатуЗарплатыВКассу" Тогда
		Если ИмяКоманды = "ПечатьТ53" Тогда
			ИмяФормы = "Т53";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением" Тогда
		Если ИмяКоманды = "ПечатьСписокПеречислений" Тогда
			ИмяФормы = "СписокПеречислений";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком" Тогда
		Если ИмяКоманды = "ПечатьТ53" Тогда
			ИмяФормы = "Т53";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВедомостьУплатыАДВ_11" Тогда
		Если ИмяКоманды = "ПечатьАДВ_11" Тогда
			ИмяФормы = "ФормаАДВ_11";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВнутреннееПотреблениеТоваров" Тогда
		Если ИмяКоманды = "ПечатьВнутреннегоПотребленияТоваров" Тогда
			ИмяФормы = "ВнутреннееПотреблениеТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВозвратТоваровМеждуОрганизациями" Тогда
		Если ИмяКоманды = "ПечатьВозвратПоставщику" Тогда
			ИмяФормы = "ВозвратПоставщику";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВозвратТоваровОтКлиента" Тогда
		Если ИмяКоманды = "ПечатьВозвратОтКлиента" Тогда
			ИмяФормы = "ВозвратОтКлиента";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВозвратТоваровПоставщику" Тогда
		Если ИмяКоманды = "ПечатьВозвратПоставщику" Тогда
			ИмяФормы = "ВозвратПоставщику";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ВыпускПродукции" Тогда
		Если ИмяКоманды = "ПечатьНакладная" Тогда
			ИмяФормы = "Накладная";
		ИначеЕсли ИмяКоманды = "ПечатьМХ18" Тогда
			ИмяФормы = "МХ18";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ДоверенностьНаПолучениеТоваров" Тогда
		Если ИмяКоманды = "ПечатьДоверенностьМ2" Тогда
			ИмяФормы = "М2";
			ПараметрыКоманды = новый Структура("Тип", "ДоверенностьМ2");
		ИначеЕсли ИмяКоманды = "ПечатьДоверенностьМ2а" Тогда
			ИмяФормы = "М2";
			ПараметрыКоманды = новый Структура("Тип", "ДоверенностьМ2а");
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЗаданиеНаПеревозку" Тогда
		Если ИмяКоманды = "ПечатьМаршрутногоЛиста" Тогда
			ИмяФормы = "МаршрутныйЛист";
		ИначеЕсли ИмяКоманды = "ПечатьТТН" Тогда
			ИмяФормы = "ТТН";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЗаданиеТорговомуПредставителю" Тогда
		Если ИмяКоманды = "ПечатьБланкаЗадания" Тогда
			ИмяФормы = "БланкЗадания";
		ИначеЕсли ИмяКоманды = "ПечатьСводногоЗадания" Тогда
			ИмяФормы = "СводноеЗадание";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЗаказКлиента" Тогда
		Если ИмяКоманды = "ПечатьЗаказКлиента" Тогда
			ИмяФормы = "ЗаказКлиента";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЗаказНаПеремещение" Тогда
		Если ИмяКоманды = "ПечатьЗаказНаПеремещение" Тогда
			ИмяФормы = "ЗаказНаПеремещение";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЗаказПоставщику" Тогда
		Если ИмяКоманды = "ПечатьЗаказПоставщику" Тогда
			ИмяФормы = "ЗаказПоставщику";
			ПараметрыКоманды = новый Структура("Тип", "ЗаказПоставщику");
		ИначеЕсли ИмяКоманды = "ПечатьЗаказПоставщикуПоДаннымПоставщика" Тогда
			ИмяФормы = "ЗаказПоставщикуПоДаннымПоставщика";
			ПараметрыКоманды = новый Структура("Тип", "ЗаказПоставщикуПоДаннымПоставщика");
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		Если ИмяКоманды = "ПечатьЗаявкаНаВозврат" Тогда
			ИмяФормы = "ЗаявкаНаВозврат";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ИнвентаризацияОС" Тогда
		Если ИмяКоманды = "ПечатьИНВ1" Тогда
			ИмяФормы = "ИНВ1";
		ИначеЕсли ИмяКоманды = "ПечатьИНВ18" Тогда
			ИмяФормы = "ИНВ18";
		ИначеЕсли ИмяКоманды = "ПечатьИНВ22" Тогда
			ИмяФормы = "ИНВ22";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий" Тогда
		Если ИмяКоманды = "ПечатьСправкиПоУтвержденнойФорме" Тогда
			ИмяФормы = "Справка";
		ИначеЕсли ИмяКоманды = "ПечатьСправкиПоРасширеннойФорме" Тогда
			ИмяФормы = "СправкаРасширенная";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.КассоваяКнига" Тогда
		Если ИмяКоманды = "ПечатьЛистаКассовойКиги" Тогда
			ИмяФормы = "КассоваяКнига";
		ИначеЕсли ИмяКоманды = "ПечатьТитульногоЛистаИПоследнейСтраницы" Тогда
			ИмяФормы = "Обложка";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.КоммерческоеПредложениеКлиенту" Тогда
		Если ИмяКоманды = "ПечатьКоммерческоеПредложениеMXL" Тогда
			ИмяФормы = "КоммерческоеПредложение";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.КорректировкаРеализации" Тогда
		Если ИмяКоманды = "ПечатьРеализацияТоваров" Тогда
			ИмяФормы = "Накладная";
		ИначеЕсли ИмяКоманды = "ПечатьРеестрНомеровГТД" Тогда
			ИмяФормы = "РеестрНомеровГТД";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.МодернизацияОС" Тогда
		Если ИмяКоманды = "ПечатьОС3" Тогда
			ИмяФормы = "ОС3";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОперацияБух" Тогда
		Если ИмяКоманды = "ПечатьБухгалтерскаяСправка" Тогда
			ИмяФормы = "БухгалтерскаяСправка";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОписьПачекСЗВ_6" Тогда
		Если ИмяКоманды = "ПечатьАДВ_6_2" Тогда
			ИмяФормы = "ФормаАДВ_6_2";
		ИначеЕсли ИмяКоманды = "ПечатьСЗВ_6" Тогда
			ИмяФормы = "ФормаСЗВ_6_1,ФормаСЗВ_6_2";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОприходованиеИзлишковТоваров" Тогда
		Если ИмяКоманды = "ПечатьАктаОбОприходованииТоваров" Тогда
			ИмяФормы = "АктОбОприходованииТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОрдерНаОтражениеИзлишковТоваров" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "ОрдерНаОтражениеИзлишковТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОрдерНаОтражениеНедостачТоваров" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "ОрдерНаОтражениеНедостачТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОрдерНаОтражениеПорчиТоваров" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "ОрдерНаОтражениеПорчиТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "ОрдерНаОтражениеРезультатовПересчетовТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОрдерНаПеремещениеТоваров" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "ОрдерНаПеремещениеТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОтборРазмещениеТоваров" Тогда
		Если ИмяКоманды = "ПечатьЗадания" Тогда
			ИмяФормы = "СкладскоеЗадание";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОтчетКомитенту" Тогда
		Если ИмяКоманды = "ПечатьАктОбОказанииУслуг" Тогда
			ИмяФормы = "Акт";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ОтчетОРозничныхПродажах" Тогда
		Если ИмяКоманды = "ПечатьКМ6" Тогда
			ИмяФормы = "КМ6";
		ИначеЕсли ИмяКоманды = "ПечатьКМ3" Тогда
			ИмяФормы = "КМ3";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовАДВ_1" Тогда
		Если ИмяКоманды = "ПечатьАДВ_1" Тогда
			ИмяФормы = "ФормаАДВ_1";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_1" Тогда
			ИмяФормы = "ФормаАДВ_6_1";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаАДВ_1,ФормаАДВ_6_1";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовАДВ_2" Тогда
		Если ИмяКоманды = "ПечатьАДВ_2" Тогда
			ИмяФормы = "ФормаАДВ_2";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_1" Тогда
			ИмяФормы = "ФормаАДВ_6_1";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаАДВ_2,ФормаАДВ_6_1";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовАДВ_3" Тогда
		Если ИмяКоманды = "ПечатьАДВ_3" Тогда
			ИмяФормы = "ФормаАДВ_3";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_1" Тогда
			ИмяФормы = "ФормаАДВ_6_1";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаАДВ_3,ФормаАДВ_6_1";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовСЗВ_6_1" Тогда
		Если ИмяКоманды = "ПечатьСЗВ_6_1" Тогда
			ИмяФормы = "ФормаСЗВ_6_1";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_3" Тогда
			ИмяФормы = "ФормаАДВ_6_3";
		ИначеЕсли ИмяКоманды = "ПечатьСпискаЗастрахованныхЛиц" Тогда
			ИмяФормы = "СписокЗастрахованныхЛиц";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаСЗВ_6_1,ФормаАДВ_6_3,СписокЗастрахованныхЛиц";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовСЗВ_6_3" Тогда
		Если ИмяКоманды = "ПечатьСЗВ_6_3" Тогда
			ИмяФормы = "ФормаСЗВ_6_3";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_4" Тогда
			ИмяФормы = "ФормаАДВ_6_4";
		ИначеЕсли ИмяКоманды = "ФормаСЗВ_6_3,ФормаАДВ_6_4" Тогда
			ИмяФормы = "ВсеФормы";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовСЗВ_К" Тогда
		Если ИмяКоманды = "ПечатьСЗВ_К" Тогда
			ИмяФормы = "ФормаСЗВ_К";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_1" Тогда
			ИмяФормы = "ФормаАДВ_6_1";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаСЗВ_К,ФормаАДВ_6_1";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПачкаДокументовСПВ_1" Тогда
		Если ИмяКоманды = "ПечатьСПВ_1" Тогда
			ИмяФормы = "ФормаСПВ_1";
		ИначеЕсли ИмяКоманды = "ПечатьАДВ_6_3" Тогда
			ИмяФормы = "ФормаАДВ_6_3";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаСПВ_1,ФормаАДВ_6_3";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПередачаОборудованияВМонтаж" Тогда
		Если ИмяКоманды = "ПечатьОС15" Тогда
			ИмяФормы = "ОС15";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПеремещениеОС" Тогда
		Если ИмяКоманды = "ПечатьОС2" Тогда
			ИмяФормы = "ОС2";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПеремещениеТоваров" Тогда
		Если ИмяКоманды = "ПечатьНакладнаяНаПеремещение" Тогда
			ИмяФормы = "НакладнаяНаПеремещение";
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ13" Тогда
			ИмяФормы = "ТОРГ13";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПересортицаТоваров" Тогда
		Если ИмяКоманды = "ПечатьАктПересортицыТоваров" Тогда
			ИмяФормы = "АктПересортицыТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПересчетТоваров" Тогда
		Если ИмяКоманды = "ПечатьЗадания" Тогда
			ИмяФормы = "ЗаданиеНаПересчет";
			ПараметрыКоманды = новый Структура("ВыводитьГрадацииКачества, ВыводитьРезультатыПересчета", Ложь, Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьЗаданияПорча" Тогда
			ИмяФормы = "ЗаданиеНаПересчет";
			ПараметрыКоманды = новый Структура("ВыводитьГрадацииКачества, ВыводитьРезультатыПересчета", Истина, Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьРезультатовПересчетаТоваров" Тогда
			ИмяФормы = "ЗаданиеНаПересчет";
			ПараметрыКоманды = новый Структура("ВыводитьГрадацииКачества, ВыводитьРезультатыПересчета", Ложь, Истина);
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПорчаТоваров" Тогда
		Если ИмяКоманды = "ПечатьТОРГ15" Тогда
			ИмяФормы = "ТОРГ15";
		ИначеЕсли ИмяКоманды = "ПечатьАктаПорчиТоваров" Тогда
			ИмяФормы = "АктПорчиТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПоступлениеТоваровУслуг" Тогда
		Если ИмяКоманды = "ПечатьПоступлениеТоваров" Тогда
			ИмяФормы = "Накладная";
		ИначеЕсли ИмяКоманды = "ПечатьПриходнаяНакладная" Тогда
			ИмяФормы = "ПриходнаяНакладная";
		ИначеЕсли ИмяКоманды = "ПечатьАктОбОказанииУслуг" Тогда
			ИмяФормы = "Акт";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПринятиеКУчетуОС" Тогда
		Если ИмяКоманды = "ПечатьОС1" Тогда
			ИмяФормы = "ОС1";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПриходныйКассовыйОрдер" Тогда
		Если ИмяКоманды = "ПечатьПКО" Тогда
			ИмяФормы = "КО1";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПриходныйОрдерНаТовары" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "ПриходныйОрдерНаТовары";
		ИначеЕсли ИмяКоманды = "ПечатьБланкаПриемки" Тогда
			ИмяФормы = "БланкПриемкиТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ПрочееОприходованиеТоваров" Тогда
		Если ИмяКоманды = "ПечатьОприходованиеТоваров" Тогда
			ИмяФормы = "Накладная";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.РасходныйКассовыйОрдер" Тогда
		Если ИмяКоманды = "ПечатьРКО" Тогда
			ИмяФормы = "КО2";
		ИначеЕсли ИмяКоманды = "ПечатьОбъявлениеНаВзносНаличными" Тогда
			ИмяФормы = "ОбъявлениеНаВзносНаличными";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.РасходныйОрдерНаТовары" Тогда
		Если ИмяКоманды = "ПечатьОрдера" Тогда
			ИмяФормы = "РасходныйОрдерНаТовары";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.РеализацияТоваровУслуг" Тогда
		Если ИмяКоманды = "ПечатьРеализацияТоваров" Тогда
			ИмяФормы = "Накладная";
		ИначеЕсли ИмяКоманды = "ПечатьРасходнаяНакладная" Тогда
			ИмяФормы = "РасходнаяНакладная";
		ИначеЕсли ИмяКоманды = "ПечатьРеестрНомеровГТД" Тогда
			ИмяФормы = "РеестрНомеровГТД";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.РеестрДСВ_3" Тогда
		Если ИмяКоманды = "ПечатьДСВ_3" Тогда
			ИмяФормы = "Реестр";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.РеестрСЗВ_6_2" Тогда
		Если ИмяКоманды = "ПечатьСЗВ_6_2" Тогда
			ИмяФормы = "ФормаСЗВ_6_2";
		ИначеЕсли ИмяКоманды = "ПечатьСпискаЗастрахованныхЛиц" Тогда
			ИмяФормы = "СписокЗастрахованныхЛиц";
		ИначеЕсли ИмяКоманды = "ПечатьВсеФормы" Тогда
			ИмяФормы = "ФормаСЗВ_6_2,СписокЗастрахованныхЛиц";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СборкаТоваров" Тогда
		Если ИмяКоманды = "ПечатьСборкаТоваров" Тогда
			ИмяФормы = "СборкаТоваров";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СверкаВзаиморасчетов" Тогда
		Если ИмяКоманды = "ПечатьАктаСверкиВзаимныхРасчетов" Тогда
			ИмяФормы = "АктСверкиВзаимныхРасчетов";
		ИначеЕсли ИмяКоманды = "ПечатьАктаСверкиВзаимныхРасчетовСДаннымиКонтрагента" Тогда
			ИмяФормы = "АктСДаннымиКонтрагента";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СписаниеБезналичныхДенежныхСредств" Тогда
		Если ИмяКоманды = "ПечатьПлатежногоПоручения" Тогда
			ИмяФормы = "ПлатежноеПоручение";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СписаниеНедостачТоваров" Тогда
		Если ИмяКоманды = "ПечатьАктСписанияТоваров" Тогда
			ИмяФормы = "АктСписанияТоваров";
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ16" Тогда
			ИмяФормы = "ТОРГ16";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СписаниеОС" Тогда
		Если ИмяКоманды = "ПечатьОС4" Тогда
			ИмяФормы = "ОС4";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СправкаНДФЛ" Тогда
		Если ИмяКоманды = "Печать2НДФЛ" Тогда
			ИмяФормы = "Форма2НДФЛс2010";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.СправкиНДФЛДляПередачиВНалоговыйОрган" Тогда
		Если ИмяКоманды = "Печать2НДФЛ" Тогда
			ИмяФормы = "Форма2НДФЛс2010";
		ИначеЕсли ИмяКоманды = "ПечатьРеестра" Тогда
			ИмяФормы = "Реестр2011";
		ИначеЕсли ИмяКоманды = "ПечатьРеестраДополнительный" Тогда
			ИмяФормы = "Реестр2011Дополнительный";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ТабельУчетаРабочегоВремени" Тогда
		Если ИмяКоманды = "ПечатьТ13" Тогда
			ИмяФормы = "УнифицированнаяФормаТ13";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Документ.ЧекККМВозврат" Тогда
		Если ИмяКоманды = "ПечатьКМ3" Тогда
			ИмяФормы = "КМ3";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьАктОбОказанииУслуг" Тогда
		Если ИмяКоманды = "ПечатьАктОбОказанииУслуг" Тогда
			ИмяФормы = "Акт";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьЗаданияНаОтборРазмещениеТоваров" Тогда
		Если ИмяКоманды = "ЗаданиеНаОтборРазмещениеТовара" Тогда
			ИмяФормы = "ЗаданиеНаОтборРазмещениеТовара";
			ПараметрыКоманды = новый Структура("ИмяФормы","ЗаданиеНаРазмещение");
		ИначеЕсли ИмяКоманды = "ПечатьЗаданияНаОтборТоваров" Тогда
			ИмяФормы = "ЗаданиеНаОтборРазмещениеТовара";
			ПараметрыКоманды = новый Структура("ИмяФормы","ЗаданиеНаОтбор");
		ИначеЕсли ИмяКоманды = "ПечатьЗаданияНаПересчетТоваров" Тогда
			ИмяФормы = "ЗаданиеНаОтборРазмещениеТовара";
			ПараметрыКоманды = новый Структура("ИмяФормы","ЗаданиеНаПересчет");
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьЗаявленияНаВозвратТоваровОтКлиента" Тогда
		Если ИмяКоманды = "ПечатьЗаявленияНаВозвратТоваровОтКлиента" Тогда
			ИмяФормы = "ЗаявлениеНаВозвратТоваровОтКлиента";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьМ11" Тогда
		Если ИмяКоманды = "ПечатьМ11" Тогда
			ИмяФормы = "М11";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьОбщихФорм" Тогда
		Если ИмяКоманды = "ПечатьСчетФактура" Тогда
			ИмяФормы = "СчетФактура";
			ПараметрыКоманды = новый Структура("ПечатьВВалюте", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьСчетФактураВВалюте" Тогда
			ИмяФормы = "СчетФактураВВалюте";
			ПараметрыКоманды = новый Структура("ПечатьВВалюте", Истина);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ12" Тогда
			ИмяФормы = "ТОРГ12";
			ПараметрыКоманды = новый Структура("ВыводитьУслуги", Истина);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ12БезУслуг" Тогда
			ИмяФормы = "ТОРГ12";
			ПараметрыКоманды = новый Структура("ВыводитьУслуги", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ12_ГТД" Тогда
			ИмяФормы = "ТОРГ12";
			ПараметрыКоманды = новый Структура("ВыводитьУслуги, ВыводитьГТД", Ложь, Истина);
		ИначеЕсли ИмяКоманды = "ПечатьОтчетКомиссионера" Тогда
			ИмяФормы = "ОтчетКомиссионера";
		ИначеЕсли ИмяКоманды = "ПечатьОтчетКомиссионераСписание" Тогда
			ИмяФормы = "ОтчетКомиссионераСписание";
		ИначеЕсли ИмяКоманды = "ПечатьОтчетКомитенту" Тогда
			ИмяФормы = "ОтчетКомиссионера";
		ИначеЕсли ИмяКоманды = "ПечатьОтчетКомитентуСписание" Тогда
			ИмяФормы = "ОтчетКомиссионераСписание";
		ИначеЕсли ИмяКоманды = "ПечатьСчетФактураКомитента" Тогда
			ИмяФормы = "СчетФактура";
			ПараметрыКоманды = новый Структура("ВидФормы, ПечатьВВалюте", "Комитент", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьСчетФактураКомитентаВВалюте" Тогда
			ИмяФормы = "СчетФактураВВалюте";
			ПараметрыКоманды = новый Структура("ВидФормы, ПечатьВВалюте", "Комитент", Истина) ;
		ИначеЕсли ИмяКоманды = "ПечатьСчетФактураКомиссионера" Тогда
			ИмяФормы = "СчетФактура";
			ПараметрыКоманды = новый Структура("ВидФормы, ПечатьВВалюте", "Комиссионер", Ложь);
		ИначеЕсли ИмяКоманды = "ПечатьСчетФактураКомиссионераВВалюте" Тогда
			ИмяФормы = "СчетФактураВВалюте";
			ПараметрыКоманды = новый Структура("ВидФормы, ПечатьВВалюте", "Комиссионер", Истина);
		ИначеЕсли ИмяКоманды = "ПечатьМ15" Тогда
			ИмяФормы = "М15";
		ИначеЕсли ИмяКоманды = "ПечатьМ4" Тогда
			ИмяФормы = "М4";
		ИначеЕсли ИмяКоманды = "ПечатьТОРГ4" Тогда
			ИмяФормы = "ТОРГ4";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьСчетовНаОплату" Тогда
		Если ИмяКоманды = "ПечатьСчетНаОплатуПоЗаказуЗаявке" Тогда
			ИмяФормы = "СчетНаОплату";
		ИначеЕсли ИмяКоманды = "ПечатьСчетНаОплату" Тогда
			ИмяФормы = "СчетНаОплату";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьТоварногоЧека" Тогда
		Если ИмяКоманды = "ПечатьОтчетОРозничныхПродажах" Тогда
			ИмяФормы = "ТоварныйЧек";
		ИначеЕсли ИмяКоманды = "ПечатьТоварныйЧек" Тогда
			ИмяФормы = "ТоварныйЧек";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьТранспортнойНакладной" Тогда
		Если ИмяКоманды = "ПечатьТранспортнойНакладной" Тогда
			ИмяФормы = "ТранспортнаяНакладная";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьТТН" Тогда
		Если ИмяКоманды = "ПечатьТТН" Тогда
			ИмяФормы = "ТТН";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная" Тогда
		Если ИмяКоманды = "ПечатьПриказаОбУвольнении" Тогда
			МенеджерПечати = "Обработка.ПечатьКадровыхПриказов";
			ИмяФормы = "ПФ_MXL_Т8";
		ИначеЕсли ИмяКоманды = "ПечатьПриказаОПереводе" Тогда
			МенеджерПечати = "Обработка.ПечатьКадровыхПриказов";
			ИмяФормы = "ПФ_MXL_Т5";
		ИначеЕсли ИмяКоманды = "ПечатьПриказаОПриемеНаРаботу" Тогда
			МенеджерПечати = "Обработка.ПечатьКадровыхПриказов";
			ИмяФормы = "ПФ_MXL_Т1";
		ИначеЕсли ИмяКоманды = "ПечатьПриказаОПредоставленииОтпуска" Тогда
			ИмяФормы = "ПФ_MXL_Т6";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Обработка.ПечатьКадровыхПриказов" Тогда
		Если ИмяКоманды = "ПечатьПриказаОбУвольнении" Тогда
			ИмяФормы = "ПФ_MXL_Т8";
		ИначеЕсли ИмяКоманды = "ПечатьПриказаОПереводе" Тогда
			ИмяФормы = "ПФ_MXL_Т5";
		ИначеЕсли ИмяКоманды = "ПечатьПриказаОПриемеНаРаботу" Тогда
			ИмяФормы = "ПФ_MXL_Т1";
		ИначеЕсли ИмяКоманды = "ПечатьПриказаОПредоставленииОтпуска" Тогда
			ИмяФормы = "ПФ_MXL_Т6";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Справочник.ДоверенностиНалогоплательщика" Тогда
		Если ИмяКоманды = "Печать" Тогда
			ИмяФормы = "ДоверенностьНалогоплательщика";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Справочник.КартыЛояльности" Тогда
		Если ИмяКоманды = "ПечатьАнкетаMXL" Тогда
			ИмяФормы = "Анкета";
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Справочник.ОсновныеСредства" Тогда
		Если ИмяКоманды = "ПечатьОС6_2003" Тогда
			ИмяФормы = "ОС6";
			ПараметрыКоманды = Новый Структура;
			ПараметрыКоманды.Вставить("ДатаСведений", ОбъектПечати.ДатаСведений);
		КонецЕсли;
	ИначеЕсли МенеджерПечати = "Справочник.СоглашенияСКлиентами" Тогда
		Если ИмяКоманды = "ПечатьСоглашениеСКлиентом" Тогда
			ИмяФормы = "СоглашениеСКлиентом";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Получает таблицу менеджеров печати форм объектов
Процедура ЗаполнитьТаблицуМенеджеровПечатиОбъекта(МенеджерОбъекта, ПечатныеФормы) Экспорт
	
	Исключения = новый Массив;
	Исключения.Добавить("ПечатьАктMicrosoftWord");
	Исключения.Добавить("ПечатьСписокПеречисленийMSWord");
	Исключения.Добавить("ПечатьСписокПеречисленийOOWriter");
	Исключения.Добавить("ПечатьТ53MSWord");
	Исключения.Добавить("ПечатьТ53OOWriter");
	Исключения.Добавить("ПечатьАктаВзаимозачетаMicrosoftWord");
	Исключения.Добавить("ПечатьАктаПереуступкиДолгаMicrosoftWord");
	Исключения.Добавить("ПечатьКоммерческоеПредложениеMicrosoftWord");
	Исключения.Добавить("ПечатьКоммерческоеПредложениеOpenOfficeOrgWriter");
	Исключения.Добавить("ПечатьАнкетаMicrosoftWord");
	Исключения.Добавить("ПечатьАнкетаOpenOfficeOrgWriter");
	Исключения.Добавить("ПечатьЭтикетокСкладскиеЯчейки");
	Исключения.Добавить("ПечатьЭтикетокДоставки");
	Исключения.Добавить("ПечатьЦенниковТовары");
	Исключения.Добавить("ПечатьЭтикетокТовары");
	Исключения.Добавить("ПечатьПереоценкаВРознице");
	Исключения.Добавить("ПечатьУстановкаЦенНоменклатуры");
	Исключения.Добавить("ПечатьКодыТоваров");
	Исключения.Добавить("ПечатьИНВ3");
	Исключения.Добавить("ПечатьИНВ19");
	Исключения.Добавить("ПечатьМаршрутныйЛист");
	Исключения.Добавить("ПечатьПриказаОбУвольненииMSWord");
	Исключения.Добавить("ПечатьПриказаОПереводеMSWord");
	Исключения.Добавить("ПечатьПриказаОПриемеНаРаботуMSWord");
	Исключения.Добавить("ПечатьПриказаОПредоставленииОтпускаMSWord");
	
	Если Найти(МенеджерОбъекта,"Документ.")<> 0 Тогда
		ОбъектМетаданные = Метаданные.Документы[СтрЗаменить(МенеджерОбъекта,"Документ.","")];
		ОбъектТип = Тип("ДокументСсылка."+СтрЗаменить(МенеджерОбъекта,"Документ.",""));
	ИначеЕсли Найти(МенеджерОбъекта,"Справочник.")<> 0 Тогда
		ОбъектМетаданные = Метаданные.Справочники[СтрЗаменить(МенеджерОбъекта,"Справочник.","")];
		ОбъектТип = Тип("СправочникСсылка."+СтрЗаменить(МенеджерОбъекта,"Справочник.",""));
	ИначеЕсли Найти(МенеджерОбъекта,"БизнесПроцесс.")<> 0 Тогда
		ОбъектМетаданные = Метаданные.Справочники[СтрЗаменить(МенеджерОбъекта,"БизнесПроцесс.","")];
		ОбъектТип = Тип("БизнесПроцессСсылка."+СтрЗаменить(МенеджерОбъекта,"БизнесПроцесс.",""));
	ИначеЕсли Найти(МенеджерОбъекта,"Задача.")<> 0 Тогда
		ОбъектМетаданные = Метаданные.Справочники[СтрЗаменить(МенеджерОбъекта,"Задача.","")];
		ОбъектТип = Тип("ЗадачаСсылка."+СтрЗаменить(МенеджерОбъекта,"Задача.",""));
	КонецЕсли;
	
	Для каждого Команда из ОбъектМетаданные.Команды Цикл
		Если Найти(Команда.Имя,"Печать") = 1 И Команда.ТипПараметраКоманды.СодержитТип(ОбъектТип) Тогда
			Если Исключения.Найти(Команда.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НеВходитВФункциональныеОпции = Истина;
			ВходитВДоступнуюФункциональнуюОпцию = Ложь;
			Для каждого ФункциональнаяОпция из Метаданные.ФункциональныеОпции Цикл
				Если ФункциональнаяОпция.Состав.Найти(Команда) <> Неопределено Тогда
					НеВходитВФункциональныеОпции = Ложь;
					Если ПолучитьФункциональнуюОпцию(ФункциональнаяОпция.Имя) = Истина Тогда
						ВходитВДоступнуюФункциональнуюОпцию = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если НеВходитВФункциональныеОпции ИЛИ ВходитВДоступнуюФункциональнуюОпцию Тогда
				НоваяСтрока = ПечатныеФормы.Добавить();
				НоваяСтрока.МенеджерПечати = МенеджерОбъекта;
				НоваяСтрока.ИмяКоманды = Команда.Имя;
				НоваяСтрока.ПредставлениеКоманды = Команда.Синоним;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Обработка из Метаданные.Обработки Цикл
		Для каждого Команда из Обработка.Команды Цикл
			Если Найти(Команда.Имя,"Печать") = 1 И Команда.ТипПараметраКоманды.СодержитТип(ОбъектТип) Тогда
				Если Исключения.Найти(Команда.Имя) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НеВходитВФункциональныеОпции = Истина;
				ВходитВДоступнуюФункциональнуюОпцию = Ложь;
				Для каждого ФункциональнаяОпция из Метаданные.ФункциональныеОпции Цикл
					Если ФункциональнаяОпция.Состав.Найти(Команда) <> Неопределено Тогда
						НеВходитВФункциональныеОпции = Ложь;
						Если ПолучитьФункциональнуюОпцию(ФункциональнаяОпция.Имя) = Истина Тогда
							ВходитВДоступнуюФункциональнуюОпцию = Истина;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если НеВходитВФункциональныеОпции ИЛИ ВходитВДоступнуюФункциональнуюОпцию Тогда
					НоваяСтрока = ПечатныеФормы.Добавить();
					НоваяСтрока.МенеджерПечати = "Обработка."+Обработка.Имя;
					НоваяСтрока.ИмяКоманды = Команда.Имя;
					НоваяСтрока.ПредставлениеКоманды = Команда.Синоним;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Добавим дополнительные печатные формы
	ДоступныеКоманды = ДополнительныеОтчетыИОбработки.ПолучитьДоступныеКоманды(Истина, МенеджерОбъекта, Ложь,
		Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка(), Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма);

	Для каждого Команда из ДоступныеКоманды Цикл
		Если Команда.ВариантЗапуска = "ВызовСерверногоМетода" Тогда
			НоваяСтрока = ПечатныеФормы.Добавить();
			НоваяСтрока.МенеджерПечати = "ВнешняяПечатнаяФорма_" + СтрЗаменить(Строка(Команда.Ссылка.УникальныйИдентификатор()),"-","_");
			НедопустимыеСимволы = " (){}[]+=-|\/><.,*&^$#@!':;~`?";
			Идентификатор = Команда.Идентификатор;
			Для н = 1 по СтрДлина(НедопустимыеСимволы) Цикл
				СимволЗамены = Сред(НедопустимыеСимволы,н,1);
				Идентификатор = СтрЗаменить(Идентификатор,СимволЗамены,"_"+Формат(КодСимвола(СимволЗамены),"ЧГ=0")+"_");
			КонецЦикла;
				
			НоваяСтрока.ИмяКоманды = Идентификатор;
			НоваяСтрока.ПредставлениеКоманды = Команда.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Заполняет коллекцию печатных форм объекта по имени менеджера печати и команде менеджера печати
Процедура ЗаполнитьПечатныеФормы(ВнешнийОбъект, МенеджерПечати, КомандаМенеджера, КоллекцияПечатныхФорм) Экспорт
	
	МассивОбъектов = новый Массив;
	МассивОбъектов.Добавить(ВнешнийОбъект);
	
	ИмяМакета = "";
	ОбъектыПечати = неопределено;
	ПараметрыПечати = неопределено;
	ПараметрыВывода = неопределено;

	Если Сред(МенеджерПечати,1,20) = "ВнешняяПечатнаяФорма" Тогда
		Попытка
			СсылкаНаОбработку = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(новый УникальныйИдентификатор(СтрЗаменить(Сред(МенеджерПечати,22,36),"_","-")));
			НедопустимыеСимволы = " (){}[]+=-|\/><.,*&^$#@!':;~`?";
			ИдентификаторКоманды = КомандаМенеджера.ИмяКоманды;
			Для н = 1 по СтрДлина(НедопустимыеСимволы) Цикл
				СимволЗамены = Сред(НедопустимыеСимволы,н,1);
				ИдентификаторКоманды = СтрЗаменить(ИдентификаторКоманды,"_"+Формат(КодСимвола(СимволЗамены),"ЧГ=0")+"_",СимволЗамены);
			КонецЦикла;
			ПараметрыИсточника = новый Структура("ОбъектыНазначения, ИдентификаторКоманды", МассивОбъектов, ИдентификаторКоманды);
			
			УправлениеПечатьюПереопределяемый.ПечатьПоВнешнемуИсточнику(СсылкаНаОбработку,
			ПараметрыИсточника, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
		Исключение
			КоллекцияПечатныхФорм = новый ТаблицаЗначений;
		КонецПопытки;
	Иначе
		ИнтеграцияС1СДокументооборот.ПолучитьПараметрыПрисоединяемойПечатнойФормы(ВнешнийОбъект, МенеджерПечати, КомандаМенеджера.ИмяКоманды, ИмяМакета, ПараметрыПечати);
		Попытка
			УправлениеПечатью.СформироватьПечатныеФормы(МенеджерПечати, ИмяМакета, МассивОбъектов, ПараметрыПечати,
			КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		Исключение
			КоллекцияПечатныхФорм = новый ТаблицаЗначений;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

//Возвращает индекс картинки элемента справочника
//
Функция ИндексКартинкиЭлемента() Экспорт
	
	Возврат 3;
	
КонецФункции

//Возвращает признак состояния "Согласован" по данным документооборота
Функция ПолучитьСостояниеСогласованияВ1СДокументооборот(СсылкаНаОбъект) Экспорт
	
	Согласован = Ложь;
	
	Попытка
		Прокси = ИнтеграцияС1СДокументооборотВызовСервера.ПолучитьПрокси();
	Исключение
		Возврат Ложь; // Если нет соединения, вернем статус Ложь. 
	КонецПопытки;
	
	ExternalObject = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "ExternalObject");
	ExternalObject.id = Строка(СсылкаНаОбъект.УникальныйИдентификатор());
	ExternalObject.type = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	ExternalObject.name = Строка(СсылкаНаОбъект);
	
	Запрос = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMGetDocumentListRequest");
	Запрос.externalObjects.Добавить(ExternalObject);
	
	Запрос.columnSet.Добавить("status");
	
	Результат = Прокси.execute(Запрос);
	
	Если ИнтеграцияС1СДокументооборот.ПроверитьТип(Прокси, Результат, "DMError") Тогда 
		Возврат Ложь; // Произошла ошибка во время выполнения запроса
	КонецЕсли;	
		
	Если Результат.documents.Количество() > 0 Тогда 
		Объект = Результат.documents[0];
	Иначе 
		Возврат Ложь; // Нужного документа не оказалось.
	КонецЕсли;
	
	Если Объект.status.name = "Согласован" Тогда
		Согласован = Истина;
	Иначе 
		Согласован = Ложь;
	КонецЕсли;
		
	Возврат Согласован;
	
КонецФункции
