
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Отбор, ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
	
	ПараметрыФормы.Отбор = Новый Структура("Документ", ПараметрКоманды);
	ПараметрыФормы.КлючНазначенияИспользования = "Документ";
	ПараметрыФормы.КлючВарианта = "ОформлениеОтчетовПоКомиссии";
		
	ОткрытьФорму("Отчет.КонтрольПередачТоваровМеждуОрганизациями.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры
