////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементами();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// Общие справочники

&НаКлиенте
Процедура ОткрытьСпособыОбеспеченияПотребностей(Команда)
	
	ОткрытьФорму("Справочник.СпособыОбеспеченияПотребностей.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсточникиДанныхПланирования(Команда)
	
	ОткрытьФорму("Справочник.ИсточникиДанныхПланирования.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкаABCXYZКлассификации(Команда)
	
	ОткрытьФорму("Обработка.Классификация.Форма.НастройкаПараметровКлассификацииНоменклатуры", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкаРасчетаТоварныхОграничений(Команда)
	
	ОткрытьФорму("Обработка.Классификация.Форма.НастройкаПараметровРасчетаТоварныхОграничений", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификация(Команда)
	
	ОткрытьФорму("Обработка.Классификация.Форма.КлассификацияНоменклатуры", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПричиныОтменыЗаказовКлиентов(Команда)
	
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказовПоставщикам.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УправлениеЭлементами()

	
	ПравоДоступаСпособыПополненияЗапаса = ПравоДоступа(
			"Просмотр",
			Метаданные.Справочники.СпособыОбеспеченияПотребностей
			);
		
	ПравоДоступаИсточникиДанныхПланирования = ПравоДоступа(
			"Просмотр",
			Метаданные.Справочники.ИсточникиДанныхПланирования
			);
	
	ПравоДоступаКлассификация = ПравоДоступа("Использование", Метаданные.Обработки.Классификация);
	
	ПравоДоступаИспользоватьПричиныОтменыЗаказовПоставщикам = ПравоДоступа("Просмотр", Метаданные.Справочники.ПричиныОтменыЗаказовПоставщикам);
	
	ИспользоватьПланированиеПродажИВнутреннегоПотребления = ПолучитьФункциональнуюОпцию(
			"ИспользоватьПланированиеПродажИВнутреннегоПотребления"
			);
	ИспользоватьПричиныОтменыЗаказовПоставщикам = ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовПоставщикам");
	
	Элементы.ГруппаУправлениеЗапасами.Видимость = ПравоДоступаСпособыПополненияЗапаса;
	Элементы.ГруппаПланирование.Видимость = ИспользоватьПланированиеПродажИВнутреннегоПотребления
		И ПравоДоступаИсточникиДанныхПланирования;
	Элементы.ГруппаКлассификацияНоменклатуры.Видимость = ПравоДоступаКлассификация;
	
	Элементы.ГруппаНастроекПричиныОтменыЗаказов.Видимость = ИспользоватьПричиныОтменыЗаказовПоставщикам И  ПравоДоступаИспользоватьПричиныОтменыЗаказовПоставщикам;
	
КонецПроцедуры
